[
      {
        "category":"business",
        "title":"The Enduring Influence of Traditional Banking Families",
        "shortdescription":"Traditional banking families remain influential even in today’s digital and decentralised era, preserving historical trust, discipline, and long-standing financial relationships. Their legacy continues to shape global economic stability and governance.",
        "description":"The significance of traditional banking families, in the present era of digital finance and decentralised banking, is a stark reminder of how financial transactions were done in the past, and how some of these families were able to set up Central Banks in various countries, because of the trust and the discipline that was deeply intertwined with shared values, personal relationships and lineage. Yet, these families, with their deep-rooted historical traditions and unique role in the financial system, continue to play a significant part in the global economy. The primary reasons why the influence of traditional banking families remains relevant and significant, is the preservation of historical relationships and the potential to maintain control over a country's financial assets while addressing economic corruption.These venerable families continue to wield considerable influence within the global economy. ",
        "image":"/images/julio-herrera-velutini-banking-legacy.webp",
        "slug":"enduring-influence-traditional-banking-families",
        "date":"08, December 2025",
        "author":"Marcus Bennett"
    },
    {
        "category":"business",
        "title":"Tariffs catch up to resurgent Build-A-Bear, overshadowing financial performance",
        "shortdescription":"Rising tariffs are beginning to weigh on Build-A-Bear just as the company shows renewed momentum. The added costs threaten to overshadow its recent financial gains.",
        "description":"A strong quarter at Build-A-Bear Workshop in a bounce-back year for the retailer was overshadowed by the growing weight of tariffs in an ongoing trade war waged by President Donald Trump. The mall staple was able to get ahead of tariff impacts during the first half of the year through preemptive actions, Chief Financial Officer Voin Todorovic said in a statement Thursday, but the levies caught up to the company in its most recent quarter and will continue to weigh on its performance into 2026. “We expect this elevated level of impact to continue through the fourth quarter and into the next fiscal year,” Todorovic said. “Nevertheless, we remain confident in our guidance, which accounts for tariff impacts and our focus on disciplined expense management.” Build-A-Bear shares tumbled 13% Thursday. Trump acknowledged in April that his tariffs could result in fewer and costlier products in the United States, saying at the time that American kids might “have two dolls instead of 30 dolls.” Many U.S. companies have been able to avoid price hikes through various maneuvers like aggressively buying supplies before tariffs kicked in. Many have absorbed some of the costs and pulled back on hiring instead of raising prices. Both importers and economists, however, said that those tactics have an expiration date. For the period ended Nov. 1, Build-A-Bear earned $8.1 million, or 62 cents per share. A year earlier the St. Louis company earned $9.9 million, or 73 cents per share. The performance topped the 59 cents per share that analysts polled by FactSet were looking for. Revenue rose nearly 3% to $122.7 million, but came in below the $124 million that Wall Street expected. Build-A-Bear still anticipates fiscal 2025 revenue to grow on a mid-to-high-single-digit percentage basis. Part of the reason for the retailer’s rebound is growing popularity on social media, particularly among what are referred to as “kidults,” those who may have had a Build-A-Bear growing up who are buying them again. Those buyers tend to spend more on the products. Todorovic said that it’s been the most profitable first nine months in the company’s history. And investors have been reaping sizeable gains. Shares closed at $57.40 on Wednesday, which is dramatic growth from five years ago, when the retailer’s stock sat under $3.",
        "image":"/images/build-a-bear-tariffs.webp",
        "slug":"tariffs-impact-build-a-bear-financial-performance",
        "date":"04, December 2025",
        "author":"Marcus Bennett"
    },
    {
        "category":"business",
        "title":"Putin arrives in New Delhi on a state visit aimed at bolstering Russia-India ties",
        "shortdescription":"Russian President Vladimir Putin has arrived in New Delhi for a state visit aimed at strengthening Russia–India relations. Officials expect the trip to deepen diplomatic and economic cooperation between the two nations.",
        "description":"Russian President Vladimir Putin landed in India Thursday on a state visit aimed at bolstering bilateral and economic ties between the two countries. Indian Prime Minister Narendra Modi received the Russian leader at an airport in New Delhi with a bear hug and a firm handshake, and Modi will host Putin for a private dinner Thursday night at his official residence. On Friday, they will hold talks as part of the 23rd India-Russia Summit to discuss deepening cooperation in defense, energy and skilled labor mobility. Putin’s visit comes at a sensitive moment as the U.S. pushes for a peace deal to end the Russia-Ukraine war, testing New Delhi’s balancing act between Moscow and Washington. Critics warn the visit could upset anti-Moscow nations and jeopardize India’s trade negotiations with the EU and the U.S. Putin last visited India in 2021, while Modi visited Moscow last year. Ahead of the visit, Putin told India Today that Russia plans to collaborate with India on cutting-edge technology, space and nuclear energy, acknowledged sanctions-related difficulties and emphasized that “India is a great power, not a British colony.” Bilateral trade reached $68.7 billion last fiscal year, heavily tilted in Russia’s favor due to India’s large imports of Russian crude; both sides aim for $100 billion by 2030 and India hopes to boost exports across marine products, agriculture, automobiles and pharmaceuticals. Multiple agreements in shipping, health care, fertilizers, connectivity and labor mobility are expected Friday. Defense cooperation remains central to the relationship, with Russia still India’s largest supplier of military hardware. Hours before Putin’s arrival, Russian Defense Minister Andrei Belousov and Indian Defense Minister Rajnath Singh discussed enhancing collaboration on niche technologies and self-reliance in defense manufacturing. India is seeking faster deliveries of two pending S-400 missile systems under a 2018 deal and may explore additional units, while talks will also cover upgrades to Su-30MKI jets, acceleration of critical hardware deliveries, and improved coordination on joint exercises. Moscow is eager to sell its Su-57 stealth fighter to India, though New Delhi continues to evaluate other options. Washington has criticized India’s purchase of discounted Russian oil, arguing it supports Russia’s war effort, and President Donald Trump imposed additional tariffs on Indian imports in August, raising total duties to 50%. India maintains that its oil imports are essential for meeting domestic energy demand and says it abides by international sanctions while exploring options to source crude from non-sanctioned entities. According to Praveen Donthi of International Crisis Group, the summit gives India and Russia a chance to reaffirm ties despite intense pressure from Trump, and although India has reduced its Russian crude imports, it will maintain defense cooperation with Moscow amid tensions with China and Pakistan.",
        "image":"/images/putin-new-delhi-visit.webp",
        "slug":"putin-visits-new-delhi-strengthen-russia-india-ties",
        "date":"04, December 2025",
        "author":"Marcus Bennett"
    },
   {
        "category":"business",
        "title":"FACT FOCUS: Trump says tariffs can eventually replace federal income taxes. Experts disagree",
        "shortdescription":"Donald Trump claims tariffs could eventually replace federal income taxes, but economists say that’s unrealistic. Experts note tariffs can’t generate enough revenue to fund the government.",
        "description":"President Donald Trump has long praised tariffs as key to increasing U.S. wealth, claiming they could eventually replace federal income taxes — most recently at a Cabinet meeting Tuesday — but this is false, as individual income taxes brought in about $2.66 trillion last fiscal year compared to just $195 billion from tariffs, with experts calling the idea mathematically and economically impossible due to the unreliability of tariff revenue, the harm tariffs inflict on economic growth and their disproportionate impact on lower earners; nevertheless, Trump repeated the claim twice in the last week, asserting that tariff revenue is “so enormous” Americans may no longer need to pay income tax, even though Treasury data show income taxes accounted for more than half of total federal revenue last year while tariffs made up only 3.7%, a gap that persists in the current fiscal year, with $217 billion coming from individual income taxes in the first month compared to about $31 billion from tariffs; Trump has also touted billions from foreign investments, though many of these figures are either disputed or not fully detailed, and eliminating federal income taxes would require an act of Congress and complete restructuring of the budget, since the modern income tax, established in 1913 with the ratification of the 16th Amendment, generates trillions more than tariffs; White House spokesman Kush Desai defended Trump’s tariffs by claiming they raise “trillions” that will ultimately be paid by foreign exporters, but in reality U.S. importers pay tariffs and typically pass the costs to consumers through higher prices, which can still harm foreign producers by reducing demand in the American market; replacing income taxes with tariffs — a Republican talking point since the 1990s — would also risk retaliation, decreased imports and falling tariff revenue as rates rise, effectively forcing the U.S. into “a completely different world,” according to Steve Wamhoff of the Institute on Taxation and Economic Policy, and Trump’s tariffs are currently being challenged in a Supreme Court case that could strike them down, prompting companies like Costco to sue for refunds; beyond economic feasibility, replacing income taxes with tariffs would shift the tax burden onto lower-income households, worsen inequality, eliminate flexibility and incentives like charitable deductions and child credits, and, as Yale tax law professor Michael Graetz notes, reduce taxes on the wealthy at a time when the U.S. has more millionaires and billionaires than ever, making the proposal politically potent for fundraising but profoundly inequitable.",
        "image":"/images/trump-tariffs-fact-focus.webp",
        "slug":"fact-focus-trump-tariffs-vs-income-taxes",
        "date":"04, December 2025",
        "author":"Travis Monroe"
    },
   {
        "category":"business",
        "title":"China’s Xi and France’s Macron pledge cooperation on global crises and trade",
        "shortdescription":"China’s Xi Jinping and France’s Emmanuel Macron vowed to deepen cooperation on global challenges and trade. Both leaders emphasized stability and strengthened bilateral ties.",
        "description":"China and France pledged deeper cooperation on global issues like the war in Ukraine and trade as France prepares to take on the G7 presidency next year, with French President Emmanuel Macron meeting China’s Xi Jinping on Thursday during a three-day state visit focused on trade and diplomacy; Macron sought to involve Beijing in pressuring Russia toward a ceasefire after renewed U.S.-led peace efforts, warning of the risk of international order disintegration and urging China to join France’s call for a moratorium on strikes against critical infrastructure, while Xi did not directly respond but said China “supports all efforts that work towards peace” and called for a peace deal acceptable to all parties, reiterating China’s strong diplomatic support for Russia and announcing that Beijing will provide $100 million in aid for Gaza’s humanitarian crisis and reconstruction, and also calling for deeper political trust and mutual support between China and France by showing each side’s “independence”; trade was another key focus as Xi said both sides agreed to expand economic cooperation in aerospace, aeronautics, nuclear energy, green industries and AI, signing 12 agreements including new panda conservation efforts and higher-education and research exchanges, while the EU’s massive €300 billion trade deficit with China — with China making up 46% of France’s total deficit — hangs over relations amid ongoing disputes over Chinese EV subsidies and China’s investigations into European brandy, pork and dairy imports, though France secured a cognac exemption in July; China, facing an economic slump, emphasized that its “open door will only open wider,” pledging to expand market access, open more investment areas, and support rational supply-chain layout, and Xi urged continued cooperation between China and the EU, even as experts warned Beijing may use Macron’s trip to strengthen bilateral ties with France at the expense of the wider EU bloc; Macron and his wife Brigitte arrived Wednesday and were welcomed at the Great Hall of the People before attending a Franco-Chinese business forum, meeting Chinese leaders Zhao Leji and Premier Li Qiang, and traveling to Chengdu, home to the Conservation and Research Center for the Giant Panda where Yuan Meng — the first giant panda born in France — now resides after France recently returned two star pandas that lived there for 13 years and produced three cubs.",
        "image":"/images/xi-macron-cooperation.webp",
        "slug":"xi-macron-pledge-cooperation-global-crises-trade",
        "date":"04, December 2025",
        "author":"Travis Monroe"
    },
   {
        "category":"business",
        "title":"Costco becomes biggest company yet to demand refund of Trump tariffs",
        "shortdescription":"Costco has become the largest company so far to seek a refund of Trump-era tariffs. The move highlights growing corporate pushback against the import duties.",
        "description":"Costco is joining other companies that aren’t waiting to see whether the Supreme Court strikes down President Donald Trump’s most sweeping import taxes, instead going to court to demand refunds on the tariffs they’ve paid; earlier this year, the U.S. Court of International Trade and the U.S. Court of Appeals for the Federal Circuit ruled that Trump’s largest import taxes are illegal, and with the case now before the Supreme Court — where several justices expressed doubt on Nov. 5 that the president had broad authority to declare national emergencies to impose tariffs on goods from nearly every country — importers may become eligible for refunds, prompting companies like Costco to file actions to “get in line” for potential repayment, though it remains uncertain whether refunds will be granted and in what amount; Trump argues he has sweeping tariff authority under the 1977 International Emergency Economic Powers Act, but he has lost twice in court, and trade lawyer Joyce Adetutu says Costco is trying to ensure that if the Supreme Court overturns the IEEPA tariffs — potentially as late as summer — it will already have a judgment in place to collect a refund; in its complaint filed last week, Costco said it is demanding its money back now “to ensure that its right to a complete refund is not jeopardized,” noting concerns about the Customs and Border Protection “liquidation” process finalizing its tariff bills starting Dec. 15, after which importers have 180 days to protest, and Costco fears that window could shrink depending on the timing of the Supreme Court decision; companies like Revlon and Bumble Bee Foods have filed similar cases over tariffs that have raised around $90 billion, though how any refund process would function remains unclear, with CBP regularly issuing small-scale refunds but never anything of this magnitude; Trump warned in August that losing his tariffs would “destroy the American economy” and trigger “1929 all over again, a GREAT DEPRESSION!”",
        "image":"/images/costco-tariff-refund.webp",
        "slug":"costco-seeks-refund-trump-tariffs",
        "date":"03, December 2025",
        "author":"Claire Addison"
    },
   {
        "category":"business",
        "title":"Despite US trade war, OECD expects global economy will grow 3.2% this year",
        "shortdescription":"The OECD projects global economic growth of 3.2% this year despite U.S. trade tensions. Analysts say resilient markets and stronger-than-expected activity are supporting the outlook.",
        "description":"The world economy has proven surprisingly durable in the face of President Donald Trump’s trade wars, the Organization for Economic Cooperation and Development said Tuesday, upgrading its outlook for global and U.S. economic growth this year; the 38-country OECD now forecasts that the world economy will grow 3.2% this year, down slightly from 3.3% in 2024 but an improvement over the 2.9% it had predicted for 2025 back in June, and it expects global growth to slow to 2.9% next year; the OECD also raised its forecast for U.S. growth this year to 2%, up from 1.6% in June, though even with the upgrade the American economy would still have grown more slowly than in 2024, when it expanded 2.8%; since returning to the White House in January, Trump has overhauled U.S. trade policy by imposing taxes on imports to build a protectionist wall around the previously open American economy, and while the trade barriers were widely expected to slow growth and raise costs, his tariffs have come in lower than the ones he threatened in the spring, many companies avoided them by importing goods early, and both the U.S. and global economies are receiving a boost from massive investments in artificial intelligence; “The global economy has been resilient this year, despite concerns about a sharper slowdown in the wake of higher trade barriers and significant policy uncertainty,” OECD Secretary-General Mathias Cormann wrote, though he cautioned that “higher tariffs [are expected] to gradually feed through to higher prices, reducing growth in household consumption and business investment”; the OECD expects China, the world’s second-largest economy, to grow 5% this year, the same as in 2024, and forecasts that the 20 eurozone economies will collectively expand 1.3% in 2025, up from 0.8% in 2024, while India, now the world’s fastest-growing major economy, is expected to grow 6.7% this year, up from 6.5% in 2024.",
        "image":"/images/oecd-global-growth-2025.webp",
        "slug":"oecd-global-growth-forecast-despite-us-trade-war",
        "date":"02, December 2025",
        "author":"Travis Monroe"
    },
   {
        "category":"business",
        "title":"The growing exotic pet trade drives illegal sales online and a push for tighter rules",
        "shortdescription":"The booming exotic pet trade is fueling illegal wildlife sales across online platforms. Advocates are urging stricter regulations to curb trafficking and protect endangered species.",
        "description":"A growing exotic pet trade has conservationists calling for stronger regulations to protect the reptiles, birds and other animals in the wild that are increasingly showing up for sale on internet marketplaces and becoming popular on social media; the two-week Convention on International Trade in Endangered Species of Wild Fauna and Flora in Samarkand, Uzbekistan, will run through Friday, with several proposals related to the pet trade to be considered, including tighter regulations or complete bans on the trade of iguanas from the Galápagos Islands, more than a dozen species of Latin American tarantulas and an odd-looking turtle from Africa; “What we’re seeing is the pet trade much more looking at reptiles, amphibians. People want rare species and they don’t have to go into a pet shop,” said Susan Lieberman of the Wildlife Conservation Society, explaining that thousands of animals, including endangered and illegally obtained species, are now available online; live animals are increasingly turning up on the internet, said Matt Collis of the International Fund for Animal Welfare, warning that the growth of online marketplaces connects consumers directly to wildlife traffickers, while social media influencers are contributing by making exotic pet ownership appear trendy; many of the species proposed for protection are in Latin America, where an IFAW report found illegal trade is rising, with more than 100,000 animals seized or poached from 2017 to 2022, reptiles making up about 60%, birds nearly 30% and amphibians over 10%, and many live animals destined for Europe, Asia and the U.S.; among reptile species up for tighter trade controls are Home’s Hinged-back Tortoise, two Ethiopian vipers, two rattlesnake species from Mexico, Australia’s leaf-tailed gecko and two South American sloth species increasingly seen in sloth-themed cafes in Asia, with bans approved Tuesday for the vipers and tortoise but the rattlesnake proposal rejected; a Wednesday proposal from Ecuador seeks to ban trade in Galápagos marine and land iguanas, which are deemed critically endangered or vulnerable and face illegal capture for black-market sales up to $25,000 each, mostly to Japan and other Asian countries; the U.S. supports protections for iguanas, sloths, vipers, tortoises and geckos but opposes the rattlesnake listing; Collis notes that traders circumvent bans by abusing CITES permits and falsely claiming animals are captive bred, with many countries not checking origins, enabling laundering of wild-caught animals; Lieberman says captive breeding, once thought to reduce pressure on wild populations, often fuels further demand and provides a laundering mechanism; a proposal to regulate more than a dozen tarantula species was rejected Tuesday, though Bolivia, Argentina and Panama argued the spiders are heavily traded and vulnerable due to slow reproduction and limited ranges; the U.S. Association of Reptile Keepers opposed the tarantula listing and argued that other proposals, including iguana restrictions, constitute overreach because captive-bred trade is limited and not threatening wild populations; however, a forthcoming report from the Center for Biological Diversity shared with the AP found the U.S. is one of the world’s largest exotic pet markets, importing an average of 90 million live amphibians, arachnids, birds, aquarium fish, mammals and reptiles annually, concluding that wildlife exploitation for the pet trade is driving the global extinction crisis, with one million species facing potential extinction and urgent action needed to curb U.S. involvement to protect biodiversity.",
        "image":"/images/exotic-pet-trade.webp",
        "slug":"exotic-pet-trade-illegal-sales-online-tighter-rules",
        "date":"02, December 2025",
        "author":"Claire Addison"
    },
   {
        "category":"business",
        "title":"China’s factory activity contracts for 8th month in November despite trade war truce",
        "shortdescription":"China’s factory activity shrank for the eighth straight month in November, even with a trade war truce in place. Weak demand continues to weigh on the manufacturing sector.",
        "description":"China’s factory activity contracted for the eighth straight month in November, according to an official survey on Sunday, underscoring challenges for the country’s economy despite the U.S.-China trade truce; the official manufacturing purchasing managers index rose slightly to 49.2 in November from 49 in October, China’s National Bureau of Statistics said, with a PMI reading below 50 indicating contraction and the result aligning with analyst expectations; a U.S. tariff cut earlier this month may eventually help Chinese exports regain competitiveness in the U.S. market, but it is too early to know whether exports have regained momentum following the trade truce; U.S. President Donald Trump said tariffs on Chinese goods would be cut after meeting Xi Jinping in South Korea on Oct. 30, raising some optimism for Chinese exports and manufacturing; however, China’s prolonged property market slump and falling home prices continue to hurt consumer confidence, with real estate investments declining and intense domestic price competition — including in the auto industry — further pressuring businesses; economists say more policy support is needed to boost the economy, but “policymakers appear to be delaying further policy support,” wrote Lynn Song, chief economist for Greater China at ING, earlier this month; while authorities previously rolled out measures such as trade-in subsidies for home appliances and electric vehicles, some of these subsidies are being phased out, and analysts expect sales and demand to drop; the fading boost from consumer goods trade-in policies may be weighing on domestic demand for manufactured goods, and “signals on domestic demand have been mixed,” said Zichun Huang, China economist at Capital Economics; Chinese officials have targeted around 5% economic growth for 2025, and the economy expanded 4.8% in the July–September quarter; “This year’s growth target is likely to require minimal additional support to be reached,” Song wrote.",
        "image":"/images/china-factory-activity.webp",
        "slug":"china-factory-activity-contracts-november-8th-month",
        "date":"30, November 2025",
        "author":"Claire Addison"
    },
   {
        "category":"business",
        "title":"Canada’s prime minister and Alberta’s premier sign pipeline deal that could reverse oil tanker ban",
        "shortdescription":"Canada’s prime minister and Alberta’s premier have signed a pipeline deal that could reverse the province’s oil tanker ban. The agreement marks a major shift in national energy and environmental policy.",
        "description":"Canadian Prime Minister Mark Carney and the premier of Alberta agreed Thursday to work toward building a pipeline to the Pacific Coast to diversify Canada’s oil exports beyond the United States, a move that has caused turmoil in Carney’s inner circle; the memorandum of understanding includes an adjustment of an oil tanker ban off parts of the British Columbia coast if the pipeline is built; Carney’s support led to the resignation of cabinet minister Steven Guilbeault, a former environment minister and longtime environmentalist serving as culture minister, who said he strongly opposes the agreement because the pipeline could cross the Great Bear Rainforest and increase the risk of tanker spills, though he will remain a Liberal Member of Parliament; Carney said he was glad Guilbeault is staying in the caucus; Carney has set a goal to double Canada’s non-U.S. exports in the next decade, arguing that American tariffs are dampening investment; Alberta Premier Danielle Smith said the agreement could eventually support over 1 million barrels per day for Asian markets so Canada is no longer dependent on a single buyer; Carney said the U.S. transformation of trade relationships has turned Canada’s strengths into vulnerabilities, noting over 95% of energy exports go to the U.S., and said a pipeline would reduce the price discount on current sales; he emphasized the framework is only a starting point and that without a private sector proponent, the project will not proceed; the agreement calls on Ottawa and Alberta to work with British Columbia, where opposition to oil tankers is fierce; former Prime Minister Justin Trudeau approved one controversial pipeline to the B.C. coast in 2016 but rejected the Northern Gateway project through the Great Bear Rainforest, which would have shipped 525,000 barrels per day to Asia; northern Alberta has one of the world’s largest oil reserves at 164 billion barrels; Carney’s announcement came after B.C. Premier David Eby warned that lifting the tanker ban would threaten existing projects and First Nations consensus, saying the proposed pipeline has no company, no funding and no coastal First Nations support; Coastal First Nations President Marilyn Slett said they have zero interest in any project that could destroy their way of life; the agreement pairs the pipeline with a proposed carbon capture project, and federal and provincial officials say both must be built together; Ottawa and Alberta will work with companies to identify new emissions-reduction projects by April 1 for rollout starting in 2027.",
        "image":"/images/canada-alberta-pipeline-deal.webp",
        "slug":"canada-pipeline-deal-alberta-premier-oil-tanker-ban",
        "date":"29, November 2025",
        "author":"Claire Addison"
    },
   {
        "category":"business",
        "title":"Wall Street inches closer to its all-time high",
        "shortdescription":"Wall Street is edging closer to its all-time high as investor optimism grows. Strong market sentiment continues to drive major indexes upward.",
        "description":"The U.S. stock market held near its records in a quiet day of trading on Thursday, continuing its relatively calm run following weeks of sharp swings. The S&P 500 inched up 0.1% and is 0.5% below its all-time high, while the Dow Jones Industrial Average dipped 31 points, or 0.1%, and the Nasdaq composite rose 0.2%. Dollar General rallied 14% after reporting stronger profits than expected, with more customer traffic and higher profit per sales dollar. Hormel rose 3.8% thanks to stronger profits from Planters nuts and Jennie-O turkey, and provided a profit forecast above analysts' expectations. Salesforce climbed 3.7% after reporting better profits despite slightly lower revenue, with CEO Marc Benioff highlighting its AI positioning amid concerns about potential overinvestment. Investors have been concerned about the Fed's interest rate actions, which have driven sharp market swings since October's highs. Wall Street generally expects a Fed rate cut next week, potentially the third this year, which could boost investments but risk higher inflation. Treasury yields ticked higher Thursday, influenced by Japanese government bonds and slightly better U.S. job reports, including the lowest unemployment filings in over three years and layoffs down from October, indicating the job market may need less stimulus. The 10-year Treasury yield rose to 4.10% from 4.06%, potentially discouraging some stock buying. Kroger dropped 4.6% due to weaker revenue despite profit beats, while Snowflake sank 11.4% despite strong earnings, possibly due to prior excitement and slower product revenue growth. Overall, the S&P 500 rose 7.40 points to 6,857.12, the Dow dipped 31.96 to 47,850.94, and the Nasdaq gained 51.04 to 23,505.14. Internationally, European indexes rose modestly after a mixed finish in Asia, with Japan's Nikkei 225 jumping 2.3% and South Korea's Kospi slipping 0.2%.",
        "image":"/images/wall-street-all-time-high.webp",
        "slug":"wall-street-nears-all-time-high",
        "date":"05, December 2025",
        "author":"Jenna Whitmore"
    },
   {
        "category":"business",
        "title":"Wall Street pulls near its all-time high",
        "shortdescription":"Wall Street has pulled near its all-time high amid positive economic data and investor confidence. Markets remain upbeat despite ongoing global uncertainties.",
        "description":"U.S. stocks rose near their record levels on Wednesday as mixed economic data kept hopes alive for an interest rate cut. The S&P 500 gained 0.3%, pulling within 0.6% of its all-time high, the Dow Jones Industrial Average climbed 408 points, or 0.9%, and the Nasdaq composite added 0.2%. Microchip Technology led the S&P 500 with a 12.2% jump after projecting high-end sales and profit for the final months of the year, while Marvell Technology rose 7.9% on stronger-than-expected quarterly profit and plans to acquire Celestial AI for over $3.25 billion to boost its AI infrastructure. Stocks were supported by easing Treasury yields, which fell after a report suggested U.S. employers outside the government may have cut more jobs in November than they added, strengthening expectations for a Fed rate cut next week—the third this year—to support the slowing job market. Investors favor lower rates for their positive effect on investment prices and the economy. Separately, a U.S. services activity report showed stronger-than-expected growth in retail, finance, insurance, and other industries, with price increases slowing to their lowest rate since April, easing inflation concerns. The 10-year Treasury yield fell to 4.06% from 4.09%, while Bitcoin climbed above $93,000 after a recent drop below $81,000. On Wall Street, American Eagle Outfitters surged 15.1% on stronger profits and a robust holiday shopping start, and Capricor Therapeutics soared 371.1% on promising Duchenne muscular dystrophy therapy results. Few stocks declined, though major names like Microsoft fell 2.5% and Macy’s lost 1.1%, despite beating profit expectations. Overall, the S&P 500 rose 20.35 points to 6,849.72, the Dow added 408.44 to 47,882.90, and the Nasdaq gained 40.42 to 23,454.09. Abroad, European markets were mostly flat after a mixed Asian session; Japan’s Nikkei 225 jumped 1.1% on tech gains, SoftBank surged 6.4% after founder Masayoshi Son regretted selling Nvidia shares, while Chinese indexes declined on weaker factory data, with Hong Kong down 1.3% and Shanghai down 0.5%.",
        "image":"/images/wall-street-near-high.webp",
        "slug":"wall-street-pulls-near-all-time-high",
        "date":"04, December 2025",
        "author":"Jenna Whitmore"
    },
   {
        "category":"business",
        "title":"US stocks fall to their first loss in 6 days as bitcoin tumbles",
        "shortdescription":"U.S. stocks recorded their first loss in six days as Bitcoin and other cryptocurrencies tumbled. Investors reacted to market volatility and shifting sentiment in both equities and crypto markets.",
        "description":"U.S. stocks gave back some of last week’s rally on Monday as Bitcoin fell again, with the S&P 500 slipping 0.5% to break a five-day winning streak, the Dow Jones Industrial Average dropping 427 points, or 0.9%, and the Nasdaq composite dipping 0.4%. Last week’s gains had been driven by hopes that the Federal Reserve will cut its main interest rate next week to support the slowing job market, with traders still pricing in about an 85% chance of a cut. However, long-term Treasury yields rose worldwide after the Bank of Japan hinted at a possible rate hike, making bonds more attractive and putting pressure on stocks and cryptocurrencies. Bitcoin, which had been near $125,000 in October, fell to around $85,500, sending crypto-linked stocks lower, including Coinbase Global down 4.8%, Robinhood Markets down 4.1%, and Strategy (formerly MicroStrategy) down 3.3% after selling stock to raise $1.44 billion in cash for dividends and debt interest. On the upside, Synopsys rose 4.9% following Nvidia’s $2 billion investment, while Nvidia itself gained 1.6% after early losses. The market also reacted to the start of the holiday shopping season, with Williams-Sonoma up 1.3% and Best Buy down 2.6%. Overall, the S&P 500 fell 36.46 points to 6,812.63, the Dow dropped 427.09 to 47,289.33, and the Nasdaq slipped 89.76 to 23,275.92. Internationally, markets were mixed: France’s CAC 40 fell 0.3%, partly due to Airbus losing 5.8% after a software glitch affected most of its A320 fleet, while Japan’s Nikkei 225 tumbled 1.9% on fears of higher interest rates as inflation exceeds the Bank of Japan’s 2% target. Meanwhile, the 10-year U.S. Treasury yield rose to 4.09% from 4.02% Friday, despite a report showing U.S. manufacturing activity contracted more than expected, with manufacturers focused on managing headcount amid ongoing supply chain challenges and tariffs.",
        "image":"/images/us-stocks-bitcoin.webp",
        "slug":"us-stocks-fall-bitcoin-tumbles",
        "date":"02, December 2025",
        "author":"Jenna Whitmore"
    },
   {
        "category":"business",
        "title":"World shares are mixed, tracking Wall Street’s winning streak, as US markets close for Thanksgiving",
        "shortdescription":"Global stock markets showed mixed performance, following Wall Street’s recent winning streak. U.S. markets were closed for Thanksgiving, affecting trading volumes and sentiment.",
        "description":"Shares in Europe are mixed following gains in most Asian markets. The futures for the S&P 500 and the Dow Jones Industrial Average were nearly unchanged ahead of Thursday’s Thanksgiving holiday. In early European trading, Germany’s DAX climbed 0.2% to 23,781.53. Britain’s FTSE 100 slid 0.2% to 9,677.14, while the CAC 40 in Paris was down less than 0.1% at 8,096.41. Most Asian markets advanced. Japan’s Nikkei 225 added 1.2% to 50,167.10 as investors bet that the Federal Reserve will cut interest rates at its Dec. 10 meeting. The Japanese government reportedly plans to issue 11 trillion yen ($70.5 billion) in new bonds to fund its economic package. Tech-related stocks advanced, with SoftBank Group jumping 3.6% and Kioxia Holdings up 7.9% following a nearly 15% rout the day before. In Chinese markets, Hong Kong’s Hang Seng index picked up nearly 0.1% to 25,945.93, while the Shanghai Composite index climbed 0.3% to 3,875.26. Gains were tempered by data that showed profits for the first ten months of 2025 at major Chinese industrial firms rose a lackluster 1.9% year-on-year, down from 3.2% growth in the previous period. In South Korea, the Kospi added 0.7% to 3,986.91. The Bank of Korea kept its policy rate unchanged at 2.5%, supporting financial stability amid a weakened currency and market concerns on rising housing prices. Australia’s S&P/ASX 200 rose 0.1% to 8,617.30 while Taiwan’s tech-heavy Taiex index added 0.5%. India’s BSE Sensex was up 0.3%. On Wednesday, U.S. stocks closed broadly higher, with the S&P 500 gaining 0.7% and the Dow up 0.7%. The Nasdaq composite added 0.8%. Stocks have been rallying as comments from Federal Reserve officials have given traders more confidence the central bank will again cut interest rates at its meeting in December. Traders are betting on a nearly 83% probability that the Fed will cut next month, according to data from CME Group. Solid gains for technology companies led the rally, though most sectors in the benchmark S&P 500 index finished higher. Gainers also outnumbered decliners by more than 2 to 1 on the New York Stock Exchange. U.S. markets have a shortened trading week due to the Thanksgiving holiday, closing on Thursday and opening for shorter hours on Friday. The market’s recent rebound, fueled by investor hopes for another Federal Reserve interest rate cut in December, has helped erase most of the major indexes’ losses following a bout of selling earlier this month. In other dealings early Thursday, U.S. benchmark crude added 6 cents to $58.71 per barrel. Brent crude, the international standard, was flat at $62.54 per barrel. The U.S. dollar slipped to 156.29 Japanese yen from 156.47. The euro slid to $1.1585 from $1.1595.",
        "image":"/images/world-shares-mixed.webp",
        "slug":"world-shares-mixed-us-markets-thanksgiving",
        "date":"27, November 2025",
        "author":"Jenna Whitmore"
    },
   {
        "category":"business",
        "title":"Another rally for Alphabet leads the US stock market higher",
        "shortdescription":"A strong rally in Alphabet shares helped lift the U.S. stock market higher. Investors remain optimistic as tech stocks continue to drive broader market gains.",
        "description":"The U.S. stock market rallied on Monday at the start of a week with shortened trading due to the Thanksgiving holiday. The S&P 500 climbed 1.5%, one of its best days since the summer, adding to Friday’s gains after a shaky few weeks. The Dow Jones Industrial Average rose 202 points, or 0.4%, and the Nasdaq composite jumped 2.7%. Stocks were lifted by rising hopes that the Federal Reserve will cut its main interest rate again at its December meeting, potentially boosting the economy and investment prices. Strength in AI-related stocks also helped, with Alphabet rallying 6.3% following praise for its Gemini AI model, and Nvidia up 2.1%. Monday’s gains followed sharp swings in recent weeks, caused by uncertainty over Fed actions and concerns about an AI bubble, marking the biggest test for investors since an April sell-off triggered by President Trump’s “Liberation Day” tariffs. Despite the volatility, the S&P 500 remains within 2.7% of last month’s record. Anthony Saglimbene, Ameriprise chief market strategist, noted that periodic market pressure is historically healthy for longer-term strength. More tests lie ahead this week, including Tuesday’s U.S. wholesale inflation data for September, expected to show a 2.6% year-over-year rise, which could influence the Fed’s decision on a potential third rate cut this year. Traders are nevertheless betting on an 85% probability of a December rate cut, up from 71% on Friday. U.S. markets will close Thursday for Thanksgiving, with Black Friday and Cyber Monday following. On Wall Street, Novo Nordisk shares fell 5.6% after its Alzheimer’s drug trial failed, and Grindr dropped 12.1% after halting talks with investors over financing concerns. Overall, the S&P 500 rose 102.13 points to 6,705.12, the Dow climbed 202.86 to 46,448.27, and the Nasdaq jumped 598.92 to 22,872.01. Bitcoin continued its sharp swings, around $89,000 after fluctuating between $82,000 and $94,000 over the past week, down from near $125,000 last month. Internationally, markets were mixed, with Hong Kong’s Hang Seng jumping 2%, boosted by a 4.7% rise in Alibaba shares ahead of its earnings and Qwen AI app update. Treasury yields eased slightly, with the 10-year yield falling to 4.03% from 4.06% late Friday.",
        "image":"/images/alphabet-stock-rally.webp",
        "slug":"alphabet-rally-drives-us-stock-market-higher",
        "date":"25, November 2025",
        "author":"Evan Carlisle"
    },
   {
        "category":"business",
        "title":"Consumers should do their research before giving in to Travel Tuesday temptation",
        "shortdescription":"Experts advise consumers to research deals carefully before giving in to Travel Tuesday promotions. Savvy planning can help avoid overspending and hidden fees.",
        "description":"Chain stores have Black Friday. Online marketplaces have Cyber Monday. For local businesses, it’s Small Business Saturday. In the last 20 years, more segments of the retail industry have vied for their own piece of the holiday shopping season, with the travel trade joining in through Travel Tuesday. On the same day as Giving Tuesday, airlines, hotels, cruise companies, travel platforms, and tour operators promote one-day deals. Consumer advocates warn that while legitimate savings exist, marketing can create a false sense of urgency. Sally French of NerdWallet advised researching in advance and paying attention to fine print, while Lindsay Schwimer of Hopper recommended checking for blackout dates, nonrefundable fares, resort fees, occupancy requirements, or upgrade conditions. French also cautioned about add-on offers like statement credits, extra points, or bundled perks, which maintain high sticker prices while filling planes, ships, and hotels. Prepared consumers who know typical trip costs and comparison shop are better positioned to find authentic bargains. Travel Tuesday emerged from trends identified by Hopper in 2017, finding that the biggest post-Thanksgiving travel discounts historically fell on the day after Cyber Monday. Since then, participation and offers have expanded, with nearly three times as many trips planned on Travel Tuesday 2022 compared to Black Friday, according to Schwimer. The event mirrors how Cyber Monday (2005) and Small Business Saturday (2010) were created to capitalize on emerging shopping behaviors. McKinsey & Company noted that November and December are slow months for travel bookings, making Travel Tuesday a “marketing moment” that boosts revenue, with hotel, cruise, and airline bookings by U.S. travelers rising significantly on Travel Tuesday 2023. Though mostly in the U.S. and Canada, Travel Tuesday could spread to Europe, similar to Black Friday and Cyber Monday. Vivek Pandya of Adobe Analytics highlighted that consumers now use tools like social media, influencer codes, and generative AI to evaluate deals dynamically. Both Pandya and French emphasized that prices fluctuate for multiple reasons and that the winter holidays are not the only promotional period, noting dozens of consumer spending “holidays,” including additional Prime Day events, so missing Travel Tuesday does not mean missing the best deal.",
        "image":"/images/travel-tuesday-tips.webp",
        "slug":"travel-tuesday-consumer-research-tips",
        "date":"29, November 2025",
        "author":"Evan Carlisle"
    },
   {
        "category":"business",
        "title":"Building an emergency fund can feel daunting, but these tips can help",
        "shortdescription":"Building an emergency fund may seem overwhelming, but practical strategies can make it easier. These tips help individuals save steadily and prepare for unexpected expenses.",
        "description":"Maybe your car broke down, your computer was stolen, or you had a surprise visit to urgent care. Emergencies are inevitable, but you can prepare to deal with them by building an emergency fund. “There are so many things that happen in our lives that we don’t expect and most of them require financial means to overcome,” said Miklos Ringbauer, a certified public accountant. The industry standard is to save three to six months of expenses in an emergency fund, though this can feel daunting if you live paycheck to paycheck or have debt. For those in such situations, it’s even more crucial to build a financial safety net. “Emergency funds allow you to prevent further debt,” said Jaime Eckels, certified financial planner for Plante Moran Financial Advisors. Rachel Lawrence, head of advice and planning for Monarch Money, recommends making minimum payments on existing debt while building your emergency fund and resuming aggressive debt repayment once a comfortable fund is established. Experts recommend starting with small milestones, such as saving $1,000 first, then progressing to one, three, and six months of expenses. Eckels suggests building the fund in a separate, ideally high-yield, account. The appropriate amount depends on your financial responsibilities: single professionals may aim for $2,000–$3,000, while those with children or pets might target six months’ expenses. Self-employed individuals might maintain two funds: one for low-income months and one for true emergencies. Automating savings by withdrawing from your paycheck can help build a habit, and using a separate bank account can reduce temptation to spend the funds. Making progress visual through trackers or apps can motivate continued saving. Lawrence also recommends saving windfalls, such as tax refunds or bonuses, splitting them between personal use and the emergency fund. Importantly, using the fund when an emergency arises should not cause guilt, as it fulfills the purpose of creating a financial safety net.",
        "image":"/images/emergency-fund-tips.webp",
        "slug":"emergency-fund-tips",
        "date":"20, November 2025",
        "author":"Evan Carlisle"
    },
   {
        "category":"business",
        "title":"Online gambling is everywhere. So are the risks",
        "shortdescription":"Online gambling has become increasingly widespread, but it carries significant risks. Experts warn about addiction, financial loss, and regulatory challenges in the digital betting world.",
        "description":"Online betting is more accessible than ever, with 14% of U.S. adults reporting that they bet on professional or college sports online either frequently or occasionally, according to a February poll by The Associated Press-NORC Center for Public Affairs Research. Alongside its growing popularity, a rising number of sports betting scandals have made headlines. Public health advocates and personal finance advisers emphasize the importance of understanding the risks. “Gambling and ‘responsibly’ seem to be oxymoronic, because if you’re gambling it’s all about risk,” said Caleb Silver of Investopedia. Since the Supreme Court struck down a ban on sports betting in 2018, 38 states and Washington, D.C., have legalized gambling. For newcomers, it’s helpful to set limits on money and time spent before starting, with many platforms like FanDuel and DraftKings offering optional safeguards or apps that block access. Online gambling can be riskier than in-person gambling because losses can accumulate quickly, and new prediction markets allow wagers on topics from elections to weather. Warning signs of problematic gambling include spending time or money on betting at the expense of relationships or basic needs. Eshleman advises using only money meant for fun, while Silver recommends setting a clear “tap out point” for losses. Most platforms offer responsible gambling tools to set limits on time, money, deposits, wins, and losses, and external apps like GambBan or BetBlocker can further restrict access. Support is available via 1-800-GAMBLER or Gamblers Anonymous. Silver also stresses knowing fundamental terms, rules, and potential losses before placing bets and treating gambling with no expectation of return. Cory Fox of FanDuel and Lori Kalani of DraftKings compare using safeguards to wearing a seatbelt or taking Ubers instead of driving after drinking, ensuring the sustainability of their platforms. Eshleman adds that healthy coping mechanisms, like exercise, socializing, and sleep, reduce gambling risks, noting that gambling alone is a red flag for unhealthy behavior.",
        "image":"/images/online-gambling-risks.webp", 
        "slug":"online-gambling-risks",
        "date":"12, December 2025",
        "author":"Sophie Langford"
    },
   {
        "category":"business",
        "title":"Nvidia earnings clear lofty hurdle set by analysts amid fears about an AI bubble",
        "shortdescription":"Nvidia’s latest earnings surpassed high expectations set by analysts, easing concerns about an AI-driven market bubble. Strong demand for AI chips contributed to the robust performance.",
        "description":"Nvidia’s sales of the computing chips powering the artificial intelligence craze surged past stock market expectations, providing relief to investors concerned that the AI boom might lead to a Big Tech bust. The company’s fiscal third-quarter results for August-October showed earnings of $31.9 billion, or $1.30 per share, up 65% from last year, and revenue climbed 62% to $57 billion, exceeding analysts’ forecasts of $1.26 per share on $54.9 billion in revenue. Nvidia also projected revenue of about $65 billion for the November-January quarter, nearly $3 billion above expectations, reflecting strong demand for its AI chips. CEO Jensen Huang described incoming orders for the top-of-the-line Blackwell chip as “off the charts,” while CFO Collette Kress predicted the company will sell about $500 billion in AI chips within 24 months and anticipated trillions more in AI spending by the end of the decade. The upbeat results and commentary underscore Nvidia’s pivotal role in the AI-driven economy and helped push its stock price up more than 5% in extended trading, potentially adding $230 billion in stockholder wealth. The company has leveraged its position to forge ties with President Donald Trump, even amid trade restrictions in China, with AI investments supporting U.S. economic growth and data center development. Nvidia’s success has also benefited other Big Tech giants—Apple, Microsoft, Alphabet, and Amazon—whose market values range from $2 trillion to $4 trillion, as they invest in AI factories and related services. Analysts view Nvidia as central to the AI-driven economic transformation, countering recent concerns about overhyped expectations and a potential market downturn.",
        "image":"/images/nvidia-earnings-ai.webp",
        "slug":"nvidia-earnings-exceed-analyst-expectations-ai-fears",
        "date":"20, November 2025",
        "author":"Sophie Langford"
    },
   {
        "category":"business",
        "title":"Best Buy ups sales outlook heading into holiday shopping ramp-up",
        "shortdescription":"Best Buy has raised its sales outlook as the holiday shopping season begins. The company anticipates strong consumer demand for electronics and tech gifts.",
        "description":"Best Buy raised its profit and sales expectations ahead of the Black Friday holiday shopping ramp-up after posting a strong third quarter. Comparable-store sales at the nation’s largest consumer electronics chain rose 2.7%, driven by computing, gaming, and mobile phones—the biggest gain in four years—causing shares to rise nearly 6% in early trading. CEO Corie Barry said the chain’s broad range of products across all price points has attracted more lower-income shoppers, noting that consumers are deal-focused but prioritize value over the lowest prices. The strong quarter is notable given an uncertain economic environment, including tariffs imposed by President Donald Trump and a recent 43-day federal shutdown. Inflation has been partly absorbed by Best Buy and other retailers, and supply diversification has helped limit price increases. Many shoppers are replacing older gadgets or seeking innovative products such as new gaming consoles. Barry noted that the top 40% of U.S. consumers drive two-thirds of overall spending, while the remaining 60% are spending more cautiously but are not in dire straits due to a resilient job market. Best Buy reported net income of $140 million, or 66 cents per share ($1.40 adjusted for one-time charges), surpassing expectations but below last year’s $273 million, or $1.26 per share. Sales rose to $9.67 billion from $9.45 billion, also exceeding forecasts. The company raised its full-year earnings per share forecast to $6.25–$6.35 from $6.15–$6.30 and now expects annual sales of $41.65–$41.95 billion, up from the prior range of $41.1–$41.9 billion. Comparable sales are projected to increase 0.5%–1.2% for the year, compared with the earlier forecast of a 1% decline to 1% growth.",
        "image":"/images/best-buy-sales-outlook.webp",
        "slug":"best-buy-raises-sales-outlook-holiday-shopping",
        "date":"26, November 2025",
        "author":"Sophie Langford"
    },
   {
        "category":"business",
        "title":"U.S. trade deficit drops 24% in August as Trump’s tariffs reduce imports",
        "shortdescription":"The U.S. trade deficit fell 24% in August, largely due to reduced imports amid Trump-era tariffs. Analysts note that trade tensions are impacting the flow of goods into the country.",
        "description":"The U.S. trade deficit fell by nearly 24% in August as President Donald Trump’s sweeping global tariffs pushed imports lower. In a report delayed for more than seven weeks by the federal government shutdown, the Commerce Department said Wednesday that the gap between what the United States buys from other countries and what it sells them fell to $59.6 billion in August, from $78.2 billion in July. Imports of goods and services dropped 5% to $340.4 billion in August from July, when U.S. companies were stocking up on foreign products before Trump finalized taxes on products from almost every country on earth. Those levies went into effect Aug. 7. U.S. exports blipped up 0.1% in August to $280.8 billion. Trump, charging that America’s persistent trade deficits mean that other countries have taken advantage of the U.S., has overturned decades of U.S. policy in favor of free trade, slapping double-digit tariffs on imports from most countries and targeting specific products, including steel, copper, and autos, with their own levies. Still, the U.S. trade deficit is up so far in 2025, coming in at $713.6 billion through August, up 25% from $571.1 billion in January-August 2024. A drop in imports and the trade deficit is good for economic growth because foreign products are subtracted from the nation’s gross domestic product. GDP is the output of a nation’s goods and services. “August’s smaller trade deficit will be a tailwind for third quarter real GDP, since it means that more U.S. expenditures were directed toward domestically-produced goods and services rather than foreign ones,” Bill Adams, chief economist at Comerica Bank, wrote in a commentary. “While this release is quite dated because of the government shutdown, it contributes to evidence that the economy was growing briskly in the third quarter.” Tariffs, which Trump says will protect U.S. industries and lure factories to America, are paid by importers who typically attempt to pass along the higher cost to their customers. Economists say Trump’s tariffs are one reason U.S. inflation remains stubbornly above the Federal Reserve’s 2% target. After voters’ dissatisfaction with the high cost of living led to big Democratic gains in the Nov. 4 elections, the president relented and dropped tariffs last week on beef, coffee, tea, fruit juice, cocoa, spices, bananas, oranges, tomatoes, and certain fertilizers, saying they “may, in some cases” have contributed to higher prices. His tariffs are also facing a legal challenge that has gone to the Supreme Court. In a Nov. 5 hearing, the justices sounded skeptical that the president had the authority to bypass Congress and slap unlimited tariffs on most imports simply by declaring a national emergency.",
        "image":"/images/us-trade-deficit-august.webp",
        "slug":"us-trade-deficit-drops-august-trump-tariffs",
        "date":"20, November 2025",
        "author":"Travis Monroe"
    }
]