[
    {
        "category":"entertainment",
        "title":"A string of awards makes it clear: ‘One Battle After Another’ is the Oscar front-runner",
        "shortdescription":"A streak of major awards has positioned *One Battle After Another* as the clear Oscar front-runner. Critics say its momentum signals strong industry support heading into the final stretch.",
        "description":"NEW YORK — If there were any doubt, the first few days of Hollywood’s year-end awards have already made it abundantly clear: Paul Thomas Anderson’s “One Battle After Another” is the Oscar front-runner. On Monday, the film won best picture at the 35th Gotham Awards. On Tuesday, it was named best film by the New York Film Critics Circle. On Wednesday, it swept the National Board of Review Awards, taking best film, best director for Anderson, and acting honors for Leonardo DiCaprio, Benicio del Toro and newcomer Chase Infiniti. Expect to hear this pun a lot: one award after another. “I didn’t expect this, actually,” Anderson said at the Gothams. “I started to think I didn’t know what was going on.” That may be the first and last time he can say that this season. “One Battle After Another,” a father-daughter tale of political resistance, has become the movie of the moment. Its opening scene — a raid at an immigrant detention facility — has resonated strongly in the first year of President Donald Trump’s second term. Even critics of the film, like conservative commentator Ben Shapiro, have predicted it will “win all the Academy Awards.” Yet it is also an Oscar anomaly: a major studio release that skipped festivals, underperformed at the box office and cost a fortune. If it wins best picture on March 15, it may be one of the rare money-losers to take Hollywood’s top prize. Smaller films like “The Hurt Locker,” “Moonlight” and “Nomadland” have dominated best picture in recent years, but even those were commercial successes or major streaming wins. “One Battle After Another,” with a production budget of at least $130 million and another $70 million in marketing, has made $70.6 million domestically and $131.6 million internationally — strong for an R-rated, three-hour auteur film, but not enough to guarantee profitability. Variety has estimated a possible $100 million loss, a claim Warner Bros. disputes, raising the prospect that it could become the first best-picture-winning “flop.” Awards season is far from settled. Upcoming contenders include A24’s “Marty Supreme” and Focus Features’ “Hamnet,” while Ryan Coogler’s “Sinners” — also from Warner Bros. — may be its strongest challenger. Both films return to IMAX screens December 12. Still, compared with a fall box-office slump that sank films like “The Smashing Machine,” “Roofman” and “Christy,” Anderson’s film is practically a breakout hit. Its greatest financial liability is simply its cost — an unusually large budget for the kind of adult-driven prestige film Hollywood rarely bankrolls anymore. For many, that scale is a badge of honor. Win or lose, “One Battle After Another” stands as a defiant entry in a style of filmmaking increasingly under threat. Or, in the words of DiCaprio’s character Bob Ferguson: “Viva la revolution!”",
        "image":"/images/one-battle-after-another.webp",
        "slug":"one-battle-after-another-oscar-front-runner",
        "date":"04, December 2025",
          "author":{
            "name":"Marcus Bennett",
            "role":"Political Correspondent",
            "bio":"Marcus covers U.S. politics and policy with sharp, accessible reporting. He breaks down political developments so readers understand what they mean in real life.",
            "image":"/images/marcus-bennett.webp",
            "email":"marcusbennett@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584651071329",
            "instagram":"https://www.instagram.com/marcusbennett2025/",
            "substack":"https://substack.com/@marcusbennett2",
            "medium":"https://medium.com/@marcusbennett_21499"
        }
    },
    {
        "category":"entertainment",
        "title":"‘Peter Hujar’s Day,’ ‘Train Dreams,’ and ‘Sorry, Baby’ lead Spirit Award nominations",
        "shortdescription":"“Peter Hujar’s Day,” “Train Dreams,” and “Sorry, Baby” topped this year’s Spirit Award nominations. The selections highlight a strong slate of independent filmmaking.",
        "description":"Ira Sachs’ “Peter Hujar’s Day,” which recreates an interview with the 1970s photographer, led the Film Independent Spirit Awards nominations with five nods, including best feature and best director, as well as lead and supporting performance nominations for Ben Whishaw and Rebecca Hall, as the organization announced nominees for the 41st edition on Wednesday. Several films followed with four nominations — including best feature and best director — such as Clint Bentley’s lyrical Denis Johnson adaptation “Train Dreams” and Eva Victor’s “Sorry, Baby,” about life after an assault, while first features receiving four nods included “Blue Sun Palace,” “One of Them Days” and “Lurker.” James Sweeney’s dark comedy “Twinless” and “The Plague,” which also stars Joel Edgerton like “Train Dreams,” were nominated for best feature, and Edgerton was among the 10 best acting nominees for “Train Dreams,” alongside Rose Byrne (“If I Had Legs I’d Kick You”), Dylan O’Brien (“Twinless”), Keke Palmer (“One of Them Days”), Tessa Thompson (“Hedda”) and Whishaw, who also earned a nomination for the Netflix series “Black Doves,” as the Spirit Awards have used gender-neutral acting categories since 2022. Supporting performance nominees included Naomi Ackie (“Sorry, Baby”), Zoey Deutch (“Nouvelle Vague”), Kirsten Dunst (“Roofman”), Nina Hoss (“Hedda”), Jane Levy (“A Little Prayer”), Archie Madekwe (“Lurker”), Kali Reis (“Rebuilding”), Jacob Tremblay (“Sovereign”) and Haipeng Xu (“Blue Sun Palace”), while the Robert Altman Award — honoring a film’s director, ensemble and casting — went to the Stephen King adaptation “The Long Walk,” featuring Mark Hamill, Cooper Hoffman and David Jonsson. International film nominees included “Sirāt,” “The Secret Agent” and “On Becoming a Guinea Fowl,” with documentary selections such as “Come See Me in the Good Light,” “My Undesirable Friends: Part I — Last Air in Moscow,” “The Perfect Neighbor,” “The Tale of Silyan” and “Endless Cookie,” and on the television side, “Adolescence,” “Forever” and “Mr Loverman” led with four nominations each, as the organization noted that nominees spanned 18 countries, with 41% identifying as women. While the Spirit Awards sometimes overlap significantly with Oscar contenders — as seen with “Anora” and “Everything Everywhere All At Once” — their eligibility cap excludes films with budgets over $30 million, keeping higher-cost productions like “One Battle After Another” out of contention. The 41st Spirit Awards will depart their longtime Santa Monica Pier location for the Hollywood Palladium, with the Feb. 15 ceremony serving as a major fundraiser for Film Independent’s year-round programs and taking place nearly a month ahead of the Oscars.",
        "image":"/images/spirit-awards-nominations.webp",
        "slug":"spirit-award-nominations-hujar-train-dreams-sorry-baby",
        "date":"03, December 2025",
          "author":{
            "name":"Marcus Bennett",
            "role":"Political Correspondent",
            "bio":"Marcus covers U.S. politics and policy with sharp, accessible reporting. He breaks down political developments so readers understand what they mean in real life.",
            "image":"/images/marcus-bennett.webp",
            "email":"marcusbennett@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584651071329",
            "instagram":"https://www.instagram.com/marcusbennett2025/",
            "substack":"https://substack.com/@marcusbennett2",
            "medium":"https://medium.com/@marcusbennett_21499"
        }
    },
   {
        "category":"entertainment",
        "title":"The PlayStation turns 30: Looking back at the console that gave us Lara Croft and ‘The Last of Us’",
        "shortdescription":"The PlayStation marks its 30th anniversary, celebrating a legacy that introduced iconic characters like Lara Croft and paved the way for titles such as “The Last of Us.” Fans reflect on how the console reshaped gaming history.",
        "description":"NEW YORK — When Kendrick Lamar kicked off his Super Bowl halftime show earlier this year, he performed atop a massive grid of flashing lights shaped like a giant PlayStation controller — a square, triangle, cross and circle — a surprise nod to Sony’s console as PlayStation celebrates its 30th anniversary in North America and Europe, and another reminder of how deeply the brand has permeated global culture, from “Lara Croft: Tomb Raider” and “Shaun of the Dead” to Juice WRLD’s “Hear Me Calling” and HBO’s “The Last of Us.” Sony Interactive Entertainment’s Eric Lempel says PlayStation “made gaming cool,” evolving from a disruptive newcomer in 1995 to a premier entertainment brand, with its rise fueled by smart decisions like adopting CD-ROMs, securing developers early, launching with a strong game library, pricing the original console at $299, and appealing to teens and young adults while Sega and Nintendo targeted children. The PlayStation became a sensation, selling more than 100 million units and moving gaming from the bedroom into the living room, followed by the PlayStation 2 — still the best-selling console ever with roughly 160 million units sold — thanks in part to being an affordable DVD player. Sony stumbled with the expensive Blu-ray-driven PS3 and its 2011 network hack, but rebounded with the PS4 and its focus on multiplayer, streaming, and robust exclusives, then advanced further with the PS5’s haptic feedback, adaptive triggers and 4K capabilities. PlayStation’s cultural impact now extends into Hollywood with adaptations such as “Uncharted,” “Gran Turismo,” “Twisted Metal,” and “The Last of Us,” with more coming, including “Horizon Zero Dawn,” “Ghost of Tsushima,” and Amazon’s “God of War,” aided by PlayStation’s cinematic storytelling, motion-captured performances, and proximity to Sony Pictures. The brand’s influence has even reached fashion and footwear, including Yinka Ilori’s PlayStation-inspired loungewear and Travis Scott’s Nike Dunk Low Cactus Jack X PlayStation sneakers, while fans’ devotion shows in everything from tattoos to merchandise — something Lempel says reflects how PlayStation has become “a big part of people’s lives” far beyond gaming.",
        "image":"/images/playstation-30th-anniversary.webp",
        "slug":"playstation-30th-anniversary-look-back",
        "date":"04, December 2025",
          "author":{
            "name":"Marcus Bennett",
            "role":"Political Correspondent",
            "bio":"Marcus covers U.S. politics and policy with sharp, accessible reporting. He breaks down political developments so readers understand what they mean in real life.",
            "image":"/images/marcus-bennett.webp",
            "email":"marcusbennett@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584651071329",
            "instagram":"https://www.instagram.com/marcusbennett2025/",
            "substack":"https://substack.com/@marcusbennett2",
            "medium":"https://medium.com/@marcusbennett_21499"
        }
    },
   {
        "category":"entertainment",
        "title":"Iran sentences acclaimed director Jafar Panahi in absentia to a year in prison",
        "shortdescription":"Iran has sentenced acclaimed filmmaker Jafar Panahi to one year in prison in absentia. The ruling adds to ongoing concerns about artistic freedom in the country.",
        "description":"Iran has sentenced acclaimed director Jafar Panahi to one year in prison in absentia and imposed a two-year travel ban after a Tehran court convicted him of “propaganda activities against the system,” according to his lawyer Mostafa Nili, who said he will appeal the ruling, even as Panahi was in New York City on Monday receiving three Gotham Awards for his film “It Was Just an Accident,” which also won the Palme d’Or at Cannes in September; Panahi, one of Iran’s most celebrated filmmakers, has spent the past two decades facing imprisonment, travel bans and house arrest yet continued working, filming his latest movie clandestinely in Iran after a seven-month imprisonment that ended in 2023 following a hunger strike, drawing on stories from fellow inmates for the revenge drama about former prisoners attempting to identify a man they believe could have been their torturer despite having been blindfolded in detention, and the film has been selected as France’s submission for the Academy Awards.",
        "image":"/images/jafar-panahi-sentence.webp",
        "slug":"iran-sentences-jafar-panahi-in-absentia",
        "date":"02, December 2025",
         "author":{
            "name":"Claire Addison",
            "role":"Senior Investigative Reporter",
            "bio":"Claire uncovers in-depth stories with a focus on accuracy, accountability, and clear reporting. She specializes in investigations that help readers understand the truth behind complex issues.",
            "image":"/images/claire-addison.webp",
            "email":"claireaddison@fiscalfusion.org",
            "twitter":"https://x.com/claire_add1703",
            "facebook":"https://www.facebook.com/profile.php?id=61584652001298",
            "instagram":"https://www.instagram.com/claireaddison2025/",
            "substack":"https://substack.com/@claireaddison1",
            "medium":"https://medium.com/@claireaddison_68794"

        }
    },
   {
        "category":"entertainment",
        "title":"What to Stream: ‘Stranger Things,’ ‘Mickey 17,’ Kevin Hart and ‘A Grand Ole Opry Christmas’",
        "shortdescription":"New streaming picks include fresh “Stranger Things” content, the sci-fi film “Mickey 17,” a Kevin Hart special, and “A Grand Ole Opry Christmas.” Here’s what to watch this week.",
        "description":"Bong Joon Ho’s “Mickey 17,” a new batch of “Stranger Things’” final season and Kevin Hart debuting a new comedy special on Netflix are some of the new television, films, music and games headed to a device near you, and also among the streaming offerings worth your time this week, as selected by The Associated Press’ entertainment journalists, are “Everybody Loves Raymond” getting a 30th anniversary special on CBS, Hallmark’s special “A Grand Ole Opry Christmas” with Brad Paisley and Mickey Guyton, and a new Beatles documentary series hitting Disney+; new movies to stream from Nov. 24-30 include Taiwanese filmmaker Shih-Ching Tsou’s solo directorial debut “Left-Handed Girl,” about a single mother and her two daughters returning to Taipei to open a night market stand, which Netflix acquired after its warm Cannes reception and Taiwan selected as its Oscar submission, beginning streaming Nov. 28, Bong Joon Ho’s “Mickey 17,” arriving on Prime Video Thursday, Nov. 26, praised by AP’s Jocelyn Noveck for Robert Pattinson’s performance that grounds Bong’s overstuffed tendencies, and “The Last Duel,” streaming on Hulu Nov. 30, Ridley Scott’s medieval epic told from three perspectives and hailed by AP’s Jake Coyle as a deconstruction of armored male mythmaking; new music to stream Nov. 24-30 includes Disney+ releasing “The Beatles Anthology” documentary series starting Wednesday, nine episodes tracing the band’s journey, and Hallmark’s “A Grand Ole Opry Christmas,” a holiday film involving music, heritage, time travel, Christmas magic and cameos by Brad Paisley, Megan Moroney, Mickey Guyton, Rhett Akins and Tigirlily Gold, streaming Sunday; new series to stream from Nov. 24-30 include a CBS-taped 30th anniversary special for “Everybody Loves Raymond” airing Monday and streaming on Paramount+, hosted by Ray Romano and Phil Rosenthal with cast interviews and tributes to Peter Boyle and Doris Roberts, the long-awaited return of “Stranger Things” for its fifth and final season on Netflix with the first four episodes dropping Wednesday, Kevin Hart’s new Netflix comedy special “Kevin Hart: Acting My Age” on Monday, and Hulu’s new “Family Guy” holiday parody special “Disney’s Hulu’s Family Guy’s Hallmark Channel’s Lifetime’s Familiar Holiday Movie” dropping Friday, Nov. 28; and new video games from Nov. 24-30 include A.I.L.A from Brazilian studio Pulsatrix, in which you play a game tester trying out an AI-created horror story while the AI may be plotting something more sinister in the background, arriving Tuesday on PlayStation 5, Xbox X/S and PC.",
        "image":"/images/what-to-stream.webp",
        "slug":"what-to-stream-stranger-things-mickey17-kevin-hart-opry-christmas",
        "date":"24, November 2025",
          "author":{
            "name":"Evan Carlisle",
            "role":"U.S. News Reporter",
            "bio":"Evan reports on major U.S. news stories with a focus on clarity, relevance, and timely updates that help readers stay informed about what’s happening across the country.",
            "image":"/images/evan-carlisle.webp",
            "email":"evancarlisle@fiscalfusion.org",
            "twitter":"https://x.com/EvanCarlis90819",
            "facebook":"https://www.facebook.com/profile.php?id=61584747486041",
            "instagram":"https://www.instagram.com/evancarlisle92/",
            "substack":"https://substack.com/@evancarlisle",
            "medium":"https://medium.com/@evancarlisle_85958"
        }
    },
   {
        "category":"entertainment",
        "title":"Myanmar state television broadcasts army crackdown on scam centers",
        "shortdescription":"Myanmar state television has aired footage of a military crackdown on scam centers. Officials say the raids target criminal networks exploiting forced labor and online fraud.",
        "description":"Myanmar’s military government has begun broadcasting lengthy state-TV videos of its crackdown on online scam centers, showing buildings being bulldozed and more than 1,000 foreigners detained; the country is notorious for cyberscam operations involving romance-based schemes and fake investments that the U.N. Office on Drugs and Crime estimates generate nearly $40 billion a year, and the unusually detailed MRTV reports appear aimed at publicizing the junta’s actions after months of negative publicity and international pressure since it seized power in 2021, with authorities recently raiding major scam hubs KK Park and Shwe Kokko near Myawaddy on the Thai border, the latest operation starting Nov. 18 in Shwe Kokko leading to 1,746 foreigners arrested in six days and, according to Monday’s state-run reports, a total of 12,586 foreigners detained since January and 9,978 deported through Thailand, including some who say they were tricked or forced to work there; authorities say they seized 2,893 computers, 21,750 phones, 101 Starlink devices, 21 routers and other equipment, while MRTV has shown daily videos of security forces sweeping buildings and detainees squatting in lines, plus footage of KK Park’s structures being blown up and bulldozed, though critics argue scam masterminds continue operating elsewhere; the crackdown comes amid complex control in Myawaddy involving ethnic Karen militias such as the military-allied Border Guard Force and the anti-junta Karen National Union, with both denying involvement despite accusations of past protection or real-estate links to the scam centers.",
        "image":"/images/myanmar-scam-center-crackdown.webp",
        "slug":"myanmar-tv-broadcasts-army-crackdown-scam-centers",
        "date":"25, November 2025",
          "author":{
            "name":"Evan Carlisle",
            "role":"U.S. News Reporter",
            "bio":"Evan reports on major U.S. news stories with a focus on clarity, relevance, and timely updates that help readers stay informed about what’s happening across the country.",
            "image":"/images/evan-carlisle.webp",
            "email":"evancarlisle@fiscalfusion.org",
            "twitter":"https://x.com/EvanCarlis90819",
            "facebook":"https://www.facebook.com/profile.php?id=61584747486041",
            "instagram":"https://www.instagram.com/evancarlisle92/",
            "substack":"https://substack.com/@evancarlisle",
            "medium":"https://medium.com/@evancarlisle_85958"
        }
    },
   {
        "category":"entertainment",
        "title":"‘Bel-Air’ cast reflects on series, building its own legacy and identity entering final season",
        "shortdescription":"The cast of “Bel-Air” reflects on the show’s evolution as it heads into its final season. They highlight how the series has built its own identity apart from the original sitcom.",
        "description":"Olly Sholotan first realized that “Bel-Air” had stepped out the shadows of the beloved ’90s sitcom starring Will Smith when a young boy approached him at a flea market after the show’s first season and said, “You are the first Black boy I’ve ever seen cry on TV,” a moment that made Sholotan, who plays Carlton Banks, understand how the reboot was carving out its own identity; such moments helped establish “Bel-Air” as one of Peacock’s most visible homegrown titles and expand possibilities for Black-led prestige television as the series returns Monday for its fourth and final season, with cast members reflecting on its impact and evolution as they stepped out from “the shadow of the original,” as Simone Joy Jones puts it, while Coco Jones emphasized how deeply audiences connected with the characters; though popular, the show’s large-scale ambitions and high production costs contributed to the decision to end it now, with a long roster of executive producers requiring constant coordination and showrunner Carla Banks Waddles noting the series was never intended to run indefinitely, a sentiment echoed by Jabari Banks, who said four seasons complete the story; the final season pushes the Banks family into defining turning points as Will navigates senior-year pressures, Carlton faces consequences that could derail his future, a power shift strains Phil and Geoffrey’s bond, Viv reinvents herself, Hilary deepens self-exploration, and Ashley enters high school ready to challenge norms, with Cassandra Freeman saying Viv fully steps into her own life; the season also deepens the show’s theme of redefining Black masculinity, with Jimmy Akingbola noting the emotional range given to male characters and Jordan L. Jones stressing that care and vulnerability are part of masculinity; meanwhile, the series has become a career springboard as Coco Jones’ Hilary role boosted her profile and music career—earning her a Grammy for “ICU” and leading to new film roles—while Jabari Banks starred in “Bad Genius” and said the show changed his life, and Sholotan continues expanding as both musician and actor; Waddles hopes the show’s legacy reflects the heart of the original: “Love, redemption, forgiveness and family… Loving each other through it.”",
        "image":"/images/bel-air-final-season.webp",
        "slug":"bel-air-cast-reflects-final-season-legacy",
        "date":"24, November 2025",
          "author":{
            "name":"Jenna Whitmore",
            "role":"Entertainment Writer",
            "bio":"Jenna covers entertainment, culture, and trending stories, bringing fresh perspective and concise reporting that highlights the people and moments shaping today’s entertainment landscape.",
            "image":"/images/jenna-whitmore.webp",
            "email":"jennawhitmore@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584976316567",
            "instagram":"https://www.instagram.com/jennawhitmore2025/",
            "substack":"https://substack.com/@jennawhitmore",
            "medium":"https://medium.com/@jennawhitmore"
        }
    },
   {
        "category":"entertainment",
        "title":"Steve Cropper, guitarist and member of Stax Records’ Booker T and the M.G.'s, has died at age 84",
        "shortdescription":"Steve Cropper, legendary guitarist and member of Booker T. & the M.G.'s at Stax Records, has died at 84. He was celebrated for shaping the sound of soul and rock music.",
        "description":"Steve Cropper, the soulful guitarist and songwriter who anchored Booker T. and the M.G.’s at Stax Records and co-wrote classics like “Green Onions,” “(Sittin’ on) the Dock of the Bay,” and “In the Midnight Hour,” has died at 84; Pat Mitchell Worley of the Soulsville Foundation said his family confirmed Cropper died Wednesday in Nashville, with no immediate cause of death, though longtime associate Eddie Gore said he had recently visited Cropper at a rehabilitation facility after a fall and noted he had still been working on new music, calling him “such a good human”; Cropper’s understated but unforgettable guitar licks helped define Memphis soul, and at a time when white artists often profited from Black musicians’ work, he was known for collaborating and keeping a low profile, immortalized in Sam & Dave’s “Soul Man” when Sam Moore shouted “Play it, Steve!” as he played a Zippo slider riff, a moment later recreated when he joined the Blues Brothers; in a 2020 AP interview, Cropper explained his style as listening closely to singers and other musicians, adding only what the song needed, prompting Keith Richards to call him “Perfect, man,” and Joe Bonamassa to say his moves are widely copied; born in Missouri and raised in Memphis from age 9, Cropper got his first guitar at 14 and was influenced by Chuck Berry, Jimmy Reed and Chet Atkins, joining Satellite Records (later renamed Stax) in its earliest days with his band the Royal Spades, later the Mar-Keys, who had a hit with “Last Night”; at Stax, Cropper formed Booker T. and the M.G.’s with Booker T. Jones, Donald “Duck” Dunn and Al Jackson, creating hits like “Green Onions,” “Hang ’Em High” and “Time Is Tight,” backing Otis Redding, Sam & Dave, Wilson Pickett and others, and standing out as a racially integrated band in the 1960s, with Cropper recalling that “there was absolutely no color” inside Stax; inspired by a Pickett gospel lyric, he helped write “In the Midnight Hour,” joking later that he’d been seeking forgiveness ever since; inducted into the Rock and Roll Hall of Fame in 1992 with the M.G.’s, Cropper also played in the all-star Bob Dylan tribute that year, was ranked No. 39 on Rolling Stone’s list of greatest guitarists, and cherished his collaboration with Otis Redding, especially finishing “Dock of the Bay” shortly after Redding’s fatal 1967 plane crash; Cropper appeared as “The Colonel” in *The Blues Brothers* films and toured with the band, received the Songwriters Hall of Fame induction in 2005, a Grammy lifetime achievement award in 2007, continued recording into his later years including 2024’s Grammy-nominated *Friendlytown*, and earlier this year received the Tennessee Governor’s Arts Award, the state’s highest arts honor.",
        "image":"/images/steve-cropper.webp",
        "slug":"steve-cropper-guitarist-obituary-84",
        "date":"04, December 2025",
          "author":{
            "name":"Jenna Whitmore",
            "role":"Entertainment Writer",
            "bio":"Jenna covers entertainment, culture, and trending stories, bringing fresh perspective and concise reporting that highlights the people and moments shaping today’s entertainment landscape.",
            "image":"/images/jenna-whitmore.webp",
            "email":"jennawhitmore@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584976316567",
            "instagram":"https://www.instagram.com/jennawhitmore2025/",
            "substack":"https://substack.com/@jennawhitmore",
            "medium":"https://medium.com/@jennawhitmore"
        }
    },
   {
        "category":"entertainment",
        "title":"AP’s top songs of 2025: ‘Lo que le pasó a Hawaii,’ ‘Abracadabra’ and more",
        "shortdescription":"The AP’s top songs of 2025 list features hits like “Lo que le pasó a Hawaii” and “Abracadabra.” Critics highlight the tracks as defining the year’s pop and global music trends.",
        "description":"NEW YORK — The Associated Press has selected the 10 best songs of the year, presented in no particular order. Read on and then listen to all of the tracks on our Spotify playlist. “Lo que le pasó a Hawaii,” Bad Bunny — Selecting just one song from Bad Bunny’s pivotal 2025 album “Debí Tirar Más Fotos” is a fool’s errand. Most would likely select one of the ubiquitous, up-tempo hits: “DtMF,” “Baile Inolvidable,” “NuevaYol.” And they’d be just as right. But at its heart, this album is both Benito Antonio Martínez Ocasio’s love letter to Puerto Rico and his fierce protection of it. Nowhere is that made more apparent than on “Lo que le pasó a Hawaii” (“What happened to Hawaii”), a rallying cry for Puerto Rico’s cultural autonomy in an era of neocolonialization. It begins with a somber Bad Bunny lamenting over the scrape of a güiro — a folkloric percussive instrument made of a hollow gourd. It sounds like inherited history and modernity all in one, a kind of political, timeless tune from an artist so accustomed to being the sound of the moment. “Abracadabra,” Lady Gaga — A triumphant return to form, Lady Gaga’s latest album “Mayhem” is an amalgamation of her past works. But where a return to roots for many veteran artists can play out like soft self-parody, Gaga stomps her Alexander McQueen heels on the gas pedal. Of the bunch, “Abracadabra” is a case study: maximalist electro-pop like an alternative universe “Bad Romance” with a Gesaffelstein sound. It’s familiar and evolved, Gaga’s robotic cadence delivered atop house piano and in an addictive hook. Her throaty call for magic — “Abra-ca-dabra” — is a one-woman masterclass in dance pop. It’s a little off-kilter and a whole lot addictive.",
        "image":"/images/ap-top-songs-2025.webp",
        "slug":"ap-top-songs-2025-lo-que-le-paso-a-hawaii-abracadabra",
        "date":"03, December 2025",
          "author":{
            "name":"Jenna Whitmore",
            "role":"Entertainment Writer",
            "bio":"Jenna covers entertainment, culture, and trending stories, bringing fresh perspective and concise reporting that highlights the people and moments shaping today’s entertainment landscape.",
            "image":"/images/jenna-whitmore.webp",
            "email":"jennawhitmore@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584976316567",
            "instagram":"https://www.instagram.com/jennawhitmore2025/",
            "substack":"https://substack.com/@jennawhitmore",
            "medium":"https://medium.com/@jennawhitmore"
        }
    },
   {
        "category":"entertainment",
        "title":"AP’s top albums of 2025: Bad Bunny, Rosalía, Hayley Williams, Dijon, Addison Rae and more",
        "shortdescription":"The AP’s top albums of 2025 include standout releases from Bad Bunny, Rosalía, Hayley Williams, Dijon, Addison Rae and more. Critics say the list showcases a diverse and evolving music landscape.",
        "description":"The Associated Press has selected its 10 best albums of the year, presented in no particular order and with a legend describing who might particularly enjoy them, in the vein of our revamped music reviews. “Ego Death at a Bachelorette Party,” Hayley Williams — Call her Miss Paramore if you must, but this year, it’s all about Hayley Williams; the fierce frontwoman has detoured on her own before with “Petals for Armor” and “Flowers for Vases / Descansos,” but nothing has come close to “Ego Death at a Bachelorette Party,” her greatest solo work to date, a triumph in candor across ’90s alternative, college radio indie rock and trip-hop-pop, sounding like freedom for a performer long confined by public expectations. FOR FANS OF: Autonomy, psychic recalibration, Bloodhound Gang’s “The Bad Touch.” “Addison,” Addison Rae — Not long ago, Addison Rae’s pop ascension seemed improbable, but she reinvented herself from TikTok fame into an inventive pop career; her debut album is full of sequined pop songs from trip-hop to Madonna-esque electronica, centered on “Fame Is a Gun,” an addictive, early-Grimes-like standout about desire and desperation. FOR FANS OF: Victoria’s Secret, pouring cherry coke into red wine, the long-tail legacy of Britney Spears. “Lux,” Rosalía — In late 2025, Rosalía delivered a bold surprise with “Lux,” an avant-garde, operatic, genre-defying collection sung in 13 languages, an ambitious exploration of divinity and classical training meant to challenge listeners and break rules. FOR FANS OF: Feminine intuition, divine intervention, Hildegard of Bingen. “Debí Tirar Más Fotos,” Bad Bunny — Bad Bunny’s album is a cultural reset, a celebration of Puerto Rico staged across musical traditions from reggaetón and perreo to bomba, plena, salsa and música jíbara; it’s a revolution on wax, a global superstar looking inward to his homeland for the future. FOR FANS OF: Cuatros, drinking Medalla beer on the beach, Nelson Antonio Denis’ “War Against All Puerto Ricans.” “Baby,” Dijon — Dijon’s surreal, dreamy R&B-pop and soul makes “Baby” feel like peering into the mind of a dadaist who loves Prince and springy electronics; compositions are layered, playful and wholly unique. FOR FANS OF: Grooves, the musician Panda Bear, taking a break from social media. “Bleeds,” Wednesday — The North Carolina alt-country greats sharpen their strengths on “Bleeds,” mixing jagged vocals, fuzzed guitars and mournful slide into one of indie rock’s best releases, led by Karly Hartzman’s cutting lyricism. FOR FANS OF: Urban legends, dive bar regulars, stick and poke tattoos. “Never Enough,” Turnstile — Baltimore’s Turnstile, eight-time Grammy nominees, combine hardcore punk spirit with new sonic deviations, from ’80s radio rock to lush reverb; ferocious and accessible, it’s hardcore for every listener. FOR FANS OF: Fugazi, John Waters, Carhartt jackets. “Let God Sort Em Out,” Clipse — Sixteen years after their last album, Clipse return with Pharrell-produced brilliance featuring Kendrick Lamar and Tyler, the Creator; Malice and Pusha T’s worldly, weighted flows make it one of the year’s standout rap records. FOR FANS OF: Louis Vuitton, the wisdom of distance and experience, family reunions. “Snipe Hunter,” Tyler Childers — Tyler Childers continues his idiosyncratic country brilliance with a wild, rollicking, philosophical, often ironic journey that even invokes the Bhagavad Gita alongside classic country imagery. FOR FANS OF: Wailing, rule breakers, having a sense of humor at the end of the world. “The BPM,” Sudan Archives — Sudan Archives delivers a kinetic, genre-spanning album rooted in Chicago house and Detroit techno, evolving into club-pop-soul music meant to live inside the listener’s body. FOR FANS OF: Karma, being the hottest person at the party, Jersey club music.",
        "image":"/images/ap-top-albums-2025.webp",
        "slug":"ap-top-albums-2025-bad-bunny-rosalia-hayley-williams-dijon-addison-rae",
        "date":"03, December 2025",
          "author":{
            "name":"Evan Carlisle",
            "role":"U.S. News Reporter",
            "bio":"Evan reports on major U.S. news stories with a focus on clarity, relevance, and timely updates that help readers stay informed about what’s happening across the country.",
            "image":"/images/evan-carlisle.webp",
            "email":"evancarlisle@fiscalfusion.org",
            "twitter":"https://x.com/EvanCarlis90819",
            "facebook":"https://www.facebook.com/profile.php?id=61584747486041",
            "instagram":"https://www.instagram.com/evancarlisle92/",
            "substack":"https://substack.com/@evancarlisle",
            "medium":"https://medium.com/@evancarlisle_85958"
        }
    },
   {
        "category":"entertainment",
        "title":"Apple Replay is here. What’s the No. 1 song on Apple Music’s 2025 songs chart?",
        "shortdescription":"Apple has released its annual Replay rankings, revealing the No. 1 most-played song on Apple Music in 2025. The chart highlights the year’s biggest global streaming trends.",
        "description":"NEW YORK — It arrived in 2024. And it never left. Rosé and Bruno Mars’ massively popular, Grammy-nominated “APT.” topped Apple Music’s global song chart in 2025 as the giant music streamer released year-end lists Tuesday and provided listeners with data on their own most listened-to tunes. “APT.” is both artists’ first No. 1 on the year-end global songs chart. They’re followed by another dynamic duo, Kendrick Lamar and SZA’s “Luther,” in second. Mars makes another appearance, in third, for his collaboration with Lady Gaga, “Die With a Smile.” Then it’s Lamar again in fourth — “Not Like Us” returns to a top spot, after earning the No. 1 position in 2024 — and in fifth, it’s Billie Eilish with “Birds of a Feather.” The success of Lamar’s “GNX” album kept listeners engaged, and five of his songs made the global chart’s Top 25. Of the 100 songs included on the list, 36 are from women, down slightly from 2024’s record of 39. However, seven of the Top 10 songs were by — or featured — a woman, more than double from last year. A big year for ‘APT.’ “APT.” also topped a few of Apple Music’s other end-of-year charts. They claimed the top spot on the streaming platform’s Shazam Global Radio Spins chart, the Top 100: Global Radio chart (which tracks the most played songs on radio stations around the world) and Apple’s most-read lyrics charts. “The phenomenal global success of Rosé and Bruno Mars’ ‘APT.’ has been a powerful reminder that great songs will always transcend borders,” Rachel Newman, Apple Music’s co-head, said in a statement. Apple Music’s Replay rivals Spotify’s Wrapped Also available Tuesday is Replay — Apple’s alternative to Spotify’s Wrapped — which allows Apple Music subscribers to engage with their favorite music on the streaming service this year. Replay highlights include a Discovery feature (where users can track new artists they discovered this year), Loyalty (the artists they listen to consistently) and Comebacks (the ones who’ve made a return to their listening rotation). They’ll also be able to uncover their total minutes listened, total artists listened, longest artist streak and favorite genres. Musicians themselves will be able to share listenership growth and year-over-year performance summaries. Tyler, the Creator named Apple Music’s artist of the year Last month, Apple Music named Tyler, the Creator its artist of the year. The multi-hyphenate rapper, one year after the release of his critically acclaimed album “Chromakopia,” earned 4.5 billion minutes of listening time between November 2024 and October 2025, Apple Music reported. “Tyler continues to prove that anything is possible. His creativity has been incredible all year,” Zane Lowe, Apple Music’s global creative director, said in a statement. “His creative risk-taking is only matched by the care he takes to present it, and he inspires his peers and fans now, just as he will continue to inspire generations to come.”",
        "image":"/images/apple-replay-2025.webp",
        "slug":"apple-music-replay-2025-top-song",
        "date":"02, December 2025",
          "author":{
            "name":"Sophie Langford",
            "role":"Business & Finance Correspondent",
            "bio":"Sophie covers business trends and financial developments, offering clear insights that help FiscalFusion readers understand market shifts and economic changes.",
            "image":"/images/sophie-langford.webp",
            "email":"sophielangford@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584953787187",
            "instagram":"https://www.instagram.com/sophielangford9/",
            "substack":"https://substack.com/@sophielangford1",
            "medium":"https://medium.com/@sophielangford_44287"
        }
    },
   {
        "category":"entertainment",
        "title":"AI country hit ‘Walk My Walk’ built on Blanco Brown’s sound sparks questions of attribution, ethics",
        "shortdescription":"The AI-generated country hit “Walk My Walk,” modeled on Blanco Brown’s sound, is raising concerns about attribution and artistic consent. The controversy underscores growing ethical questions in AI-made music.",
        "description":"LOS ANGELES  — When an AI-generated country song called “Walk My Walk” hit No. 1 on Billboard’s country digital song sales chart this month, it was credited to a fictional artist named Breaking Rust — a white, digitally generated avatar that didn’t exist two months ago. But the song’s vocal phrasing, melodic shape and stylistic DNA came from someone who does exist: Grammy-nominated country artist Blanco Brown, a Black music artist who has worked with Britney Spears, Childish Gambino and Rihanna. And he had no idea. “I didn’t even know about the song until people hit me up about it,” said Brown, whose 2019 country rap hit “The Git Up” helped usher in a new, hybrid era of country crossover. He didn’t learn about the chart-topping AI track until his phone was flooded with messages from friends. “My phone just kept blowing up,” he said. “Somebody said: ‘Man, somebody done typed your name in the AI and made a white version of you. They just used the Blanco, not the Brown.” The moment is the latest example of how generative AI is upending the music industry, giving anyone the ability to instantly create seemingly new songs by typing prompts into a chat window, often using models trained on real artists’ voices and styles without their knowledge. Who is behind the AI-generated country song? The credits for the grit-filled, chant-heavy track “Walk My Walk” list Aubierre Rivaldo Taylor as one of the song’s creators, with streaming platforms such as Apple Music and Spotify identifying him as both the songwriter and producer. In recent months, Taylor has also been credited on streaming platforms as the songwriter and producer behind Defbeatsai — one of several X-rated, AI-generated country artists that exploded across social media last year. The Defbeatsai ecosystem, however, connects back to another figure in Brown’s past: Abraham Abushmais, a collaborator Brown once jokingly called “Abe Einstein” for his sharp studio instincts. Abushmais co-wrote a couple of songs on Brown’s 2019 album “Honeysuckle & Lightning Bugs” and is listed as the developer of Echo, an obscure AI-powered music generator app promoted on one of Defbeats.ai’s Instagram pages with a link encouraging users to “make your own hit country song.” Brown said he wasn’t notified about their involvement in the AI hit, and the collaborator he once mentored has since become unreachable. “Abe’s number changed,” Brown said. “We used to talk. I ain’t heard from him in a year or two.” The AP reached out to Abushmais for comment but did not receive a response. The digital avatar fronting “Walk My Walk,” a white, AI-generated country singer built with a vocal approach modeled on Brown’s sound, is where the moment shifted from eerie to uncomfortable. “It’s a white AI man with a Black voice,” Brown said. “And he’s singing like a Negro spiritual.” For Brown, the shock quickly gave way to action. He went into the studio and recorded his cover of the song, which was released last week. He’s also putting out a reworked derivative of the track on Monday with new lyrics and a new arrangement. Brown’s management said his response to the song is a direct challenge to the legal, ethical and policy void surrounding AI-generated music. He wants to use his own lived experience to force the industry and lawmakers to confront who owns art and what happens when technology outpaces the rights of the human creators it imitates. “If someone is going to sing like me, it should be me,” he said. A new kind of hit rewrites rules faster than the industry can respond For musicians and educators, the success of “Walk My Walk” made one thing clear: AI-generated music has leapt from internet experiment to commercial disruptor. “We are entering a very strange and unprecedented period of both creation and industry,” said Josh Antonuccio, director of the Ohio University Music Industry Summit. “AI has essentially democratized the act of music creation itself.” That democratization has come with no guardrails. Major record labels sued Suno and Udio — two most popular AI song generators — accusing them of training their models on copyrighted recordings without permission. “These companies trained their platforms on a volume of recorded music without permission,” Antonuccio said. “It leaves creators in this strange purgatory where they’re not getting compensated.” Some labels have now shifted from lawsuits to negotiation. Universal Music Group recently settled a copyright infringement lawsuits with Udio and signed a new licensing agreement with the platform. Warner Music Group followed with its own deal on Tuesday, partnering with Suno in what the companies called a “first-of-its-kind” agreement to develop licensed AI music that both compensates and protects artists. “There’s no accountability mechanism at the moment,” he said. The sudden success of “Walk My Walk” also raises questions about the tools enabling it. Educators say most chart-ready AI vocals today are generated through systems like Suno and Udio, which let users create full songs by prompting musical genres, vocal styles and lyrical ideas. A white AI avatar singing in Black artist’s voice raises deeper questions For Brown, this situation is a legal and cultural issue. He spent years navigating country music as a Black artist who blends gospel, hip-hop, pop and twang. He’s been nominated for a Grammy and embraced by the Recording Academy, but country radio hasn’t given him consistent traction. Meanwhile, an AI song built on his vocal identity and paired with a white avatar went straight to No. 1, a dynamic he says reflects a familiar pattern in Nashville: innovation from Black artists being reattributed. “He created something with my tone and gave it a white face,” Brown said. “(Race) is an understatement in Nashville.” Music educators say the issue goes beyond authorship. While AI tools can convincingly approximate sound, they aren’t able to capture the source of it. “There are things a real artist conveys that the digital part never will,” said Shelton “Shelly” Berg, dean of the University of Miami’s Frost School of Music and a Grammy-nominated pianist. He spoke shortly after appearing on a Future of Music panel at the Grammy Museum in Los Angeles last week. “They occupy fundamentally different spaces.” Berg said AI tracks can sometimes be polished in an eerie manner, but the intangible elements of performance remain out of reach. “There’s an energy between an artist and an audience that happens in real time that you can’t see but you can feel,” he said. “We are so many light years away from that happening in an AI environment.” AI is revealing but not threatening Brown insists he’s not anti-AI. He’s not even angry with Abushmais. He’s proud that his sound inspired someone, but he understands what the moment exposes. For him, the arrival of an AI artist built on his tone only underscored something he has learned repeatedly in Nashville: talent is one thing, but how the industry assigns value is often something else. “I go through this every day with real people who steal and borrow from what I do,” Brown said. “So I don’t care if it’s a robot or a human. They’re not giving me credit anyway.” In a fast-changing landscape, Brown said artists will have one final advantage that machines can’t mimic. “Real artists are always going to prevail,” he said. “Purpose lives where greed can’t.”",
        "image":"/images/ai-walk-my-walk.webp",
        "slug":"ai-country-hit-walk-my-walk-blanco-brown-ethics",
        "date":"29, November 2025",
          "author":{
            "name":"Sophie Langford",
            "role":"Business & Finance Correspondent",
            "bio":"Sophie covers business trends and financial developments, offering clear insights that help FiscalFusion readers understand market shifts and economic changes.",
            "image":"/images/sophie-langford.webp",
            "email":"sophielangford@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584953787187",
            "instagram":"https://www.instagram.com/sophielangford9/",
            "substack":"https://substack.com/@sophielangford1",
            "medium":"https://medium.com/@sophielangford_44287"
        }
    },
   {
        "category":"entertainment",
        "title":"The greatest mystery of Rian Johnson’s ‘Knives Out’ movies? Daniel Craig’s Benoit Blanc",
        "shortdescription":"Rian Johnson’s “Knives Out” films continue to fascinate audiences, with Daniel Craig’s Benoit Blanc remaining their most intriguing mystery. His charm and ambiguity keep the series’ suspense alive.",
        "description":"The greatest mystery in Rian Johnson’s “Knives Out” movies might be Benoit Blanc. Over the course of three films, Johnson and Daniel Craig have stingily dropped clues to Blanc’s past and personal life. Since Blanc first introduced himself in “Knives Out” as “a respectful, quiet, passive observer … of the truth,” following the breadcrumbs has been a sport of its own. There are, for instance, the vague, offhand references to cases he’s cracked before: something with a tennis champion, another with a ballet dancer and, in the latest chapter, “Wake Up Dead Man: A Knives Out Mystery,” we hear about something dastardly at the Kentucky Derby that he solved. Blanc has been profiled in The New Yorker and a guest on “The View.” He appears to live with Hugh Grant. He dislikes the board game Clue. Having been caught singing Sondheim and, in the new one, humming “Skimbleshanks: The Railway Cat,” from “Cats,” we know he loves musical theater. Over the course of the “Knives Out” trilogy, Johnson and Craig have colored in Blanc with sporadic and comic revelations, adding subtle, and sometimes personal, characteristics. “I’m not as much into musical theater as Rian,” Craig says, sitting beside his director in a recent interview. “So he claims in front of a microphone,” adds Johnson. Every “Knives Out” movie is wholesale change. New setting. New case. New cast of characters. But Craig and Johnson are the mainstays. Together, they’ve turned Blanc, the last of the gentleman sleuths, into one of the greatest — “Halle Berry!” — protagonists in recent movies. In “Wake Up Dead Man,” which opens in theaters Wednesday and hits Netflix on Dec. 12, Blanc takes up the case of a monsignor (Josh Brolin) who dies mysteriously in the middle of a church service. Of the movie’s many delights — among them, Josh O’Connor’s co-leading performance as a priest under suspicion and a cast of parishioners including Andrew Scott, Jeremy Renner and Glenn Close — is seeing Craig continue to find new little wrinkles to Blanc. ‘A Southern lilt’ Rather than being set in stone, Blanc has evolved. Take that accent. The first script, Johnson recalls, described “the slightest hint of a Southern lilt.” But Craig, taking inspiration from Tennessee Williams and Shelby Foote, pushed the accent closer to, as Chris Evans’ character says in “Knives Out”: a “Kentucky-fried Foghorn Leghorn drawl.” In “Glass Onion,” he laid it on even thicker, part of a scheme revealed only later into the film. “My biggest fear was that it would devolve,” Craig says, chuckling. “If it ever becomes pastiche, it’s like, ‘Whoa, let’s get out of here.’ God knows I’m not comparing myself to Gene Wilder, but the way Gene Wilder did comedy was: It’s all through truth. As long as you’re as truthful as you can get in that situation, the funny comes out.” As thoroughly established in the role as Craig is, he very nearly missed out on Benoit Blanc. Craig was initially unavailable for “Knives Out” due to production on “No Time to Die.” Johnson sought other possible actors. “It was literally five weeks later we were shooting. We didn’t think you were available,” Johnson says. “Then something happened where suddenly you guys got delayed for three months and we had a window.” “I read it and I was shocked that someone would send this to me,” Craig says. “Overjoyed. I saw it from the off-go. I read it and I visualized it. It’s a testament to his writing. I mean, come on. Benoit Blanc.” ‘Halle Berry!’ In forming the role, Craig took inspiration from Jacques Tati’s debonair but bumbling Monsieur Hulot and Cary Grant’s elegant panache in “To Catch a Thief.” He combed through out-of-print books of Southern expressions. (One that got cut: “Butter my buns and call me a biscuit.”) Along the way, Craig has improvised some of Blanc’s best expressions. In “Wake Up Dead Man,” he suddenly blurts out, as if moved by the swelling whodunit hijinks: “Scooby Dooby Doo!” A sip of Jeremy Renner-sponsored hot sauce in “Glass Onion” led to the infamous “Halle Berry!” “All of the best lines in there are things Daniel just brings,” says Johnson. “He says, ‘What about this?’ and I start laughing. And it’s the best line in the movie.” “I have a security team and there’s a guy that says it,” Craig says of the etymology of “Halle Berry.” “I stole it. I said, ‘Can I have that?’ and he said ‘Yep.’” For Craig and Johnson, Blanc has been an ongoing conversation. “Wake Up Dead Man,” the most sincere of the three mysteries, deals significantly with matters of faith and religion. The two worked to sharpen Blanc’s perspective. In the film, he declares himself “a proud heretic. I kneel at the altar of the rational.” Then there are the ornate flourishes of dialogue Johnson pens for Blanc. Modeled on Agatha Christie’s Hercule Poirot, Blanc is the knowing product of a rich literary tradition, dusted off for modern times. In contemporary satires, Blanc is the retro lynchpin. That means Craig delivering lines like “I suspect foul play” silhouetted against a fireplace, and vowing to uncover “what this flock of wicked wolves is hiding” while framed in a stained-glass window. “Delicious,” Craig says with a grin. A franchise of their own It’s ironic that, on the heels of their own experiences with iconic film series, Johnson and Craig have built a franchise all their own. Johnson released “Knives Out” two years after the much-debated “Star Wars: The Last Jedi.” As he exited the James Bond films, Craig donned the suit of another justice-seeker, albeit one with much different swimwear. “I don’t think either of us really thought about it that way,” Johnson says. “It’s just been making one movie after another, just trying to keep it challenging and fresh for ourselves. It feels almost accidental that suddenly we’ve made three. It definitely wasn’t setting out to build, God forbid, the filthiest word in the universe, IP. We’re just trying to make movies.” “I’ve been doing this for long enough that as soon as you start counting your chickens on a job, it’s all over,” adds Craig. Yet it’s now possible, especially as the two contemplate a fourth “Knives Out” film, that there are young moviegoers who know Craig more as Benoit Blanc than they do that other B-name. If Johnson and Craig do keep “Knives Out” going, even as a two-film deal with Netflix concludes, it will allow Johnson the chance to restock his whodunit cupboard. But it will just as surely offer the opportunity to relaunch, and play with, Blanc. “I really love, in my mystery detectives, for them to be kind of enigmas. It pointedly doesn’t work when you start digging into backstory with the detective,” says Johnson. “That’s always kind of boring because character is only revealed through action and the action of a detective is such a strong thing. He’s there to solve the case.” In some ways, Blanc is like a movie star. He shows up, dazzles and goes home to his largely unseen private life. Craig likes it that way. “Going back to ‘Death on the Nile’ and ‘Evil Under the Sun,’ Petey (Ustinov) turns up looking glorious from somewhere — who knows where, some party in the South of France,” says Craig. “And he ends up leaving in the end and going off somewhere. He’s sort of alienated from the rest of the people. He has to be because he’s the guy who suspects everybody.” Every few years, Benoit Blanc comes and goes. Everything in between is a riddle.",
        "image":"/images/knives-out-benoit-blanc.webp",
        "slug":"knives-out-mystery-benoit-blanc-rian-johnson",
        "date":"25, November 2025",
          "author":{
            "name":"Sophie Langford",
            "role":"Business & Finance Correspondent",
            "bio":"Sophie covers business trends and financial developments, offering clear insights that help FiscalFusion readers understand market shifts and economic changes.",
            "image":"/images/sophie-langford.webp",
            "email":"sophielangford@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584953787187",
            "instagram":"https://www.instagram.com/sophielangford9/",
            "substack":"https://substack.com/@sophielangford1",
            "medium":"https://medium.com/@sophielangford_44287"
        }
    },
   {
        "category":"entertainment",
        "title":"For Brandon Lake, crossing over means more opportunities to spread a Christian message",
        "shortdescription":"Brandon Lake’s crossover into mainstream music is opening new doors for sharing his Christian message. The artist says broader reach helps him connect with diverse audiences.",
        "description":"Fifteen miles south of Sin City, Brandon Lake is seated backstage at a packed arena in Henderson, Nevada, preparing to perform an energetic, “family-friendly” show for thousands while on the road with his latest album, 2025’s “King of Hearts,” a Christian music release blending pop, rock, country and hip-hop in ways not often associated with worship music, and its eclecticism is one reason the album peaked at No. 7 on the Billboard 200 and earned Lake his first Top 40 hit, “Hard Fought Hallelujah” with Jelly Roll; earlier this month he was nominated for three Grammys at the 2026 awards, adding to his five wins and 15 nominations, and he also received his first CMA nomination for musical event of the year — a secular category — for the same song, which he sees as a crossover moment, explaining that he grew up on both country and Christian music and views worship not as a genre but “what we do with our lives”; his approach reflects modern listening habits, says Holly Zabka of Provident, noting younger listeners shift fluidly from Luke Combs to Lake to Harry Styles, and Lake is at the forefront of rising popularity in Christian music, with Luminate reporting Christian/gospel as the only genre where streams of new music are rising, driven by a young, streaming-forward audience, and Lake hopes this trend continues, emphasizing that songs carrying the gospel message can offer hope, identity and spiritual experience in a divided world where people are “waking up” to the need for love; in September he performed at a memorial for conservative personality Charlie Kirk, who was shot and killed at a Utah college event amid rising attacks on political figures, saying he didn’t know Kirk but accepted the invitation after learning Kirk’s family regularly listened to his music, clarifying he did not attend to make a political statement but to “minister to a widow,” and describing the event as one where, despite the political environment, “millions of people turned to worship,” with the gospel shared throughout, making it “an incredible honor.”",
        "image":"/images/brandon-lake-crossover.webp",
        "slug":"brandon-lake-crossing-over-christian-message",
        "date":"20, November 2025",
          "author":{
            "name":"Evan Carlisle",
            "role":"U.S. News Reporter",
            "bio":"Evan reports on major U.S. news stories with a focus on clarity, relevance, and timely updates that help readers stay informed about what’s happening across the country.",
            "image":"/images/evan-carlisle.webp",
            "email":"evancarlisle@fiscalfusion.org",
            "twitter":"https://x.com/EvanCarlis90819",
            "facebook":"https://www.facebook.com/profile.php?id=61584747486041",
            "instagram":"https://www.instagram.com/evancarlisle92/",
            "substack":"https://substack.com/@evancarlisle",
            "medium":"https://medium.com/@evancarlisle_85958"
        }
    },
   {
        "category":"entertainment",
        "title":"Iranian film director Jafar Panahi plans to return home despite a new prison sentence against him",
        "shortdescription":"Iranian filmmaker Jafar Panahi says he intends to return home despite receiving a new prison sentence. His decision highlights ongoing tensions between artists and state authorities.",
        "description":"Acclaimed Iranian director Jafar Panahi said Thursday in Marrakech that he plans to return home after touring with his new film “It Was Just an Accident,” insisting he has never considered exile despite facing a one-year prison sentence and a two-year travel ban issued in absentia by a Tehran court for alleged “propaganda activities against the system,” a ruling his lawyer Mostafa Nili says he will appeal; speaking to an applauding audience at the Marrakech International Film Festival, Panahi said that although his films anger Iranian authorities, he refuses to leave Iran because it is where he can “breathe,” “find a reason to live,” and “find the strength to create,” adding that he will return after his tour ends next year; Panahi, one of Iran’s most celebrated filmmakers, has continued working despite two decades of imprisonment, travel bans and house arrest, filming “It Was Just an Accident” clandestinely after a seven-month prison stint that ended in 2023 following a hunger strike; the film, a revenge drama based on stories Panahi heard in Evin Prison, follows a man who thinks he has found his former torturer and seeks confirmation from other ex-prisoners before choosing revenge or forgiveness, and it has won the Cannes Palme d’Or, drawn Oscar buzz as France’s International Feature submission, and earned three Gotham Awards; Panahi emphasized he holds only an Iranian passport and wants to keep it, saying he never considered becoming a refugee even in the hardest years, and despite the new sentence interrupting his months-long Oscar campaign, he vowed to finish the campaign and return to Iran “as soon as possible.”",
        "image":"/images/jafar-panahi-return.webp",
        "slug":"jafar-panahi-plans-return-home-despite-sentence",
        "date":"04, December 2025",
          "author":{
            "name":"Evan Carlisle",
            "role":"U.S. News Reporter",
            "bio":"Evan reports on major U.S. news stories with a focus on clarity, relevance, and timely updates that help readers stay informed about what’s happening across the country.",
            "image":"/images/evan-carlisle.webp",
            "email":"evancarlisle@fiscalfusion.org",
            "twitter":"https://x.com/EvanCarlis90819",
            "facebook":"https://www.facebook.com/profile.php?id=61584747486041",
            "instagram":"https://www.instagram.com/evancarlisle92/",
            "substack":"https://substack.com/@evancarlisle",
            "medium":"https://medium.com/@evancarlisle_85958"
        }
    },
   {
        "category":"entertainment",
        "title":"The best movies of 2025, ranked by AP film writers",
        "shortdescription":"AP film writers have released their ranking of the best movies of 2025. The list highlights standout filmmaking across genres and styles throughout the year.",
        "description":"The bean counters might say otherwise, but 2025 was a good year for movies. Filmmakers working in and out of the studio system managed to make bold, personal, wildly imaginative and singular works. Some of them even broke through to the mainstream — how extraordinary that “Sinners” is among the highest earning of the year in North America, alongside all those “safe” sequels, reboots and known brands? Most, however, are more likely destined for cult classic status. Hollywood as we know it is undergoing seismic changes, with yet another studio, Warner Bros., staring down a possible merger. This an industry that’s always under threat, though, and always seems to figure something out. If anything, 2025 was also a year in which audiences showed that they still crave the theatrical experience, whether it was to shout “chicken jockey” at the screen or, despite all logic and polling otherwise, help “KPop Demon Hunters” unofficially top the box office charts two months after hitting Netflix. More than a few greats were woefully underseen as well. But in a year which also saw the deaths of cinema icons like David Lynch, Robert Redford, Diane Keaton and Gene Hackman, it’s good to remember that box office and awards are just temporary measurements. The films are the things that last. Here are The Associated Press’ Film Writers Lindsey Bahr and Jake Coyle’s picks for the best movies of 2025: Lindsey Bahr’s top movies of 2025 1. “One Battle After Another” Paul Thomas Anderson took us on ride of the year with “One Battle After Another,” which is so many things — a clever farce, a frenetic thrill ride, a poignant drama about single parenting, a buddy comedy — it’s nearly impossible to describe compellingly or coherently. The performances are excellent from lead to smallest supporting character, the vision is ambitious and singular, and the payoff is a great time and a reminder of an experience that can only really happen at the movies. (In theaters) 2. “If I Had Legs I’d Kick You” Mary Bronstein turned her own domestic nightmare into a raw and surreal cinematic expression of maternal exhaustion and madness in “If I Had Legs I’d Kick You.” Anchored by an utterly fearless performance from Rose Byrne, Bronstein’s film is an exposed nerve come to life, existential dread manifested. Plus Conan O’Brien and A$AP Rocky. (Available for digital rental) 3. “Marty Supreme” Great filmmakers can make anything exciting, like, say, the adventures of a broke table tennis player, and true SOB Marty Mauser, in mid-century New York. Josh Safdie and his cowriter and editor Ronald Bronstein (Mary’s husband) built an enormously entertaining, white-knuckle spectacle of ambition and ego giving us the defining Timothée Chalamet performance we’ve been waiting for. (In theaters Dec. 25) 4. “Sentimental Value” The ghosts of the past and things unsaid linger in cracks and floorboards of the quiet home at the heart of Joachim Trier’s latest, a textured and mature portrait of family, grief, forgiveness and the loneliness of a life in the arts. With a moving turn from Stellan Skarsgård as an acclaimed filmmaker trying to reconnect with the daughters he cast aside for his career, it’s also surprisingly funny in its deft exploration of how difficult it can be to express love to those who matter most, even for artists. (In theaters) 5. “The Naked Gun” Finally, a great studio comedy and in the most unlikely of packages: A self-consciously shameless reboot/sequel/remake that stands on its own through Akiva Schaffer’s total commitment to absolute silliness. Only “Hamnet” elicited more tears. (Streaming on Paramount+) 6. “Sinners” Another deeply personal, go-for-broke film that (in this case) only Ryan Coogler could have made, “Sinners” is the bluesy, vampire, gangster musical we never knew we needed. Vibrantly filmed and told, with an extraordinary ensemble cast (and two Michael B. Jordans), its surface pleasures alone are worth celebrating, but every frame is also imbued with history and symbolism adding up to one of the most profound and original thrillers to grace our movie screens. (Streaming on HBO Max) 7. “Sound of Falling” Past and present also blur in Mascha Schilinski’s haunting and ethereal second feature. It’s both disorienting and transfixing in telling the stories of four young women, in four different times, on the same North German farm, somehow both coming-of-age and ghost story at once. (Wide release in theaters Jan. 16) 8. “It Was Just an Accident” Tense, devastating and even a darkly funny, Iranian filmmaker Jafar Panahi sets up an enthralling moral conundrum in his first film since his own imprisonment. What does justice look like after imprisonment and torture? What should they do to the man who did it? How can they be sure they even have the right guy? (In theaters) 9. “The Voice of Hind Rajab” Kaouther Ben Hania also confronted modern atrocities using the language of cinematic storytelling, and the real audio of a young girl’s call for help, in “The Voice of Hind Rajab,” a shattering document of the Israel-Hamas war, set entirely inside the dispatch center of the Palestine Red Crescent Society rescue service. (In theaters Dec. 17) 10. “Urchin,” “The Chronology of Water” and “Don’t Let’s Go to the Dogs Tonight” Three wonderful films this year came from familiar faces, all making their feature debuts. Harris Dickinson channeled the social realism of Ken Loach and Mike Leigh to tell a compassionate but clear-eyed story about the cycles of homelessness in “Urchin.” Kristen Stewart proved to be as bold behind the camera as she is in front of it with “The Chronology of Water,” an utterly electric and alive memory piece of trauma and inspiration. And Embeth Davidtz, drawing on her own experience, confronted a thorny story about the Rhodesian bush war fearlessly and with grace. (“Urchin” is available to rent or buy. “The Chronology of Water” is in select theaters this week, expanding in January. “Don’t Let’s Go to the Dogs Tonight” is available to rent or buy.) Also: “Hedda,” “My Father’s Shadow,” “The Secret Agent,” “The Testament of Ann Lee,” “Blue Moon,” “The Ballad of Wallis Island,” “The Mastermind,” “2000 Meters to Andriivka,” “Splitsville,” “Sorry, Baby,” “Presence,” “On Becoming a Guinea Fowl.” Jake Coyle’s top movies of 2025 1. “One Battle After Another” For a movie that feels so enthrallingly of the moment, Paul Thomas Anderson’s latest is curiously out of time. The echoes of the Black Panther and Weather Underground movements seem to belong to another era. Yet Anderson’s scruffy opus makes its own history and its own resistance. Key, I think, is that both the forces of oppression and counterculture in the film are lost in rituals and code words. It’s about finding your own grammar of struggle. And it’s also about how unstoppable Teyana Taylor is. (In theaters) 2. “No Other Choice” In Park Chan-wook’s masterful, midnight-black comedy, a newly out-of-work man (Lee Byung-hun) decides his best option to get a leg up on similarly qualified job applicants is to kill them, one by one. It’s an ingenious narrative (from Donald E. Westlake’s 1997 novel, previously adapted by Costa-Gavras) that Park extrapolates in increasingly profound ways. Park, the Korean director of “Oldboy” and “Decision to Leave,” remains at the height of his diabolical powers. (In theaters Dec. 25) 3. “It Was Just an Accident” Jafar Panahi has made a lot of great films, many of them in extraordinary circumstances. All of them, despite the hardships they document and exist in, are also playful and entertaining. So see his latest not just because it’s an important Iranian film, shot through with pain and fury, and made by one of the most courageous filmmakers on the planet, but because it’s gripping and funny and human. (In theaters) 4. “Marty Supreme” The annals of great New York movies have a new one. Josh Safdie’s picaresque pingpong epic, starring Timothée Chalamet as a tireless striver, is the giddiest, most breathless movie of the year. And I’m not just saying that in the hope that a Chalamet-induced table tennis resurgence displaces pickleball. (In theaters Dec. 25) 5. “Wake Up Dead Man: A Knives Out Mystery” Underestimate Rian Johnson’s whodunits at your peril. The latest chapter in the endlessly entertaining adventures of Benoit Blanc may be the best of the bunch. It’s certainly the most moving one. And it’s got Josh O’Connor, who put his stamp on the movie year in a handful of standout performances — most especially this and in Kelly Reichardt’s flawless portrait of a very flawed man, “The Mastermind.” (In theaters; on Netflix Dec. 12)",
        "image":"/images/best-movies-2025.webp",
        "slug":"best-movies-2025-ranked-ap-film-writers",
        "date":"04, December 2025",
         "author":{
            "name":"Travis Monroe",
            "role":"Sports Reporter",
            "bio":"Travis brings fast, engaging coverage of sports highlights, athlete updates, and major events, delivering sharp commentary and essential game-focused reporting for FiscalFusion.",
            "image":"/images/travis-monroe.webp",
            "email":"travismonroe@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584803823704",
            "instagram":"https://www.instagram.com/travismonroe2025/",
            "substack":"https://substack.com/@travismonroe1",
            "medium":"https://medium.com/@travismonroe_60532"
        }
    },
   {
        "category":"entertainment",
        "title":"George Clooney reflects on fame, failure and a life in movies with ‘Jay Kelly’",
        "shortdescription":"George Clooney opens up about fame, failure and decades in film while discussing his new project “Jay Kelly.” He reflects on lessons learned and the evolution of his career.",
        "description":"George Clooney is not Jay Kelly. That much he is sure of. But when a famous movie star of a certain age decides to take on a role as a famous movie star of a certain age, full of regrets and realizing that he’s missed out on so much of his own life in pursuit of greatness and fame, it does invite some questions. Clooney, 64, wasn’t thinking about all that when Noah Baumbach called him about the part. He was just thinking about how hard it is to get good roles the older he gets. “I was predisposed to want to do it before I even read it,” Clooney told The Associated Press in a recent interview. He wasn’t the only one. Adam Sandler, Laura Dern and Billy Crudup were just a few of the many stars of “Jay Kelly,” streaming on Netflix on Friday, who pretty much signed on script unread. Baumbach’s name, as the writer-director behind “Marriage Story” and “The Squid and the Whale,” has that kind of effect on actors, from those he’s worked with before, to those who’ve just admired him from afar. “Jay Kelly,” which Baumbach wrote with Emily Mortimer, wasn’t just a clever character study but a lovingly clear-eyed portrait of the strange business of Hollywood moviemaking and the personalities involved — the managers (Sandler), the publicists (Dern), the makeup artists (Mortimer), the best actor from acting class who didn’t make it (Crudup), and, of course, the one who did (Clooney). Clooney saw the trappings of fame, especially when achieved too young, through the lens of his very famous aunt Rosemary Clooney, at a safe distance from his home in Kentucky. “She got her fame at 16, and it was big. She was on a cover of Time magazine,” he said. “And she believed all the stuff when they tell you how great you are … Then the business changed and she wasn’t prepared for that. If you believe the first part, you gotta believe the second part.” Failure, which he came to appreciate through many, many rejections, was an important part of the game. Clooney was in his 30s when he launched into the stratosphere with “ER.” “You can’t be an actor and not fail,” he said. “And that’s the risk, right? That’s why when it’s successful it pays off. It’s because you’re willing to risk humiliation.” Jay Kelly, after the death of the filmmaker who gave him his first break and a run-in with his old acting school buddy, starts to take stock of his life and relationships. He has one estranged daughter and one headed that way: She’s backpacking through Europe before college. And he decides to follow her across the Atlantic under the pretense of having to get to Italy for a life achievement award, leaving his team baffled and trying to pick up the pieces. “There’s something inherently confusing about spending your life pretending to be other people,” Mortimer said. “There’s this push and pull constantly because you’re interested in reality and so you want to help tell stories about it. But it’s much easier to bear life in this kind of contained way.” Clooney doesn’t have Jay Kelly’s regrets. He likes to say if he got hit by a bus tomorrow, he’d be OK with what he left behind — good relationships with friends, family and a few great films. But like Jay Kelly, Clooney is someone who can’t exactly walk onto a train and go unnoticed. There’s a recurring joke where Jay Kelly says he’s always alone and his daughter counters that he’s never alone. Movie stars, especially, are constantly, if not surrounded by, in touch with, their “teams.” Sandler and Dern, both Baumbach veterans, didn’t have to look too far to prepare to play manager and publicist. They’ve had their own for many years. “I did sit in the room and watch my agent make a lot of calls. And, by the way, he made so many while texting at the same time, I’m like, is he concentrating at all on any of these?” Sandler laughed. “I did see the passion and the warmth. And when he would stop texting and go straight to the phone, I knew it was business.” Dern said she’s been watching her publicist raise her since she was 19 years old. “They’ve been growing with us,” Dern said. “It’s hopefully an homage to everything they’ve taught us by the way they’ve cared for us all these years.” The film also had everyone thinking about people who believed in them early in their careers and the advice they offered. Both Dern and Baumbach got boosts from Peter Bogdanovich. Sandler’s came from Dustin Hoffman who, right after “Billy Madison” came out, called Sandler and invited him over to his house for dinner to talk about his future. “He said, ‘all the advice I can give you is meet three great filmmakers who wanna work with you,’” Sandler said. “He kept saying that: Worry about the filmmakers. You don’t just want to be a star.” It wasn’t advice Sandler took right away, but he still thinks about it. Two decades later they’d find themselves working together, and with Baumbach, on “The Meyerowitz Stories.” A name Clooney kept coming back to was Norman Lear, an exemplar to him of a life in show business well-lived. He told him that no one who gets to his age looks back on life and thinks “I wish I worked more.” “It’s always the idea of I wish I’d spent more time with the people I love,” Clooney said. “I’ve always taken that to heart.” During the making of “Jay Kelly,” Baumbach was also putting together a montage of that character’s career, which would play during a tribute ceremony. While it’s well-established that George Clooney is definitely not Jay Kelly, in this case, he definitely was. The montage was all Clooney films. And the actor portraying Jay Kelly had no idea what was coming when he sat down in that theater to film the last scene of the movie. Clooney was taken aback, first by all the “bad haircuts,” then by this tremendous sense of time. “We spent a lot of time that morning making sure all the technical stuff was gonna work,” Baumbach said. “When George came, I just told him ’I’m gonna show you this reel and I just want you to watch it.” A lot of actors wouldn’t necessarily be open to giving up that kind of control. But what I find beautiful about that sequence is that something is really happening, he’s really having this experience watching his life before him. And he’s having a real experience.” On that first take, overwhelmed by emotion, Clooney instinctively grabbed Sandler’s hand. It’s an image that made it not just into the movie, but onto the poster as well. And it was as authentic as it gets. “There’s a line in this film, ‘all my memories are movies,’” Clooney said. “That’s not true with me. But my memories of movies are not the scenes or the movie. It’s the experience.” He added: “What a lucky life I’ve lived.”",
        "image":"/images/george-clooney-jay-kelly.webp",
        "slug":"george-clooney-reflects-fame-failure-jay-kelly",
        "date":"04, December 2025",
          "author":{
            "name":"Evan Carlisle",
            "role":"U.S. News Reporter",
            "bio":"Evan reports on major U.S. news stories with a focus on clarity, relevance, and timely updates that help readers stay informed about what’s happening across the country.",
            "image":"/images/evan-carlisle.webp",
            "email":"evancarlisle@fiscalfusion.org",
            "twitter":"https://x.com/EvanCarlis90819",
            "facebook":"https://www.facebook.com/profile.php?id=61584747486041",
            "instagram":"https://www.instagram.com/evancarlisle92/",
            "substack":"https://substack.com/@evancarlisle",
            "medium":"https://medium.com/@evancarlisle_85958"
        }
    },
   {
        "category":"entertainment",
        "title":"Ecuador’s Otavalo Indigenous people use anime to inspire pride in their ancient culture and language",
        "shortdescription":"Otavalo Indigenous creators in Ecuador are using anime to spark pride in their ancient culture and Kichwa language. The project blends traditional identity with modern storytelling.",
        "description":"High in the mountains of the Ecuadorian Andes, a group of young Otavalo Indigenous people is using anime to inspire pride in their ancient culture and language, especially among Otavalo children. They produced an animated short film titled “We’re Aya” that follows the adventures of Aya, a mythical Otavalo warrior, and other characters who interact under the watchful eye of a condor — an iconic bird for Andean Indigenous cultures that symbolizes power and energy. Inspired by the work of legendary Japanese animator Hayao Miyazaki, the story takes place in the mountains of Imbabura, a province in the northern Andes that is home to the Otavalo people, known for their handicrafts and textiles. Tupac Amaru, director and producer of the 9-minute film, said the movie is part of an effort to maintain Otavalo customs and language, which began to erode as globalization created a more interconnected world and influenced their culture. His people faced two options, “lock ourselves out (from the world) and defend our culture, language, spirituality and clothing or stand tall and fight back,” Amaru said. The film with 12 Quichua-speaking characters is a first step in trying to get Otavalo children to appreciate their heritage, he said. Indigenous themes have been explored before in short and feature-length films produced in Peru and Ecuador but most of those films have had Spanish-speaking characters. “Quichua is the vibration that gives meaning to existence and without the language, the meaning of life and our energy comes to an end,” Amaru said. “Our children no longer know Quichua,” which means they have lost a communication tool and “are losing their sense of belonging, their energy,” he added. Quichua, an Indigenous language that is part of the Quechua language family, is primarily spoken in Ecuador. Yarik Sisa, creative manager for the film, said the story is inspired by ancestral practices that have survived the passage of time, including taking musical instruments to energetic points of the land the night before a celebration so that the instruments are endowed with “soul.” The film also includes characters such as Ayaruku, which represents an indomitable spirit; Ayawa, a representation of the sublime and the feminine; and Ayaku, a child symbolizing tenderness. These characters play their traditional instruments and stomp their feet as part of a rhythmic dance as they enter a dark cavern, which symbolizes globalization, where the spirits give them the mission of becoming new seeds of their people. The film then shows an Indigenous grandfather talking to his granddaughter who promises her elder she will become a woman strong as a rock and a defender of their culture. Her grandfather then asks her to never stray from that path. The team behind “We’re Aya” hopes to release more films and even video games in Quichua in the coming years and even enter the international video game market with games “made by Quichuas in a Quichua environment,” said Malkik Anrango, the film’s creative director.",
        "image":"/images/otavalo-anime-project.webp",
        "slug":"ecuador-otavalo-indigenous-anime-cultural-pride",
        "date":"05, December 2025",
         "author":{
            "name":"Travis Monroe",
            "role":"Sports Reporter",
            "bio":"Travis brings fast, engaging coverage of sports highlights, athlete updates, and major events, delivering sharp commentary and essential game-focused reporting for FiscalFusion.",
            "image":"/images/travis-monroe.webp",
            "email":"travismonroe@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584803823704",
            "instagram":"https://www.instagram.com/travismonroe2025/",
            "substack":"https://substack.com/@travismonroe1",
            "medium":"https://medium.com/@travismonroe_60532"
        }
    },
   {
        "category":"entertainment",
        "title":"Hollywood meets the Middle East as Red Sea International Film Festival opens in Jeddah",
        "shortdescription":"The Red Sea International Film Festival opens in Jeddah, bringing Hollywood talent together with Middle Eastern filmmakers. The event highlights the region’s growing influence in global cinema.",
        "description":"The fifth edition of the Red Sea International Film Festival, one of the Middle East’s largest film festivals, opened Thursday in the coastal city of Jeddah, marking a significant moment for the kingdom’s growing film industry. Running from Dec. 4 to 13, the Red Sea International Film Festival brings together filmmakers and talent from around the world, screening more than 100 films from over 70 countries. The festival’s prestigious “Red Sea: Competition” strand features a selection of 16 narrative features, animations and documentaries from the Arab world, Asia and Africa, all vying for the top honor: the Yusr Awards, which will be presented at the closing ceremony. The festival takes place in Jeddah’s Al-Balad district — a UNESCO World Heritage site — blending Saudi heritage with international cinema. This year, the selection jury is being led by the Academy Award-winning filmmaker Sean Baker, best known for “Anora,” which won five Oscars, four of which went to Sean Baker himself. “This festival is really exciting because of how big it’s become just in the last five years,” Baker said. “It’s rare that I see a festival just exploding in terms of importance and impact on world cinema.” The festival opens with “Giant,” a true story of legendary British-Yemeni boxing champion Prince Naseem ‘Naz’ Hamed. The film stars Egyptian-British actor Amir El-Masry as Hamed and Pierce Brosnan as his Irish trainer, Brendan Ingle, and is directed by British filmmaker Rowan Athale. “It was probably one of the hardest roles I’ve ever done,” El-Masry said, noting that his preparation involved four and a half weeks of training, during which he lost about eight kilos. “It’s been a passion project for me for a long time,” said Athale. “I come from a similar neighborhood — actually within a few miles of Naz. He was a hero of mine growing up, particularly being multiracial in the region. I’ve always wanted to make a film about him. So it’s a privilege to make it.” Reflecting on the premiere, he added, “To have it as the opening night film here — I mean, look at this. I’ve never seen anything like this. Not at Cannes, not anywhere. It’s daunting, it’s terrifying, but it’s an honor.” The opening night drew a wide range of international stars, including Hollywood and Bollywood figures including Adrien Brody, Sir Michael Caine, Vin Diesel and Ana de Armas walking the red carpet. Veteran actor Giancarlo Esposito, also attending the festival, said the gathering reflects the unifying power of cinema. “This celebration at the Red Sea Film Festival is really about celebrating film,” he said. The Red Sea International Film Festival was founded by Saudi Arabia’s Ministry of Culture and supported by the Red Sea Film Foundation. It is funded by the kingdom’s Public Investment Fund sovereign wealth fund and private sponsors. It aims to play a vital role in promoting regional filmmakers and fostering global connections. The festival is part of Saudi Arabia’s Vision 2030 objectives, which include diversifying the economy, strengthening cultural infrastructure and fostering local creative talent. The event comes as Saudi Arabia invests heavily in sectors like film, gaming and sports as part of its broader transformation efforts. However, various rights groups have criticized these actions, saying they serve to draw away attention from the kingdom’s human rights record, including its high rate of executions and restrictions on free expression.",
        "image":"/images/red-sea-film-festival.webp",
        "slug":"red-sea-film-festival-opens-jeddah-hollywood-meets-middle-east",
        "date":"05, December 2025",
         "author":{
            "name":"Travis Monroe",
            "role":"Sports Reporter",
            "bio":"Travis brings fast, engaging coverage of sports highlights, athlete updates, and major events, delivering sharp commentary and essential game-focused reporting for FiscalFusion.",
            "image":"/images/travis-monroe.webp",
            "email":"travismonroe@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584803823704",
            "instagram":"https://www.instagram.com/travismonroe2025/",
            "substack":"https://substack.com/@travismonroe1",
            "medium":"https://medium.com/@travismonroe_60532"
        }
    },
   {
        "category":"entertainment",
        "title":"How Jessie Buckley and Paul Mescal found the emotional power of ‘Hamnet’",
        "shortdescription":"Jessie Buckley and Paul Mescal explore the emotional depth of “Hamnet,” drawing from its intimate themes of love and loss. Their performances highlight the story’s raw, human power.",
        "description":"TORONTO  — During the emotionally wrecking final scene of “Hamnet,” Jessie Buckley and Paul Mescal had an issue. “There were moments where the camera was obstructing us,” Buckley recalls. “We were like: ‘No, we have to see each other.’” “And then the minute we did see each other, it was like ‘Oh, no,’” Mescal says, laughing. “What a glorious thing.” In “Hamnet,” Chloé Zhao’s adaptation of Maggie O’Farrell’s prizewinning 2020 novel, Mescal plays William Shakespeare and Buckley his wife, Agnes. It’s a fictional, speculative drama with basis in historical fact. One of the couple’s three children, Hamnet, died in 1596 at the age of 11. Within a handful of years, “Hamlet” would premiere at the Globe Theatre. The names, scholars have noted, were essentially interchangeable in 16th-century England. Zhao’s film, which opens Wednesday in theaters, imagines the possible connection between the death of the Shakespeares’ son and the birth of the playwright’s greatest work. It’s a portrait of a marriage, in grief and literary greatness. In many ways, it’s also a movie about seeing and being seen. Both William and Agnes are drawn together as misunderstood near-outcasts. William is dismissed as “a pasty-faced scholar.” Agnes is branded a “forest witch.” Gaps of misperception and solitude are bridged by love in the film’s first half, and art in its overwhelming final act. In both cases, Buckley’s and Mescal’s eyes tell much of the story. Their performances — raw, earthy, soulful — have been hailed as among the best of the year. Both are widely expected to land Oscar nominations. Though they acted in separate timelines in Maggie Gyllenhaal’s “The Lost Daughter” (2021), “Hamnet” is the first time on screen together for the two young, acclaimed Irish stars. “We entered the film at the perfect juncture. I had huge respect for Jessie and loved spending time with her,” Mescal says. “But we were also at the point where we didn’t know each other all that well. So there was a kind of mystery.” Before beginning production, Zhao staged a chemistry read for the two. It might go down as the most unnecessary chemistry read in Hollywood history. “We’d forget that we were saying lines,” says Mescal, sitting beside Buckley. “There was such a kinetic energy already between us,” Buckley agrees. “It just felt so possible.” Buckley and Mescal met this reporter earlier this fall just as “Hamnet” was making its prizewinning premiere at the Toronto International Film Festival. The film’s extreme emotionality was by then already earning an almost mythic reputation for turning moviegoers into puddles. But Buckley, the 35-year-old star of “Wild Rose” and “Wicked Little Letters,” and the 29-year-old Mescal, who was soon to embark on playing Paul McCartney in Sam Mendes’ four-film series, entered jovial and wisecracking. Buckley, a new mother, made a remark about nursing before requesting it not be printed, and then reversing herself. “Ah, print it. What do I care!” Once they settled in, though, both actors struggled to capture the enormity of their experience making “Hamnet.” If “Hamnet” has moved audiences, it has shaken its stars. “We worked with Kim (Gillingham, a coach) for subconscious and dreams. She asks you these prompts as you start to work. One was: Why are you making it?” Mescal recalls, turning toward Buckley. “I don’t want to get into why I initially thought I was making it. But I remember sitting with you and looking up at the stars two weeks in. Something personal had been going on in my life before. I remember turning to you and going, ‘Oh, that thought was way too small.’” “As actors, sometimes people just want you to wear a mask and put coats on, and I never find that satisfying,” Buckley says. “What Chloé wants you to do is move somewhere deeper within yourself to meet the person you’re going to come to understand. It’s not about masks. If anything, it’s about becoming more human and pulling off a layer of skin that you’ve maybe kept around yourself too tightly.” Zhao, the Oscar-winning “Nomadland” director who last directed the Marvel movie “Eternals,” says she challenged Mescal and Buckley to play “extreme masculine and extreme feminine.” Since emerging with a pair of lyrical Lakota dramas, “Songs My Brothers Taught Me” and “The Rider,” Zhao has refined a rough-hewn naturalism that actors gravitate toward. To find a very different Shakespeare, she relied on those instincts. “What we have to do as artists is try to find that commonality that transcends time and space and gender and religion,” says Zhao. “You say: What is the bone-deep humanity of that man that is also in Paul Mescal? That’s my job, to open that portal.” Mescal’s Shakespeare doesn’t go around eloquently spouting verses. “How boring would that be!” says Mescal. “Anyone who writes like that isn’t walking around waxing lyrical. I think there’s a real engine underneath him. There’s someone who wanted to escape his life and love his life at the same time. He loved his life and loved his work. This constant conflict in him, charging around his life, restless-like.” “That’s also you,” interjects Buckley. “That was just the version of him that made the most sense to me,” Mescal responds. “I’m sure there will be someone at Oxford who’ll be like, ‘He would have spoken with a weird hybrid accent because of the time period.’ OK, whatever. I don’t care.” “Hamnet” reaches a remarkable crescendo in a performance of “Hamlet” at the Globe that opens up deep wells of sorrow and oceans of empathy. It’s already one of the most talked-about finales of the year. Yet, cameras aside, it was a scene they struggled to find. “To be completely honest, we had gone on this ginormous, epic journey of the heart. We got to the Globe. I had not a clue what to do. I was totally lost. I think Chloé was lost,” Buckley says. “The Globe flooded. There was a rainstorm for two days. You go on this huge journey and you’re like: Where does this end?” On the third day, something clicked for Buckley when composer Max Richter’s “On the Nature of Daylight” came on her playlist. She shared it with Zhao and something shifted. “Sometimes as an actor, you feel like you have to do it yourself,” Buckley says. “She was like this lone wolf in the middle of this ocean of people. I realized on the third day how everyone around me was crucial. It became about surrendering to the community of feeling.” Buckley and Mescal have already resolved to work together again. “I feel like we’re going to meet each other at pinnacles of our lives and help each other unravel the next layer,” says Buckley. “Hands down, it was one of the most important collaborations that I’ve ever had,” Mescal says. “It’d be insane for that to be the only time we did it.” But it’s also possible that the final moments of “Hamnet” will forever stay with them. The scene’s power is owed, also, to the hundreds of extras who play a poignant role. Buckley’s and Mescal’s eyes are locked on one another, but the play’s the thing — not just its transmutation of their private grief, but the play’s resonance with all around them. “Why we go to the cinema, why we go to the theater, why we tell stories is for these places to contain the parts of ourselves that are too hard to hold by ourselves,” says Buckley. “There’s this unspoken ocean between the person sitting next to you and the story, and the play is the vessel through which that transcends through.” “It was incredible. Standing at the lip of the stage, I could just feel a tsunami of 300 people behind me opening up their hearts.”",
        "image":"/images/hamnet-buckley-mescal.webp",
        "slug":"jessie-buckley-paul-mescal-emotional-power-hamnet",
        "date":"26, November 2025",
         "author":{
            "name":"Travis Monroe",
            "role":"Sports Reporter",
            "bio":"Travis brings fast, engaging coverage of sports highlights, athlete updates, and major events, delivering sharp commentary and essential game-focused reporting for FiscalFusion.",
            "image":"/images/travis-monroe.webp",
            "email":"travismonroe@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584803823704",
            "instagram":"https://www.instagram.com/travismonroe2025/",
            "substack":"https://substack.com/@travismonroe1",
            "medium":"https://medium.com/@travismonroe_60532"
        }
    }
]