[
    {
        "category":"finance",
        "title":"Consumer sentiment tumbles close to record lows in latest U Michigan survey",
        "shortdescription":"Consumer sentiment in the U.S. has dropped to near-record lows, according to the latest University of Michigan survey. Economists cite inflation concerns and economic uncertainty as key factors.  ",
        "description":"Consumer sentiment dropped to a three-year low — and close to the lowest level ever recorded — one month into the government shutdown, as pessimism over personal finances and business conditions weighed heavily on Americans. The University of Michigan’s November survey showed sentiment at 50.4, a startling 6.2% drop from last month and nearly 30% below year-ago levels, surprising economists who had expected a slight increase to 54.2. “With the federal government shutdown dragging on for over a month, consumers are now expressing worries about potential negative consequences for the economy,” said Joanne Hsu, the survey’s director, noting the decline was broad across age, income, and political affiliation, with the exception of those holding large amounts of stock who have benefited from big tech and AI-driven market gains. The top 20% of households by income account for 40% of consumer spending, and the strong stock market has boosted their confidence, according to Oxford Economics’ Michael Pearce. Meanwhile, the nation’s largest retail trade group forecast a trillion-dollar Christmas season with holiday sales expected to grow up to 4.2%. The survey also found that year-ahead inflation expectations edged up to 4.7% while long-run expectations dipped to 3.6%. ING economist James Knightley highlighted rising job fears, with 71% of households expecting unemployment to increase over the next year — a sharp rise from last month — historically a warning sign for the labor market. With federal data reports halted during the shutdown, economists are relying on private sources that show job seekers taking longer to find work in a “low hires, low fires” environment. Some economists cautioned that the sentiment drop may have been influenced by methodological changes, including last year’s switch from phone to online sampling, with Pantheon Macroeconomics’ Oliver Allen urging the numbers be taken “with a grain of salt.” The survey was conducted before Election Day.",
        "image":"/images/u-michigan-consumer-sentiment-drop.webp",
        "slug":"consumer-sentiment-tumbles-u-michigan-survey",
        "date":"28, November 2025",
          "author":{
            "name":"Marcus Bennett",
            "role":"Political Correspondent",
            "bio":"Marcus covers U.S. politics and policy with sharp, accessible reporting. He breaks down political developments so readers understand what they mean in real life.",
            "image":"/images/marcus-bennett.webp",
            "email":"marcusbennett@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584651071329",
            "instagram":"https://www.instagram.com/marcusbennett2025/",
            "substack":"https://substack.com/@marcusbennett2",
            "medium":"https://medium.com/@marcusbennett_21499"
        }
    },
    {
        "category":"finance",
        "title":"Stocks wind up mixed on Wall Street after spending most of the day in the red",
        "shortdescription":"U.S. stocks closed mixed on Wall Street after spending most of the day in negative territory. Investors navigated volatility amid economic data and market sentiment shifts.",
        "description":"Stocks wavered to a mixed finish on Wall Street Friday and logged their first weekly loss in four. Major indexes fluctuated throughout the week before pulling back from record highs set the previous week, with technology stocks once again steering the broader market’s direction. The S&P 500 spent most of the day in negative territory, falling as much as 1.3%, but ended with a slight gain of 8.48 points, or 0.1%, to 6,728.80. The Dow Jones Industrial Average made a similar turnaround, rising 74.80 points, or 0.2%, to 46,987.10. The tech-heavy Nasdaq fell as much as 2.1% during trading but recovered most of those losses, finishing 49.46 points lower, or 0.2%, at 23,004.54. Technology stocks weighed heavily on the market, particularly high-valuation giants like Alphabet, which fell 2.1%, and Broadcom, which slipped 1.7%. Wall Street remained focused on corporate earnings and forecasts. Block sank 7.7% after disappointing results, while Peloton jumped 14.2% on stronger-than-expected numbers. Expedia Group surged 17.5% after topping analysts’ earnings estimates. With more than 90% of S&P 500 companies having reported, most have beaten expectations, with tech showing the strongest growth, according to FactSet. Investors are watching profits closely as they try to determine whether the market’s high valuations are justified, especially as key government economic reports remain unavailable due to the prolonged government shutdown — now the longest in U.S. history. Missing data includes the October jobs report and previously delayed September employment numbers, a concerning gap as the labor market was already weakening. Private data sources partly fill the void, including the University of Michigan’s consumer sentiment survey released Friday, which showed a sharp drop to a three-year low despite economists expecting an increase. “Consumers are starting to get concerned about the potential effects of the government’s shutdown on economic activity,” wrote Eugenio Aleman of Raymond James. The survey also reported slightly higher inflation expectations, but official inflation data is also missing due to the shutdown. Persistent inflation remains a top concern, particularly amid a volatile U.S. trade war that could worsen price pressures. The lack of employment and inflation data complicates the Federal Reserve’s stance on future interest rate cuts. The Fed has already cut rates twice this year to counter a softening job market, though further cuts risk stoking inflation above its 2% target. Still, Wall Street is largely betting on another cut in December, with CME FedWatch showing a 67% probability. Treasury yields held steady, with the 10-year at 4.09% and the two-year at 3.56%. Overseas, markets in Europe and Asia fell. China reported a 1.1% drop in October exports, including a steep 25% decline in shipments to the U.S., though economists expect improvement after President Donald Trump and President Xi Jinping agreed last week to de-escalate trade tensions.",
        "image":"/images/stocks-mixed-wall-street.webp",
        "slug":"stocks-mixed-wall-street-red",
        "date":"26, November 2025",
          "author":{
            "name":"Marcus Bennett",
            "role":"Political Correspondent",
            "bio":"Marcus covers U.S. politics and policy with sharp, accessible reporting. He breaks down political developments so readers understand what they mean in real life.",
            "image":"/images/marcus-bennett.webp",
            "email":"marcusbennett@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584651071329",
            "instagram":"https://www.instagram.com/marcusbennett2025/",
            "substack":"https://substack.com/@marcusbennett2",
            "medium":"https://medium.com/@marcusbennett_21499"
        }
    },
   {
        "category":"finance",
        "title":"Rallies for Nvidia and Big Tech help Wall Street nearly erase last week’s loss",
        "shortdescription":"Rallies in Nvidia and other big tech stocks helped Wall Street almost recover last week’s losses. Tech sector momentum continues to drive overall market gains.",
        "description":"Big Tech and other U.S. stock market superstars resumed rallying on Monday, helping Wall Street recover most of last week’s losses as the S&P 500 climbed 1.5%, the Dow Jones Industrial Average rose 381 points, or 0.8%, and the Nasdaq composite jumped 2.3% for its best day since May. Nvidia powered the market higher with a 5.8% surge, rebounding after leading last week’s drop amid criticism that AI-driven stocks had risen too far, too fast, echoing comparisons to the 2000 dot-com bubble. Taiwan Semiconductor Manufacturing Co.’s U.S.-traded shares gained 3.1% after reporting revenue growth of nearly 17% in October, while Palantir Technologies jumped 8.8% for the biggest gain in the S&P 500. Declines in health insurers, however, limited the market’s gains as uncertainty grew about whether Washington will extend expiring health care tax credits during the nation’s longest-ever government shutdown, even as the Senate took steps toward ending it; President Donald Trump suggested over the weekend that money going to “money sucking” insurers should instead go directly to people. Humana fell 5.4%, Elevance Health dropped 4.4%, and Centene sank 8.8%. Berkshire Hathaway slipped 0.4% after CEO Warren Buffett warned shareholders that other companies may outperform Berkshire over coming decades due to its size as he prepares to step down in January. Tyson Foods rose 2.3% after reporting stronger-than-expected quarterly profit. Roughly 80% of S&P 500 companies reporting summer results have topped profit expectations, according to FactSet, helping justify big stock price gains since April; companies have also issued strong forecasts, with Bank of America strategist Savita Subramanian noting that analysts’ earnings expectations for 2026 have nearly returned to pre-“Liberation Day” tariff announcement levels. The S&P 500 finished at 6,832.43, the Dow at 47,368.63, and the Nasdaq at 23,527.17. Overseas, markets rallied across Europe and Asia, with South Korea’s Kospi up 3% as SK Hynix climbed 4.5% and Samsung Electronics added 2.8%. In the bond market, the 10-year Treasury yield held steady at 4.11%.",
        "image":"/images/nvidia-big-tech-wall-street.webp",
        "slug":"nvidia-big-tech-rallies-wall-street",
        "date":"24, November 2025",
          "author":{
            "name":"Evan Carlisle",
            "role":"U.S. News Reporter",
            "bio":"Evan reports on major U.S. news stories with a focus on clarity, relevance, and timely updates that help readers stay informed about what’s happening across the country.",
            "image":"/images/evan-carlisle.webp",
            "email":"evancarlisle@fiscalfusion.org",
            "twitter":"https://x.com/EvanCarlis90819",
            "facebook":"https://www.facebook.com/profile.php?id=61584747486041",
            "instagram":"https://www.instagram.com/evancarlisle92/",
            "substack":"https://substack.com/@evancarlisle",
            "medium":"https://medium.com/@evancarlisle_85958"
        }
    },
   {
        "category":"finance",
        "title":"Big swings keep rocking Wall Street as US stocks drop sharply after erasing a morning surge",
        "shortdescription":"U.S. stocks fell sharply after wiping out a morning surge, highlighting persistent volatility on Wall Street. Investors continue reacting to economic data and market uncertainty.",
        "description":"Jarring swings continued to batter Wall Street on Thursday as U.S. stocks erased a big morning gain and fell sharply, reflecting persistent market skittishness after weeks of doubts and volatile moves. The S&P 500, up as much as 1.9% early in the day, reversed course and fell 1.6%, while the Dow Jones Industrial Average dropped 386 points, or 0.8%, and the Nasdaq composite sank 2.2%. The steepest losses again hit former market leaders such as Nvidia, cryptocurrencies, and other high-momentum names that traders had previously chased aggressively; Bitcoin slid below $87,000 after nearing $125,000 last month. Market weakness heading into Thursday stemmed largely from two concerns: that Nvidia and other AI-driven superstar stocks may have surged too far too fast, raising bubble fears, and that the Federal Reserve may be nearing the end of its market-boosting interest-rate cuts. Nvidia initially appeared to calm bubble worries by reporting strong summer profits and issuing a revenue forecast far above analysts’ expectations, with UBS analysts saying the AI infrastructure boom is still lifting “all boats.” Nvidia jumped 5% early but then reversed to a 3.2% loss, exerting heavy pressure on the S&P 500 due to its massive market weight. Despite Nvidia’s strength, doubts remain about whether the enormous spending on AI chips and data centers will ultimately generate the profits and economic productivity that proponents promise. A Bank of America survey showed a record number of global fund managers believe companies are “overinvesting.” Amazon swung from a 2.1% gain to a 2.5% loss, while Palantir reversed from a 5.5% jump to a 5.8% drop. Thursday’s huge intraday swings were the biggest since April, when President Donald Trump shocked markets with his “Liberation Day” tariffs. On the interest-rate front, a mixed U.S. jobs report offered some relief: hiring was stronger than expected, but unemployment ticked up slightly, potentially giving the Fed reason to cut rates in December. Traders now see roughly a 40% chance of a December cut, up from 30% a day earlier, though cuts risk worsening inflation, which remains above the Fed’s 2% target. Walmart was a bright spot, jumping 6.5% after reporting blowout quarterly earnings and sales as it continued attracting budget-conscious shoppers. But gains in retail were not enough to offset tech losses, and crypto-related stocks tumbled alongside Bitcoin, with Robinhood down 10.1% and Coinbase off 7.4%. The S&P 500 ended down 103.40 points at 6,538.76, the Dow fell 386.51 to 45,752.26, and the Nasdaq lost 486.18 to 22,078.05. The 10-year Treasury yield eased to 4.09% from 4.13%, while overseas markets rose broadly, including Japan’s Nikkei 225 up 2.6% and South Korea’s Kospi up 1.9%.",
        "image":"/images/wall-street-volatility.webp",
        "slug":"wall-street-volatility-us-stocks-drop",
        "date":"23, November 2025",
          "author":{
            "name":"Marcus Bennett",
            "role":"Political Correspondent",
            "bio":"Marcus covers U.S. politics and policy with sharp, accessible reporting. He breaks down political developments so readers understand what they mean in real life.",
            "image":"/images/marcus-bennett.webp",
            "email":"marcusbennett@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584651071329",
            "instagram":"https://www.instagram.com/marcusbennett2025/",
            "substack":"https://substack.com/@marcusbennett2",
            "medium":"https://medium.com/@marcusbennett_21499"
        }
    },
   {
        "category":"finance",
        "title":"More swings hit Wall Street, but this time stocks finish higher",
        "shortdescription":"Despite another round of market swings, U.S. stocks closed higher on Wall Street. Investors showed resilience amid continued volatility and mixed economic signals.",
        "description":"More swings hit Wall Street on Friday, except the U.S. stock market finished higher this time. After bobbing up and down through the morning, the S&P 500 took off and rallied nearly 2% before finishing with a gain of 1%. The Dow Jones Industrial Average climbed 493 points, or 1.1%, and the Nasdaq composite rose 0.9%. It was a fitting finish for a week that left the S&P 500 just 4.2% below its record but also forced investors to stomach the sharpest hour-to-hour swings since a sell-off in April. The jarring moves are testing investors after months of smooth gains, and they stem from two unanswered questions: Have prices for Nvidia, bitcoin and other Wall Street stars climbed too high, and is the Federal Reserve finished with its interest-rate cuts? On the latter question, markets found some assurance from a speech by Federal Reserve Bank of New York President John Williams, who said he sees “room for a further adjustment” to interest rates, which could signal support for another rate cut in December. But other Fed officials have argued against a December cut because inflation remains high, and the uncertainty from their disagreement has fueled dramatic market swings. Thursday’s volatile session saw stocks surge early after Nvidia eased AI-bubble worries, only to plunge in the sharpest reversal since April, when President Donald Trump shocked markets with his “Liberation Day” tariffs. Despite Nvidia’s strong results, questions persist about whether massive AI-chip spending by Amazon, Meta Platforms and others will truly deliver long-term profits and productivity gains. AI-linked stocks stayed volatile Friday: Nvidia swung from an early gain to a 4.3% drop before finishing down 1%, while Amazon flipped from a loss to a 1.6% gain. Bitcoin briefly fell below $81,000 before rebounding toward $85,000, down from nearly $125,000 last month and back to April levels. Nearly 90% of S&P 500 stocks rose despite the turmoil, though their moves are often overshadowed by the enormous influence of Big Tech. “When the largest companies drive most of the losses, the market can look weaker than it really is,” said Brian Jacobsen of Annex Wealth Management. Retailers helped lead the market: Gap jumped 8.2% after reporting better-than-expected profit, with CEO Richard Dickson noting strong sales at Old Navy, Gap, and Banana Republic; Ross Stores rallied 8.4% after also beating expectations and raising its holiday forecast. Homebuilders climbed on hopes that lower rates could boost the housing market, with D.R. Horton up 6.8%, Lennar up 5.9%, and PulteGroup up 5.2%. All told, the S&P 500 rose 64.23 points to 6,602.99, the Dow gained 493.15 to 46,245.41, and the Nasdaq climbed 195.03 to 22,273.08. Treasury yields eased as traders bet on a nearly 72% chance of a December Fed cut, up sharply from 39% a day earlier, sending the 10-year yield down to 4.06% from 4.10%. Overseas, markets were mixed in Europe and tumbled in Asia after Thursday’s U.S. reversal, with Japan’s Nikkei 225 down 2.4% and South Korea’s Kospi down 3.8%.",
        "image":"/images/wall-street-swings.webp",
        "slug":"wall-street-volatility-stocks-finish-higher",
        "date":"25, November 2025",
          "author":{
            "name":"Jenna Whitmore",
            "role":"Entertainment Writer",
            "bio":"Jenna covers entertainment, culture, and trending stories, bringing fresh perspective and concise reporting that highlights the people and moments shaping today’s entertainment landscape.",
            "image":"/images/jenna-whitmore.webp",
            "email":"jennawhitmore@fiscalfusion.org",
            "twitter":"https://x.com/jennawhitm94520",
            "facebook":"https://www.facebook.com/profile.php?id=61584976316567",
            "instagram":"https://www.instagram.com/jennawhitmore2025/",
            "substack":"https://substack.com/@jennawhitmore",
            "medium":"https://medium.com/@jennawhitmore"
        }
    },
   {
        "category":"finance",
        "title":"IPO market’s red-hot year has been cooled by the shutdown and more caution among investors",
        "shortdescription":"After a red-hot start, the IPO market has slowed due to government shutdowns and increased investor caution. Analysts note that volatility is prompting companies to reconsider timing for public offerings.",
        "description":"A strong year for initial public offerings on Wall Street has fizzled out due to the government shutdown and a cautious turn by investors. Many IPOs targeted for the end of the year will likely be pushed into next year as the Securities and Exchange Commission works through a backlog of hundreds of registration statements, while shares of recently debuted companies have struggled amid concerns that stocks have become too expensive following another double-digit market gain. “A backlogged SEC, the approaching holiday slowdown, and pressure on AI and other tech stocks are all weighing on hopes for a near-term rebound,” wrote Bill Smith, CEO of Renaissance Capital. Still, several offerings already far along in the regulatory process are expected in November and December. Central Bancompany, the holding company for The Central Trust Bank, raised $373 million in its IPO Thursday, though November is shaping up to be one of the slowest IPO months of 2025. Medline may go public in December, potentially raising up to $5 billion, and cryptocurrency firm BitGo could also debut next month. The market’s caution has dragged down recent IPOs: Figma has lost nearly all gains since its July debut, now trading slightly above its $33 price after tripling on day one; Klarna has fallen from its $40 September pricing to about $29; CoreWeave, priced at $40 in March, soared initially but has retreated to roughly $72; and software company Navan, priced at $25 during the shutdown, now trades near $15. The S&P 500 is down 3.5% so far in November, driven largely by a pullback in tech after AI-fueled gains sparked valuation concerns, though the index remains up more than 12% for the year and the Nasdaq more than 15%. Renaissance Capital’s IPO Index is down about 0.8% for the year and has lagged the S&P 500 since mid-October, a sign that “investors very quickly monetized, they didn’t want to take the long-term risk,” said Samuel Kerr of Mergermarket. Still, underlying demand for IPOs remains strong as investors seek cheaper entry points into an otherwise pricey market. “Increasingly, as a money manager, you have to find other places to make money and typically, IPOs are that place,” said David Kaufman of Thompson Coburn LLP, noting large funds sitting on excess cash. The market’s 2026 direction will help determine what IPOs emerge, with highly anticipated names such as Databricks, Canva, and Plaid seen as potential candidates. Meanwhile, despite the public slowdown, companies are busy preparing behind the scenes. “It’s a busy time for lawyers and bankers trying to tee things up for the first and second quarter of next year,” Kaufman said.",
        "image":"/images/ipo-market-cools.webp",
        "slug":"ipo-market-cools-shutdown-investor-caution",
        "date":"22, November 2025",
         "author":{
            "name":"Travis Monroe",
            "role":"Sports Reporter",
            "bio":"Travis brings fast, engaging coverage of sports highlights, athlete updates, and major events, delivering sharp commentary and essential game-focused reporting for FiscalFusion.",
            "image":"/images/travis-monroe.webp",
            "email":"travismonroe@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584803823704",
            "instagram":"https://www.instagram.com/travismonroe2025/",
            "substack":"https://substack.com/@travismonroe1",
            "medium":"https://medium.com/@travismonroe_60532"
        }
    },
   {
        "category":"finance",
        "title":"Another rally for Alphabet leads the US stock market higher",
        "shortdescription":"Another surge in Alphabet shares helped lift the U.S. stock market higher. Tech sector gains continue to support overall market momentum.",
        "description":"The U.S. stock market rallied on Monday at the start of a week shortened by the Thanksgiving holiday, with the S&P 500 climbing 1.5% for one of its best days since summer, the Dow Jones Industrial Average rising 202 points or 0.4%, and the Nasdaq jumping 2.7%. Stocks were boosted by growing hopes that the Federal Reserve will cut its main interest rate again in December, which could lift the economy and investment prices. AI-linked stocks added strength as Alphabet surged 6.3% on praise for its Gemini AI model and Nvidia rose 2.1%. The gains followed weeks of sharp day-to-day and hour-to-hour swings driven by uncertainty over Fed policy and concerns that heavy investment into AI might be creating a bubble, echoing volatility not seen since April when President Donald Trump’s “Liberation Day” tariffs shocked markets. Still, the S&P 500 remains within 2.7% of last month’s record, with Ameriprise strategist Anthony Saglimbene noting that periodic pressure is historically healthy. More volatility could come as key reports arrive this week, including Tuesday’s wholesale inflation data for September, expected to show a 2.6% annual rise; a hotter reading could restrain the Fed from issuing a third rate cut this year, especially as inflation remains above the 2% target. Despite that, traders now see an 85% chance of a December cut, up from 71% on Friday and from below 50% a week earlier, according to CME Group. U.S. markets will close Thursday for Thanksgiving before Black Friday and Cyber Monday kick off. Elsewhere, Novo Nordisk shares tumbled 5.6% after its Alzheimer’s drug failed in a trial, and Grindr plunged 12.1% after ending talks with investors seeking to buy the company due to financing concerns. The S&P 500 rose 102.13 points to 6,705.12, the Dow climbed to 46,448.27, and the Nasdaq jumped to 22,872.01. Bitcoin continued its volatility, hovering near $89,000 after swinging between $82,000 and $94,000 over the past week, down from nearly $125,000 last month. Overseas markets were mixed, though Hong Kong’s Hang Seng jumped 2% on a 4.7% surge in Alibaba ahead of earnings and strong demand for its updated Qwen AI app. Treasury yields eased, with the 10-year falling to 4.03% from 4.06% Friday.",
        "image":"/images/alphabet-stock-rally-2.webp",
        "slug":"alphabet-rally-drives-us-stock-market-higher-2",
        "date":"25, November 2025",
          "author":{
            "name":"Jenna Whitmore",
            "role":"Entertainment Writer",
            "bio":"Jenna covers entertainment, culture, and trending stories, bringing fresh perspective and concise reporting that highlights the people and moments shaping today’s entertainment landscape.",
            "image":"/images/jenna-whitmore.webp",
            "email":"jennawhitmore@fiscalfusion.org",
            "twitter":"https://x.com/jennawhitm94520",
            "facebook":"https://www.facebook.com/profile.php?id=61584976316567",
            "instagram":"https://www.instagram.com/jennawhitmore2025/",
            "substack":"https://substack.com/@jennawhitmore",
            "medium":"https://medium.com/@jennawhitmore"
        }
    },
   {
        "category":"finance",
        "title":"US stocks drop on worries about banks",
        "shortdescription":"U.S. stocks fell amid growing concerns about the health of the banking sector. Investors reacted to financial uncertainty and potential risks in the industry.",
        "description":"U.S. stocks fell on Thursday, hurt by drops for midsized banks as worries flare about the loans they’ve made. The S&P 500 slid 0.6% in its latest up-and-down day after erasing a morning gain, while the Dow Jones Industrial Average dropped 301 points, or 0.7%, and the Nasdaq composite lost 0.5%. Zions Bancorp. tumbled 13.1% after saying its third-quarter profit will take a hit because of a $50 million charge-off related to loans made to a pair of borrowers, citing “apparent misrepresentations and contractual defaults” along with “other irregularities.” Western Alliance Bancorp dropped 10.8% after saying it has sued a borrower for alleged fraud and is sticking by its 2025 financial forecasts. Scrutiny is rising on loan quality across lenders after last month’s Chapter 11 filing by First Brands Group, raising questions about whether these issues are isolated or signs of something larger. Thursday’s sharp swings — the Dow flipped from a 169-point gain to a 472-point loss — continued a shaky trend since last week, when President Donald Trump rattled a previously calm market with threats of much higher tariffs on China. An early morning rally driven by optimism about the artificial-intelligence boom faded despite Taiwan Semiconductor Manufacturing Co. reporting stronger-than-expected profit and saying it expects “continued strong demand for our leading-edge process technologies,” an important signal for AI chipmakers like Nvidia, whose stocks have driven the market’s record run even as inflation stays high and the job market slows. Critics continue to warn that AI-linked stocks may be in a bubble reminiscent of the 2000 dot-com implosion. Companies are under pressure to prove profits after the S&P 500 surged 35% from its April low, with critics arguing prices have grown too expensive without matching earnings. Travelers fell 2.9% despite beating profit expectations because its revenue missed forecasts, while Hewlett Packard Enterprise slid 10.1% after long-term financial targets disappointed analysts. These declines overshadowed a 4% gain for Salesforce, which unveiled a plan for more than 10% compounded annual revenue growth, and a massive 22.1% jump for J.B. Hunt after it smashed Wall Street’s profit estimates. The S&P 500 fell 41.99 points to 6,629.07, the Dow dropped 301.07 to 45,952.24, and the Nasdaq sank 107.54 to 22,562.54. In oil markets, crude prices reversed lower after Trump agreed to meet Russia’s Vladimir Putin in Hungary to discuss the war in Ukraine, which has driven U.S. efforts to block Russian oil purchases; U.S. crude fell 1.4% to $57.46 and Brent crude dropped 1.4% to $61.06. Overseas, indexes climbed across much of Asia and Europe, with South Korea’s Kospi up 2.5% on hopes of a trade deal with Washington, boosting Samsung Electronics, Hyundai Motor, and Kia Corp. Treasury yields fell as investors sought safer assets, sending the 10-year yield down to 3.97% from 4.05%, while gold rose 2.5% to $4,304.60 per ounce, extending its stunning year-to-date gain to roughly 63%. A report showed manufacturing activity in the mid-Atlantic unexpectedly shrinking, one of the few economic data points still reaching the Federal Reserve as it weighs inflation risks against a weakening job market. The U.S. government shutdown continues to delay key economic updates, including the weekly unemployment claims report and an important inflation report that was held up a day earlier.",
        "image":"/images/us-stocks-banks.webp",
        "slug":"us-stocks-drop-banking-concerns",
        "date":"24, November 2025",
          "author":{
            "name":"Jenna Whitmore",
            "role":"Entertainment Writer",
            "bio":"Jenna covers entertainment, culture, and trending stories, bringing fresh perspective and concise reporting that highlights the people and moments shaping today’s entertainment landscape.",
            "image":"/images/jenna-whitmore.webp",
            "email":"jennawhitmore@fiscalfusion.org",
            "twitter":"https://x.com/jennawhitm94520",
            "facebook":"https://www.facebook.com/profile.php?id=61584976316567",
            "instagram":"https://www.instagram.com/jennawhitmore2025/",
            "substack":"https://substack.com/@jennawhitmore",
            "medium":"https://medium.com/@jennawhitmore"
        }
    },
   {
        "category":"finance",
        "title":"Wall Street sees major jump in profits, helped by soaring stock prices and deal making",
        "shortdescription":"Wall Street reported a major increase in profits, fueled by soaring stock prices and active deal-making. Analysts say market momentum and corporate activity are driving strong earnings.",
        "description":"Wall Street had one of its most profitable quarters ever, if the earnings from four of the nation’s biggest banks that reported Tuesday are to be believed, as the companies were helped by a flurry of deal making, soaring stock prices and a global economy that remains resilient despite tariffs and geopolitical upheaval. Despite the strong earnings from JPMorgan Chase, Citigroup, Wells Fargo and Goldman Sachs, bank executives expressed various degrees of caution about the markets and the economy, including worries that asset prices in some markets have gotten overinflated. “While there have been some signs of a softening, particularly in job growth, the U.S. economy generally remained resilient,” said Jamie Dimon, chairman and CEO of JPMorgan Chase, in prepared remarks. “However, there continues to be a heightened degree of uncertainty stemming from complex geopolitical conditions, tariffs and trade uncertainty, elevated asset prices and the risk of sticky inflation,” he added. JPMorgan Chase said it had a profit of $14.39 billion, or $5.07 a share, up 12% from a year earlier. The other big banks fared just as well, or better. Wells Fargo earned $5.59 billion in profits in the quarter, up 9% from a year earlier. At Citigroup, the bank had a third-quarter profit of $3.75 billion, up 16%, and Goldman Sachs posted a 37% jump in profits, earning $4.1 billion. JPMorgan’s consumer banking division had a particularly strong quarter, partly driven by its credit card business, with consumers spending more, borrowing more and carrying balances longer; it also upgraded its Chase Sapphire Reserve card this summer, sparking a wave of refreshes among high-fee cards. Other banks also reported strong consumer spending, including Wells Fargo, which saw credit and debit card usage rise across all demographics, and Citigroup, which also reported robust card spending. None of the banks added significant sums to their loan-loss reserves in the quarter. Along with solid consumer spending, Wall Street is experiencing one of its best years in deal making in a long time. Initial public offerings have returned, AI companies have raised tens of billions to build data centers, and private equity is booming, including a recent $55 billion buyout offer for Electronic Arts. At Goldman Sachs, investment banking revenues rose 42% to $2.66 billion, and commission and fee revenues increased 27% thanks to a surge in M&A advisory work. Citigroup and JPMorgan also saw significant increases in investment banking and corporate lending revenues. But despite the soaring stock market and deal activity, executives expressed caution about how long the boom can last, pointing to record or multidecade highs in safe-haven assets like gold and silver, the ongoing U.S.-China trade war involving key goods like steel and soybeans, and skyrocketing stock prices for companies linked to artificial intelligence. “There’s obviously a lot of uncertainty that still persists around tariffs, around inflation, around what it could mean for the labor market,” said Mark Mason, CFO of Citigroup, who also described some markets as “frothy.” Dimon voiced similar concerns, saying, “You have a lot of assets out there which look like they’re entering bubble territory.” Investors have been watching the big banks closely as a proxy for the overall economy while the U.S. government remains shut down and key economic data is delayed or unavailable, with banks traditionally kicking off earnings season. On Wednesday, results are due from Bank of America and Morgan Stanley, and American Express will report on Friday.",
        "image":"/images/wall-street-profits.webp",
        "slug":"wall-street-profits-jump-stock-prices-deals",
        "date":"24, November 2025",
         "author":{
            "name":"Travis Monroe",
            "role":"Sports Reporter",
            "bio":"Travis brings fast, engaging coverage of sports highlights, athlete updates, and major events, delivering sharp commentary and essential game-focused reporting for FiscalFusion.",
            "image":"/images/travis-monroe.webp",
            "email":"travismonroe@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584803823704",
            "instagram":"https://www.instagram.com/travismonroe2025/",
            "substack":"https://substack.com/@travismonroe1",
            "medium":"https://medium.com/@travismonroe_60532"
        }
    },
   {
        "category":"finance",
        "title":"Meme stock resurgence prompts return of central meme investment fund",
        "shortdescription":"The recent meme stock resurgence has led to the revival of the Central Meme Investment Fund. Investors are once again chasing high-risk, high-visibility social media-driven trades.",
        "description":"A resurgence of meme stock interest has prompted the return of a one-stop fund for the volatile and quirky investments, as Roundhill Investments launches a meme ETF consisting solely of meme stocks. The move comes two years after the ETF provider closed the fund due to slumping interest; the new fund now trades under the symbol “MEME.” Investors have sporadically returned to meme stocks throughout 2025 in search of bargains in an otherwise pricey stock market, with the S&P 500 repeatedly setting records and making value harder to find. “Meme stocks started as a rebellion but have grown into a revolution,” said Dave Mazza, CEO of Roundhill Investments. “With MEME, we offer investors a tool to capture that power through an actively managed ETF that can rotate quickly into the stocks dominating the conversation today.” The ETF’s largest holding is Opendoor Technologies, which has had a turbulent year: after trading below $1 per share through early July, it surged above $3 as hedge fund manager Eric Jackson promoted it on X, later gaining more momentum to close above $9 on Tuesday. Other heavyweights include hydrogen fuel cell company Plug Power and data center operator Applied Digital. Meme stocks typically involve companies with weak or uncertain financial prospects that inexplicably gain traction online, often becoming targets of short sellers. When short sellers face rising prices, other investors may buy shares to trigger a “short squeeze,” forcing short sellers to buy back shares to limit losses, which in turn drives prices even higher. The strategy is highly risky, and gains can vanish as quickly as they appear. Some of the notable meme stocks making big moves this year include Krispy Kreme, GoPro, and Beyond Meat. The original meme stock, GameStop, became famous in 2021 when investor Keith Gill — known as “Roaring Kitty” — rallied online traders to buy shares as major investors were betting against the struggling retailer, sending its stock soaring and reshaping the meme stock phenomenon.",
        "image":"/images/meme-stock-fund.webp",
        "slug":"meme-stock-resurgence-central-meme-fund",
        "date":"22, November 2025",
         "author":{
            "name":"Claire Addison",
            "role":"Senior Investigative Reporter",
            "bio":"Claire uncovers in-depth stories with a focus on accuracy, accountability, and clear reporting. She specializes in investigations that help readers understand the truth behind complex issues.",
            "image":"/images/claire-addison.webp",
            "email":"claireaddison@fiscalfusion.org",
            "twitter":"https://x.com/claire_add1703",
            "facebook":"https://www.facebook.com/profile.php?id=61584652001298",
            "instagram":"https://www.instagram.com/claireaddison2025/",
            "substack":"https://substack.com/@claireaddison1",
            "medium":"https://medium.com/@claireaddison_68794"

        }
    },
   {
        "category":"finance",
        "title":"Amazon carries Wall Street to the finish of another winning week and month",
        "shortdescription":"Amazon shares helped lift Wall Street to close out another winning week and month. Strong performance in tech stocks continues to support market momentum.",
        "description":"Amazon led the U.S. stock market on Friday to the finish of another winning week and month, with the S&P 500 rising 0.3% and pulling closer to its all-time high set on Tuesday as it closed out a third straight winning week and a sixth straight winning month, its longest monthly streak since 2021. The Dow Jones Industrial Average added 40 points, or 0.1%, and the Nasdaq composite gained 0.6%. Amazon surged 9.6% and was by far the strongest force lifting the market after reporting profit for the latest quarter that blew past analysts’ expectations, with CEO Andy Jassy saying growth in its cloud-computing business has accelerated to a pace not seen since 2022. Amazon’s roughly $2.4 trillion size means its movements heavily influence the S&P 500, and without it the index would have been down for the day. Apple, despite being worth more than $4 trillion, had a smaller impact as it swung between modest gains and losses before finishing down 0.4%; it also topped profit expectations, though not by as much as Amazon, with CEO Tim Cook citing strong revenue from iPhones and services. Reddit rose 7.5% after beating profit and revenue forecasts, Coinbase climbed 4.6% after profit also topped expectations, and Netflix added 2.7% after announcing a 10-for-1 stock split to make shares more affordable while preserving investors’ value. These gains helped offset AbbVie’s 4.5% drop, as the drugmaker beat profit estimates by a smaller margin than before and faced high expectations following a 28.4% year-to-date gain. Companies are under pressure to deliver large profit growth to justify big stock price gains since April amid rising criticism that the market has become too expensive. On Thursday, the S&P 500 slumped 1% as investors grew uneasy over heavy AI-related spending plans from Meta Platforms and Microsoft, and skepticism persisted about President Donald Trump’s trade truce with China. On Friday, Microsoft fell another 1.5% and Meta sank 2.7%, becoming the heaviest drags on the market. All told, the S&P 500 rose 17.86 points to 6,840.20, the Dow climbed to 47,562.87, and the Nasdaq advanced 143.81 points to 23,724.96. Overseas, markets dipped in Europe following a mixed session in Asia, where Hong Kong fell 1.4% and Shanghai dropped 0.8% after data showed Chinese factory activity contracted for a seventh straight month, while Japan’s Nikkei 225 jumped 2.1% to another record after stronger-than-expected industrial production data. In the bond market, Treasury yields eased after rising midweek when Federal Reserve Chair Jerome Powell warned that another rate cut in December “is not a foregone conclusion — far from it.” The 10-year Treasury yield dipped to 4.09% from 4.11%, still above the 3.99% level before Powell’s comments. Other central banks have recently paused or halted rate cuts, and “it seems this is it for the 2025 easing season in developed economies,” economists at Bank of America wrote in a BofA Global Research report.",
        "image":"/images/amazon-wall-street.webp",
        "slug":"amazon-drives-wall-street-winning-week-month",
        "date":"04, December 2025",
          "author":{
            "name":"Sophie Langford",
            "role":"Business & Finance Correspondent",
            "bio":"Sophie covers business trends and financial developments, offering clear insights that help FiscalFusion readers understand market shifts and economic changes.",
            "image":"/images/sophie-langford.webp",
            "email":"sophielangford@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584953787187",
            "instagram":"https://www.instagram.com/sophielangford9/",
            "substack":"https://substack.com/@sophielangford1",
            "medium":"https://medium.com/@sophielangford_44287"
        }
    },
   {
        "category":"finance",
        "title":"US stocks and gold sink, while meme stocks swerve, as momentum reverses on Wall Street",
        "shortdescription":"U.S. stocks and gold declined as market momentum shifted on Wall Street, while meme stocks moved unpredictably. Investors reacted to changing sentiment and economic signals.",
        "description":"U.S. stocks and the price of gold fell on Wednesday, as momentum on Wall Street reverses. The S&P 500 sank 0.5%, though it’s still within 1% of its all-time high set earlier this month, while the Dow Jones Industrial Average dropped 334 points, or 0.7%, from its record set the day before, and the Nasdaq composite fell 0.9%. Netflix helped drag the market lower after reporting weaker profit for the latest quarter than analysts expected, adding pressure on the streamer and other companies to deliver solid profit growth to counter criticism that stock prices surged too far after the S&P 500’s 35% climb from its April low. Netflix, which had been up 39.3% for the year—more than double the S&P 500’s gain—fell 10.1%. AT&T slipped 1.9% after reporting profit that merely matched expectations, while Texas Instruments dropped 5.6% after slightly missing profit forecasts. Intuitive Surgical jumped 13.9% after beating profit expectations, and Boston Scientific climbed 4% on better-than-expected results. Capital One Financial rose 1.5% and Western Alliance Bancorp gained 3.2% after both beat analysts’ estimates, with Western Alliance’s report especially welcome after it had contributed to concerns about potentially bad loans last week. Beyond Meat swung wildly, soaring as much as 112% early before finishing down 1.1%, though it remains up 454.5% for the week amid a meme-stock frenzy. It was the largest holding in the Roundhill Meme Stock ETF, which focuses on stocks driven by investor momentum rather than fundamentals. The S&P 500 ultimately fell 35.95 points to 6,699.40, the Dow dropped 334.33 to 46,590.41, and the Nasdaq sank 213.27 to 22,740.40. Gold continued its reversal, falling 1.1% to $4,065.40 per ounce after Tuesday’s 5.3% slide from a record high, despite the same factors that had driven buyers to gold—expectations of Fed rate cuts next year, concerns about persistent inflation, and mounting global government debt—remaining in place; critics had warned gold’s surge, now still up 56% for the year, had gone too far too fast. Overseas markets were mixed, with London’s FTSE 100 up 0.9% after a report on U.K. inflation boosted hopes for another rate cut next month, South Korea’s Kospi rising 1.6%, and declines of 0.9% in Hong Kong and 0.6% in Paris. In the bond market, the 10-year Treasury yield eased to 3.95% from 3.98% Tuesday.",
        "image":"/images/us-stocks-gold-meme.webp",
        "slug":"us-stocks-gold-fall-meme-stocks-wall-street",
        "date":"02, December 2025",
         "author":{
            "name":"Claire Addison",
            "role":"Senior Investigative Reporter",
            "bio":"Claire uncovers in-depth stories with a focus on accuracy, accountability, and clear reporting. She specializes in investigations that help readers understand the truth behind complex issues.",
            "image":"/images/claire-addison.webp",
            "email":"claireaddison@fiscalfusion.org",
            "twitter":"https://x.com/claire_add1703",
            "facebook":"https://www.facebook.com/profile.php?id=61584652001298",
            "instagram":"https://www.instagram.com/claireaddison2025/",
            "substack":"https://substack.com/@claireaddison1",
            "medium":"https://medium.com/@claireaddison_68794"

        }
    },
   {
        "category":"finance",
        "title":"Exxon posts strong quarterly earnings with production in Guyana and the Permian Basin picking up",
        "shortdescription":"Exxon reported strong quarterly earnings as production ramped up in Guyana and the Permian Basin. The energy giant credits higher output and favorable market conditions for its performance.",
        "description":"Exxon Mobil reported a strong third-quarter performance Friday, bolstered by robust production in Guyana and the Permian Basin. Exxon earned $7.55 billion, or $1.76 per share, for the period ended Sept. 30, compared with $8.61 billion, or $1.92 per share, a year earlier. Excluding one-time costs and benefits, earnings were $1.88 per share, topping the $1.81 per share expected by analysts surveyed by Zacks Investment Research, though Exxon does not adjust results for one-time events such as asset sales. Revenue totaled $85.29 billion, below Wall Street’s projection of $86.77 billion. Third-quarter net production was 4.7 million oil-equivalent barrels per day, an increase of 1.1 million from the second quarter. Guyana production surpassed 700,000 barrels per day, while the Permian Basin set a record with nearly 1.7 million oil-equivalent barrels per day. Chevron also reported third-quarter earnings Friday, posting $3.54 billion, or $1.82 per share; adjusted earnings were $1.85 per share, beating analysts’ expectations of $1.66 per share, though Chevron likewise does not adjust for one-time events. Chevron’s revenue totaled $49.73 billion, falling short of the anticipated $53.58 billion. Oil prices spiked last week after the U.S. announced sweeping new sanctions on Russia’s oil industry in an effort to pressure Russian President Vladimir Putin into negotiations to end the war in Ukraine. Oil prices have remained relatively low in recent years, with U.S. benchmark crude falling below $57 per barrel in mid-October, its lowest level since early 2021, though it did rise near $79 per barrel early this year before President Donald Trump took office, a level not considered excessively high by most analysts. Oil and gas prices have stabilized in part due to actions by OPEC+, which earlier this month agreed to a small production increase of 137,000 barrels per day in November, citing a steady global economic outlook. The alliance, which includes Russia as its leading non-OPEC member, has been gradually raising output this year after implementing cuts in 2023 and 2024. The group’s next meeting is scheduled for Sunday.",
        "image":"/images/exxon-earnings.webp",
        "slug":"exxon-strong-earnings-guyana-permian-production",
        "date":"03, December 2025",
         "author":{
            "name":"Claire Addison",
            "role":"Senior Investigative Reporter",
            "bio":"Claire uncovers in-depth stories with a focus on accuracy, accountability, and clear reporting. She specializes in investigations that help readers understand the truth behind complex issues.",
            "image":"/images/claire-addison.webp",
            "email":"claireaddison@fiscalfusion.org",
            "twitter":"https://x.com/claire_add1703",
            "facebook":"https://www.facebook.com/profile.php?id=61584652001298",
            "instagram":"https://www.instagram.com/claireaddison2025/",
            "substack":"https://substack.com/@claireaddison1",
            "medium":"https://medium.com/@claireaddison_68794"

        }
    },
   {
        "category":"finance",
        "title":"How to navigate social media trends without derailing your budget",
        "shortdescription":"Staying on top of social media trends can be costly, but smart strategies help protect your budget. These tips guide users on enjoying trends without overspending.",
        "description":"NEW YORK — Did you buy a new pink dress to watch the Barbie movie, only to never wear it again? An Oura ring because your favorite TikTok influencer had it? A new pair of baggy jeans because ’90s fashion is making a comeback? Niche trends fueled by social media can influence your shopping decisions, and while participating often brings happiness and a sense of community, the problem comes when you indulge so often that you’re not using your money to achieve your financial goals—or worse, you get into debt, said Erika Rasure, chief financial wellness advisor for Beyond Finance. Whether it’s coastal grandma or clean girl aesthetic, microtrends can take a significant toll on already-strained budgets as prices rise and Gen Z struggles to pay off debt. Before you click “buy” on TikTok Shop, it’s best to pause and reflect, said Jennifer Seitz, head of education for Greenlight; taking 24 hours or a few days before purchasing can help you determine whether you truly want the item or are responding to a fleeting desire. Participating in personal challenges, like Alyssa Barber’s 2022 no-buy year, can help build deliberate spending habits; Barber, who shares sustainability content with more than 370,000 TikTok followers, said the challenge changed her perspective and shifted her spending toward experiences. Taking a value-based spending approach can also help you determine whether to participate in a trend, Rasure said. Quynh Van, a 27-year-old UX designer from Minneapolis, returned to social media after four years and was startled by TikTok’s heavy advertising; she believes overspending often stems from not having defined goals, saying, “When you don’t know who you are or what you like, you’re so driven by over-consumerism and lifestyle creep because you don’t have your values in order.” Rasure recommends using financial values as a guiding principle and taking time to map them out. Creating barriers to spending—such as removing saved credit card info or disabling Apple Pay—can also encourage more mindful purchases, Seitz said, noting that requiring extra steps like manually entering payment details forces you to stop and think. Rasure suggests reframing financial boundaries as self-care, which can help reduce shame or guilt and create a sense of intentionality and freedom. Spending habits today shape your future financial well-being, and this mindset can help when tempted by trendy electronics or fashion. It’s also OK to engage with trends in moderation, Rasure said. Van participates mindfully, such as with the matcha trend, while Barber prioritizes physical media like records, DVDs, and cassettes as non-negotiable expenses because they bring her joy. “Trends and engaging them, engaging in them really should spark that happiness or contentment, not the debt that can go with them,” Rasure said.",
        "image":"/images/social-media-budget-tips.webp",
        "slug":"social-media-trends-budget-tips",
        "date":"02, December 2025",
          "author":{
            "name":"Jenna Whitmore",
            "role":"Entertainment Writer",
            "bio":"Jenna covers entertainment, culture, and trending stories, bringing fresh perspective and concise reporting that highlights the people and moments shaping today’s entertainment landscape.",
            "image":"/images/jenna-whitmore.webp",
            "email":"jennawhitmore@fiscalfusion.org",
            "twitter":"https://x.com/jennawhitm94520",
            "facebook":"https://www.facebook.com/profile.php?id=61584976316567",
            "instagram":"https://www.instagram.com/jennawhitmore2025/",
            "substack":"https://substack.com/@jennawhitmore",
            "medium":"https://medium.com/@jennawhitmore"
        }
    },
   {
        "category":"finance",
        "title":"Gen Z’s credit scores are dropping. Here’s what to do if yours is too",
        "shortdescription":"Credit scores among Gen Z are declining, raising financial concerns for young adults. Experts provide tips on improving and managing credit effectively.",
        "description":"Gen Z has seen its credit scores drop more than any other generation over the past year, largely because of student loan debt, according to a new report out this week. The total national average credit score dropped two points this year to 715, according to the report from credit scoring company FICO, but Gen Z’s average score dropped three points to 676, the largest year-over-year decrease among any age group since 2020. A credit score is a mathematical formula that helps lenders determine how likely you are to pay back a loan, based on your credit history, and ranges from 300 to 850. The report found that 34% of Gen Z consumers have open student loans, compared to 17% of the total population, and the decline in credit scores is primarily due to the resumption of student loan delinquency reporting. The U.S. Department of Education paused federal student loan payments in March 2020 during the economic chaos of the coronavirus pandemic, and though payments were set to resume in 2023, the Biden administration provided a one-year grace period that ended in October 2024. This summer, the Trump administration restarted the collection process for outstanding student loans, with plans to seize wages and tax refunds if the loans continue to go unpaid; roughly 5.3 million borrowers who are in default could have their wages garnished by the federal government. Between student loans, a tough job market, and high inflation, young consumers are struggling to make payments on time, according to the report, and a low credit score makes it more complicated or more expensive to obtain car loans, mortgages, credit cards, auto insurance, and other financial services. “They’ve had so many different ongoing causes of economic instability that have really been with them as they’ve been growing up; those factors make it a lot harder for this generation to stay financially stable,” said Courtney Alev, consumer advocate at Credit Karma. However, younger consumers also have the advantage of having the most potential for score improvement, said Tommy Lee, senior director at FICO. If your credit score has dropped recently, experts recommend several steps. Don’t avoid knowing your score; it’s common to fear checking it, but knowing where you stand helps you plan, Alev said, noting that Experian, FICO, and Credit Karma let you check your score for free. While your score is essential for financial health, it’s just a number and doesn’t define you as a person, she added. One of the most critical factors in score calculation is paying on time—whether the minimum or full balance—with this representing about 35% of the FICO score, Lee said. If you’re juggling several debts, Alev recommends setting automatic payments. Keeping your credit utilization low and avoiding new debt can also help; utilization represents the percentage of available credit you’re using, and experts recommend keeping it between 10% and 30% rather than at 0%. If you’re struggling with existing debt, avoid acquiring more if possible. Credit scores change as your financial behavior does, so Lee recommends implementing new habits if you’re unhappy with your current score: “The FICO score is dynamic. It changes based on how you make your payments. So your score, if you want to maintain it or improve it, you can do so by exhibiting good credit behavior,” Lee said.",
        "image":"/images/gen-z-credit-scores.webp",
        "slug":"gen-z-credit-scores-dropping-tips",
        "date":"01, December 2025",
          "author":{
            "name":"Jenna Whitmore",
            "role":"Entertainment Writer",
            "bio":"Jenna covers entertainment, culture, and trending stories, bringing fresh perspective and concise reporting that highlights the people and moments shaping today’s entertainment landscape.",
            "image":"/images/jenna-whitmore.webp",
            "email":"jennawhitmore@fiscalfusion.org",
            "twitter":"https://x.com/jennawhitm94520",
            "facebook":"https://www.facebook.com/profile.php?id=61584976316567",
            "instagram":"https://www.instagram.com/jennawhitmore2025/",
            "substack":"https://substack.com/@jennawhitmore",
            "medium":"https://medium.com/@jennawhitmore"
        }
    },
   {
        "category":"finance",
        "title":"Asian shares are mixed after Wall Street inches closer to its all-time high",
        "shortdescription":"Asian stock markets showed mixed results as Wall Street approached its all-time high. Investors monitored global trends and market sentiment for guidance.",
        "description":"Asian shares were mixed on Friday after the U.S. stock market held near its records in a quiet day of trading, with U.S. futures higher and oil prices falling. Japan’s Nikkei 225 trimmed gains from the previous day, shedding 1.2% to 50,408.70 after government data showed household spending fell 3.0% year-on-year in October, below expectations and marking the sharpest drop since January 2024. Technology shares declined, with Advantest Corp. down nearly 2.3% and Tokyo Electron falling 2.8%. Traders remained cautious ahead of a key U.S. inflation report that could influence Federal Reserve policy, and expectations for a coming rate cut slipped slightly Thursday after reports suggested the job market may be healthier than thought. In Chinese markets, Hong Kong’s Hang Seng index slid 0.1% to 25,921.69, while the Shanghai Composite rose 0.1% to 3,877.83 as traders awaited key Chinese data next week, including inflation, trade, and producer prices, along with signals from high-level economic meetings. South Korea’s Kospi rose 1.1% to 4,074.00, with LG Electronics up 5.6% and Hyundai Motors adding 7.2%. Australia’s S&P/ASX200 edged up less than 0.1% to 8,623.40, Taiwan’s Taiex was nearly unchanged, and India’s Sensex edged 0.1% higher after the Reserve Bank cut its repo rate to 5.25% from 5.5% due to weak price pressures and slowing growth expectations. On Thursday, the U.S. stock market continued its calm streak following weeks of sharp swings: the S&P 500 inched up 0.1% to 6,857.12, just 0.5% below its record; the Dow dipped 0.1% to 47,850.94; and the Nasdaq rose 0.2% to 23,505.14. Dollar General rallied 14% after reporting stronger-than-expected quarterly profits, with more customers shopping and improved profitability per dollar of sales. Ongoing concerns about potential overinvestment in AI and uncertainty over Federal Reserve interest-rate decisions have caused volatility since the S&P 500’s late-October record. Investors generally expect the Fed to cut rates next week to support the slowing jobs market, which would be the third cut this year, though lower rates risk worsening inflation that remains above the 2% target. Hopes for a cut dimmed slightly after new data showed fewer unemployment claims—the lowest in over three years—and layoffs falling sharply from October’s surge, suggesting the job market may not require as much rate-cut support. In Friday dealings, U.S. benchmark crude fell 17 cents to $59.50 per barrel, while Brent crude slipped 11 cents to $63.15. The U.S. dollar eased to 154.77 Japanese yen from 155.12 yen, and the euro ticked up to $1.1657 from $1.1645.",
        "image":"/images/asian-shares-wall-street.webp",
        "slug":"asian-shares-mixed-wall-street-nears-high",
        "date":"27, November 2025",
          "author":{
            "name":"Evan Carlisle",
            "role":"U.S. News Reporter",
            "bio":"Evan reports on major U.S. news stories with a focus on clarity, relevance, and timely updates that help readers stay informed about what’s happening across the country.",
            "image":"/images/evan-carlisle.webp",
            "email":"evancarlisle@fiscalfusion.org",
            "twitter":"https://x.com/EvanCarlis90819",
            "facebook":"https://www.facebook.com/profile.php?id=61584747486041",
            "instagram":"https://www.instagram.com/evancarlisle92/",
            "substack":"https://substack.com/@evancarlisle",
            "medium":"https://medium.com/@evancarlisle_85958"
        }
    },
   {
        "category":"finance",
        "title":"Here’s why everyone’s talking about a ‘K-shaped’ economy",
        "shortdescription":"A “K-shaped” economy describes divergent economic outcomes where some sectors thrive while others struggle. Experts explain how this pattern affects income, jobs, and recovery trends.",
        "description":"WASHINGTON  — From corporate executives to Wall Street analysts to Federal Reserve officials, references to the “K-shaped economy” are rapidly proliferating, and the term simply means that the upper part of the K refers to higher-income Americans seeing their incomes and wealth rise while the bottom part points to lower-income households struggling with weaker income gains and steep prices. A big reason the term is appearing so frequently is that it helps explain an unusually muddy and convoluted period for the U.S. economy: growth appears solid yet hiring is sluggish and unemployment has ticked up, overall consumer spending is rising but confidence is falling, AI-related data center construction is soaring while factories are laying off workers and home sales are weak, and the stock market hovers near record highs even as wage growth slows. It also reflects ongoing concerns about affordability for middle- and lower-income households, as persistent inflation—especially for rents, groceries and imported goods—has become a political flashpoint after helping Democrats win several high-profile elections last month. “Those at the bottom are living with the cumulative impacts of price inflation,” said Peter Atwater, an economics professor at William & Mary in Virginia. “At the same time, those at the top are benefiting from the cumulative impact of asset inflation.” Atwater popularized the term “K-shaped economy” during the pandemic when other economists were debating whether the COVID recession would be V-, U-, or L-shaped, observing that fortunes were diverging sharply between white-collar professionals still working remotely while stocks soared and workers in factories, restaurants and entertainment venues suffered massive layoffs that pushed unemployment near 15%. Inequality narrowed somewhat during the reopening period as businesses offered large raises to blue-collar workers to address staffing shortages, with the bottom quarter of workers seeing inflation-adjusted wage gains of 3.9% in 2023 and 2024, outpacing the 3.1% gains for the top quarter, according to the Federal Reserve Bank of Minneapolis. “We had that kind of two-year period where the bottom was catching up and that talk of the K-shape went away,” said economist Dario Perkins of TSLombard. “And since then, the economy’s cooled down again,” bringing back K-shaped references. This year, inflation-adjusted wage growth has weakened considerably, especially for lower-income Americans, whose wage gains plunged to an annual rate of just 1.5%, below the 2.4% for the highest earners. As a result, many lower-income workers are less able to spend: Bank of America Institute data shows spending among higher-income households rose 2.7% year over year in October, compared with just 0.7% for lower-income groups, and a Federal Reserve Bank of Boston study found that recent consumer spending has been driven mainly by richer households while lower- and middle-income Americans have accumulated more credit card debt even as they cut spending. Corporate executives are taking notice and adjusting strategies by selling more high-priced items to wealthy consumers while offering smaller package sizes and affordability options for those struggling. Coca-Cola COO Henrique Braun said the company is pursuing both “affordability” and “premiumization,” seeing spending divergence persist between income groups. Delta Air Lines CEO Ed Bastian said premium ticket sales are fueling profits while lower-end consumers are “clearly struggling,” and Best Buy CEO Corie Barry noted that the top 40% of U.S. consumers drive two-thirds of consumption, while the remaining 60% focus on deals and depend heavily on a healthy job market. Massive investment in AI infrastructure is also reinforcing the K-shape, elevating share prices for “Magnificent 7” giants like Google, Amazon, Nvidia and Microsoft but generating few new jobs or income gains for people without stock ownership. “What we see at the very top is an economy that is sort of self-contained ... between AI, the stock market, the experiences of the wealthy,” Atwater said. “And it’s largely contained. It doesn’t flow through to the bottom.” Driven by gains in these tech giants, the stock market has risen nearly 15% this year, but the wealthiest 10% of Americans own roughly 87% of equities while the poorest 50% own just 1.1%. Many economists warn that an economy fueled primarily by the wealthy is not sustainable, noting that if layoffs worsen and unemployment rises, middle- and lower-income Americans could sharply cut spending, hurting revenue at companies such as Apple and Amazon and slashing advertising income for firms like Google and Meta, potentially even forcing AI-heavy tech giants to scale back investments and tipping the economy into recession. Perkins said such a scenario would mean “the bottom of the K essentially pulling down the top.” Still, he sees a different outcome as more likely: many households will receive larger tax refunds early next year under the Trump administration’s budget law, and Trump is expected to appoint a new Federal Reserve chair by next May who may be more inclined to cut interest rates, which could accelerate growth and wages but could also worsen inflation.",
        "image":"/images/k-shaped-economy.webp",
        "slug":"k-shaped-economy-explained",
        "date":"01, December 2025",
          "author":{
            "name":"Evan Carlisle",
            "role":"U.S. News Reporter",
            "bio":"Evan reports on major U.S. news stories with a focus on clarity, relevance, and timely updates that help readers stay informed about what’s happening across the country.",
            "image":"/images/evan-carlisle.webp",
            "email":"evancarlisle@fiscalfusion.org",
            "twitter":"https://x.com/EvanCarlis90819",
            "facebook":"https://www.facebook.com/profile.php?id=61584747486041",
            "instagram":"https://www.instagram.com/evancarlisle92/",
            "substack":"https://substack.com/@evancarlisle",
            "medium":"https://medium.com/@evancarlisle_85958"
        }
    },
   {
        "category":"finance",
        "title":"Walmart raises profit expectations as more Americans hunt deals in sluggish economy",
        "shortdescription":"Walmart has raised its profit outlook as more Americans seek deals amid a sluggish economy. The retail giant credits strong sales and consumer demand for discounts.",
        "description":"Walmart delivered another standout quarter, posting strong sales and profits that blew past Wall Street expectations as it wins over a broad base of shoppers including cash-strapped Americans and the well-heeled, who have grown increasingly anxious about the economy. While other retailers dial back projections, the nation’s largest retailer raised its financial outlook Thursday after its strong third quarter, setting itself up for a strong holiday shopping season. Walmart Inc., based in Bentonville, Arkansas, also said Thursday that it will be transferring the listing of its common stock to the tech-heavy Nasdaq from the New York Stock Exchange, expecting its common stock to begin trading on the Nasdaq Global Select Market on Dec. 9 under the ticker symbol “WMT.” CEO Doug McMillon, who surprised investors last week with plans to retire early next year, has reshaped Walmart into a tech-powered retail giant through automation and artificial intelligence. McMillon oversaw robust sales growth during his tenure starting in 2014, competing fiercely with Amazon; John Furner, 51, head of Walmart’s U.S. operations, will take over on Feb. 1 after McMillon’s retirement. The leadership change comes at a challenging time for U.S. companies navigating an uncertain economic environment as President Donald Trump imposes sweeping tariffs on imports and pursues an immigration crackdown that threatens to shrink the U.S. workforce. Walmart’s performance is seen as a barometer of consumer spending because 90% of U.S. households rely on the retailer, with more than 150 million customers shopping weekly in stores or online. “We’re gaining market share, improving delivery speed, and managing inventory well,” McMillon said. Comparable U.S. sales rose 4.5% in the third quarter, nearly matching last quarter’s 4.6%, with the biggest market-share gains coming from households earning over $100,000. CFO John David Rainey said spending from middle-income shoppers remained steady, but lower-income shoppers pulled back in the latter half of the quarter, partly due to lost SNAP benefits during the government shutdown; sales later rebounded. Lower-income consumers are “stretching their dollars” and avoiding discretionary items, he said, prompting Walmart to ramp up rollbacks—temporary discounts—to 7,000. Other retailers have reported mixed results: Target’s third-quarter profit plunged as inflation-weary shoppers cut back; Home Depot saw mixed results amid fewer violent storms, anxious consumers, and a stagnant housing market; TJX upgraded its outlook amid strong demand for discounted goods. Walmart’s third-quarter profits rose to $6.14 billion, or 77 cents per share, with adjusted earnings of 66 cents—6 cents above Wall Street expectations—and sharply higher than last year’s $4.58 billion, or 57 cents per share. Sales surged nearly 6% to $179.5 billion, beating expectations. Global e-commerce sales rose 27%, up from 25% in Q2 and 22% in Q1. Walmart has managed higher tariff-related costs by adjusting product mix and absorbing some increases; prices rose 1.3% in the quarter, above the 3% U.S. inflation rate. Electronics, toys, and seasonal goods saw the highest price increases, in the high single digits. Walmart now expects adjusted profits of $2.58 to $2.63 per share for the year, up from prior guidance of $2.52 to $2.62, and predicts full-year sales growth of 4.8% to 5.1%, above its earlier forecast of 3.75% to 4.75%. Analysts had expected $2.61 per share. Walmart’s shares rose $6.23, or more than 6%, to $106.85 in late-morning trading.",
        "image":"/images/walmart-profit-expectations.webp",
        "slug":"walmart-raises-profit-expectations",
        "date":"02, December 2025",
          "author":{
            "name":"Evan Carlisle",
            "role":"U.S. News Reporter",
            "bio":"Evan reports on major U.S. news stories with a focus on clarity, relevance, and timely updates that help readers stay informed about what’s happening across the country.",
            "image":"/images/evan-carlisle.webp",
            "email":"evancarlisle@fiscalfusion.org",
            "twitter":"https://x.com/EvanCarlis90819",
            "facebook":"https://www.facebook.com/profile.php?id=61584747486041",
            "instagram":"https://www.instagram.com/evancarlisle92/",
            "substack":"https://substack.com/@evancarlisle",
            "medium":"https://medium.com/@evancarlisle_85958"
        }
    },
   {
        "category":"finance",
        "title":"Nvidia, bitcoin and other falling stars drag the US stock market lower",
        "shortdescription":"Declines in Nvidia, Bitcoin, and other key assets dragged the U.S. stock market lower. Investors reacted to falling tech and crypto prices, reversing earlier gains.",
        "description":"The U.S. stock market sank Monday as Nvidia and other superstars created by the frenzy around artificial-intelligence technology dimmed some more. The S&P 500 fell 0.9% and pulled further from its all-time high set late last month, while the Dow Jones Industrial Average dropped 557 points, or 1.2%, and the Nasdaq composite sank 0.8%. Nvidia was the heaviest weight on the market, as it has often been in recent tumultuous weeks, falling 1.8%, while other AI winners also slid, including a 6.4% drop for Super Micro Computer. Other high-momentum areas also weakened: Bitcoin fell below $92,000, down from nearly $125,000 last month, pulling Coinbase Global down 7.1% and Robinhood Markets down 5.3%. Critics have warned that the U.S. stock market may be primed for a drop because prices have shot so high since April, leaving them looking too expensive, especially stocks swept up in the AI mania that have surged for years. Even with Monday’s loss, Nvidia is still up 39% for the year after doubling in price in four of the last five years. That puts Wall Street’s spotlight on Wednesday, when Nvidia will report how much profit it made during the summer; AI stocks have surged on expectations of huge profit growth, and falling short of analysts’ forecasts could undercut a major assumption behind record market highs. High expectations have also extended beyond tech: Aramark fell 5.2% after reporting a quarterly profit that missed expectations and offering a forecast for underlying profit growth of 20% to 25% next year, which was weaker than analysts anticipated. That helped offset a 3.1% rise for Alphabet after Berkshire Hathaway disclosed a $4.34 billion stake in Google’s parent company; Berkshire, led by Warren Buffett, is known for buying only when valuations look attractive. All told, the S&P 500 fell 61.70 points to 6,672.41, the Dow dropped 557.24 to 46,590.24, and the Nasdaq slid 192.51 to 22,708.07. Another source of potential disappointment for Wall Street is what the Federal Reserve does next with interest rates. Traders had expected continued Fed rate cuts to support the slowing job market, but doubts have risen about whether a third cut this year will come at the December meeting, as lower rates risk worsening inflation, which remains above the Fed’s 2% target. Fed officials have also cited the U.S. government shutdown, which delayed key data releases, creating uncertainty that could justify waiting. With the shutdown over, September’s delayed jobs report will be released Thursday and could trigger further market swings: very strong data could reduce chances of rate cuts, while very weak data could raise economic worries. Analyst Barry Bannister of Stifel expects the Fed in 2026 to cut rates only in response to a slowing economy, not preemptively, saying the “Fed’s ‘free lunch’ is over.” In the bond market, the 10-year Treasury yield dipped to 4.13% from 4.14%. Stock indexes abroad fell modestly across much of Europe and Asia; Tokyo’s Nikkei 225 slipped 0.1% after Japan reported its economy contracted at a 1.8% annual rate in Q3, while South Korea’s Kospi jumped 1.9% as tech stocks there advanced.",
        "image":"/images/nvidia-bitcoin-stocks.webp",
        "slug":"nvidia-bitcoin-us-stocks-fall",
        "date":"02, December 2025",
          "author":{
            "name":"Sophie Langford",
            "role":"Business & Finance Correspondent",
            "bio":"Sophie covers business trends and financial developments, offering clear insights that help FiscalFusion readers understand market shifts and economic changes.",
            "image":"/images/sophie-langford.webp",
            "email":"sophielangford@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584953787187",
            "instagram":"https://www.instagram.com/sophielangford9/",
            "substack":"https://substack.com/@sophielangford1",
            "medium":"https://medium.com/@sophielangford_44287"
        }
    },
   {
        "category":"finance",
        "title":"Wall Street scrambles back from a big morning loss as Nvidia and bitcoin swing",
        "shortdescription":"Wall Street recovered from a significant morning loss as swings in Nvidia and Bitcoin influenced trading. Market volatility continues to challenge investors.",
        "description":"An early swoon shook the U.S. stock market on Friday, as Nvidia, bitcoin, gold and other high flyers swung on an increasingly antsy Wall Street, but it quickly calmed. After starting the day with a sharp drop of 1.3%, the S&P 500 erased all of it and then meandered up and down before finishing with a slight dip of 0.1%, while the Nasdaq composite flipped to a gain of 0.1% and the Dow Jones Industrial Average trimmed its loss to 309 points, or 0.7%, after earlier being down nearly 600. AI stocks were again at the center of the action, a day after dragging Wall Street to one of its worst drops since its springtime sell-off. Nvidia, the poster child of the artificial-intelligence frenzy, began the day down 3.4% before storming back to a 1.8% rise that pulled the market along. Critics have been warning that the market could be primed for a drop because prices have shot so high since April, especially among AI-driven stocks, with Nvidia having more than doubled in four of the last five years and still up more than 40% this year. Even with recent sharp swings, the S&P 500 remains within 2.3% of its late-November record. Outside tech, Walmart edged down 0.1% after announcing that CEO Doug McMillon will retire in January, having been down as much as 3.6% earlier; McMillon helped the retailer embrace technology. All told, the S&P 500 fell 3.38 points to 6,734.11, the Dow dropped 309.74 to 47,147.48, and the Nasdaq rose 30.23 to 22,900.59. Companies can ease criticism of high stock prices by delivering solid profit growth, raising the stakes for Nvidia’s upcoming Wednesday report; falling short could drag the market lower, given Nvidia’s massive weight in major indexes. Another path toward making stock prices look less expensive is falling interest rates, because lower-yielding bonds make stocks more attractive. Treasury yields had been falling most of the year on expectations of multiple Fed rate cuts, and the Fed has cut twice to support the slowing job market, but doubts are growing about a third cut in December as inflation remains above the 2% target. Fed officials have cited the government shutdown, which delayed key economic data, as a reason to potentially wait. The 10-year Treasury yield rose to 4.14% from 4.11%. Bitcoin, which can benefit from lower rates, fell below $95,000, back to May levels after trading near $125,000 in October. Gold sank 2.4% after hitting records throughout the year as investors sought protection from inflation and rising global debt, but higher rates hurt gold because it pays no interest. Overseas, stock indexes fell across Europe and Asia, with South Korea’s Kospi down 3.8% for one of the world’s steepest losses, while London’s FTSE 100 sank 1.1% amid speculation that the U.K. government may scrap plans to raise income taxes aimed at reducing national debt.",
        "image":"/images/wall-street-nvidia-bitcoin.webp",
        "slug":"wall-street-rebounds-nvidia-bitcoin-swings",
        "date":"23, November 2025",
         "author":{
            "name":"Travis Monroe",
            "role":"Sports Reporter",
            "bio":"Travis brings fast, engaging coverage of sports highlights, athlete updates, and major events, delivering sharp commentary and essential game-focused reporting for FiscalFusion.",
            "image":"/images/travis-monroe.webp",
            "email":"travismonroe@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584803823704",
            "instagram":"https://www.instagram.com/travismonroe2025/",
            "substack":"https://substack.com/@travismonroe1",
            "medium":"https://medium.com/@travismonroe_60532"
        }
    }
]