[
    {
        "category":"politics",
        "title":"Florida starts redistricting talks in a growing battle for House control in 2026 elections",
        "shortdescription":"Florida has begun redistricting discussions — a move many see as strategic positioning for control of the U.S. House in the 2026 elections. The effort could reshape voting districts and influence which party gains seats.",
        "description":"Florida’s Republican-controlled House is holding the first meeting of its select committee on congressional redistricting Thursday, as the state becomes the latest to consider redrawing electoral maps amid a partisan battle for every edge in next year’s midterm elections. The national wave of redistricting efforts was instigated by President Donald Trump, who hopes to buck the historical trend of the president’s party losing seats in midterms, and his allies are wagering that his adopted home state could yield three to five more seats for Republicans. Each seat is crucial, because Democrats need a net gain of just three to control the chamber. But the push for redistricting faces major challenges in Florida due to bitter infighting between Republican Gov. Ron DeSantis and leaders in the GOP-dominated Legislature, along with a provision in the state Constitution that explicitly bars redrawing maps with the intent to “favor or disfavor a political party or an incumbent.” DeSantis has voiced support for redistricting and even called for a redo of the 2020 U.S. census, claiming that Florida was shortchanged in the count, which determines how many congressional seats each state gets. This week, in an interview with online outlet The Floridian, DeSantis floated the possibility of calling lawmakers back in a special session if they do not get redistricting done in the regular session, which is scheduled for Jan. 13 to March 13. The state Senate has declined to wade into the fray so far. Senate President Ben Albritton, also a Republican, has said there is “no ongoing work” on the matter in his chamber, citing the governor’s desire to address it in the spring. Civil liberties and voting rights organizations say any redistricting for partisan gain in Florida is unconstitutional, and their supporters plan to pack committee meetings to voice opposition. “To redraw the lines for partisan reasons is illegal. Period, full stop,” said Genesis Robinson, executive director of the voter engagement organization Equal Ground. Florida has 28 congressional seats, with a Republican-Democratic split of 20-8. Nationwide, midcycle redistricting has resulted in nine more congressional seats that Republicans believe they can win and six that Democrats think they can win. The redistricting is being litigated in several states, however, and there is also no guarantee that the parties will win the remapped seats.",
        "image":"/images/florida_statehouse_tallahassee_2025.webp",
        "slug":"florida-redistricting-talks-house-2026",
        "date":"04, December 2025",
        "author":"Marcus Bennett"
    },
    {
        "category":"politics",
        "title":"A California Republican faces long odds after redistricting. Will he seek a safer seat in Texas?",
        "shortdescription":"A California Republican — now facing steep re-election challenges after redistricting — may explore shifting to a safer district in Texas. The move reflects growing pressure on GOP incumbents struggling in newly drawn California districts.",
        "description":"The redrawing of California’s congressional map to boost Democrats’ chances has left Republicans scrambling for political survival. Some are digging in for tough races, but one is considering a particularly audacious step — moving to Texas. Rep. Darrell Issa, a wealthy car alarm magnate, could make the jump from the Golden State to the Lone Star State in hopes of stretching his quarter-century in Congress at least a little bit longer. The possibility was disclosed by a person familiar with Issa’s thinking, who requested anonymity to discuss private conversations. It’s an extreme example of how lawmakers commonly seek greener political pastures after redistricting, and Issa’s dilemma reflects an extraordinary collision between competing efforts to redraw congressional maps. Texas is trying to make itself safer for Republicans while California is trying to help Democrats in response, part of a national gerrymandering battle ahead of next year’s midterm elections. Issa has moved before during his political career, trading an increasingly blue coastal district for a redder inland area east of San Diego. However, his current district has been redrawn to include the Democratic stronghold of Palm Springs after California voters passed Proposition 50 last month, making it far more difficult for Issa to be reelected. Much uncertainty remains, as court battles play out across the country over the new districts. The Supreme Court is weighing whether to uphold a lower court ruling blocking new Texas districts approved by Republican state officials. However, the filing deadline for Texas is Monday, and Issa has to decide whether to leave behind California’s beaches and sunshine for Texas flatlands and cowboy culture. His possible cross-country move is being greeted with skepticism from one influential Republican, Rep. Richard Hudson of North Carolina, who heads the campaign arm of the House GOP. “I’ve encouraged Darrell to run in his current district,” Hudson said. The person familiar with Issa’s thinking said he’s facing a complicated decision and is still thinking through the options. It’s possible that he remains in California, shifts to another district in the state or sits out the election entirely. Midterm elections are typically difficult for the party that holds the White House, and Republicans face the possibility of losing their slim majority in the House. If Issa decides to move, he would join other former Californians who recently decamped for Texas in search of a more affordable cost of living, among other reasons. The nation’s two most populous states have also been fierce political rivals, and California Gov. Gavin Newsom and Republican Texas Gov. Greg Abbott have been in a long-running feud over taxes, gun control and other issues. You can find “Don’t California my Texas” stickers and shirts for sale online. Issa is eyeing Texas’ 32nd District, which is northeast of Dallas. Liz Gover, a precinct chair for the Dallas County Republican Party, said she had a favorable view of Issa as a California congressman but noted he doesn’t live in Texas and other candidates are seeking the seat. She is backing Republican Darrell Day in the district. “I think people would want — in any district — someone who lived in the district, in the state,” she said. “Does he know Texas?” Day, the candidate in the district, asked, “If California voters aren’t going to vote for him, I don’t know why he thinks Texas voters would vote for him?” “If he’s looking for an easy seat, he’s looking in the wrong place,” Day added. “We look forward to kicking to his ass.” U.S. Sen. John Cornyn, a Texas Republican, said he hasn’t reached out to Issa personally but added: “I’m happy to talk to him. We’ve got a lot of other immigrants from California.”",
        "image":"/images/california_capitol_sacramento_2025.webp",
        "slug":"california-gop-rep-considers-texas-after-redistricting",
        "date":"04, December 2025",
        "author":"Marcus Bennett"
    },
   {
        "category":"politics",
        "title":"Republicans emerge victorious and anxious after Tennessee special election",
        "shortdescription":"Republicans claimed a victory in the recent Tennessee special election — but party leaders say they’re uneasy, wary that the win masks deeper voter concerns that could shape future races.",
        "description":"Republicans held onto a reliably conservative U.S. House district in Tennessee’s special election but only after a late burst of national spending and high-profile campaigning helped them secure a margin less than half of last year’s race. Even with that victory the outcome contributed to a gloomy outlook for the party going into the 2026 midterms that will determine control of Congress. Republicans will need to defend much more vulnerable seats if they have any hope of keeping their House majority while Democrats are capitalizing on President Donald Trump’s unpopularity and the public’s persistent frustration with the economy. “The danger signs are there and we shouldn’t have had to spend that kind of money to hold that kind of seat,” said Jason Roe a national Republican strategist working on battleground races next year. He said that “Democratic enthusiasm is dramatically higher than Republican enthusiasm.” Republican Matt Van Epps a military veteran and former state general services commissioner defeated Democratic state Rep. Aftyn Behn by 9 percentage points on Tuesday for the seat vacated by Republican Mark Green who retired over the summer. Green had won reelection in 2024 by 21 percentage points. Special elections provide a limited window into the mood of voters and take place under far different conditions than regular campaign cycles. But some Republicans are acknowledging the warning signs especially after Democrats had convincing victories in New Jersey Virginia and elsewhere last month. Tennessee was the fifth House special election this year and Democratic candidates have outperformed Kamala Harris’ margins in the 2024 presidential race by an average of 16 percentage points in the same districts. “We could have lost this district,” U.S. Sen. Ted Cruz R-Texas told Fox News after The Associated Press called the race for Van Epps. Cruz said his party must “set out the alarm bells” because next year is “going to be a turnout election and the left will show up.” Although inflation has dropped since Democratic President Joe Biden was in office Behn focused her campaign on the lingering concerns about prices. Trump has played down the affordability issue saying during a Cabinet meeting Tuesday that it was “a con job” by his political opponents. “There’s this fake narrative that the Democrats talk about affordability,” he said. “They just say the word. It doesn’t mean anything to anybody they just say it.” Roe viewed things differently. He said the Tennessee race had “better be a wake-up call that we’ve got to address the affordability problem and the president denying that affordability is a political issue is not helpful.” Maintaining House control is crucial for Trump who fears a repeat of his first term when Democrats flipped the House and launched an impeachment inquiry. The Republican president has been leaning on GOP-led states to redraw congressional maps to improve the party’s chances. Playing down the impact of Tuesday’s vote U.S. Rep. Mike Lawler R-N.Y. said, “There’s nothing unique about the party out of power performing better in a special election.” The Republican National Committee deployed staffers and partnered with state officials to get voters to the polls. MAGA Inc. the super political action committee that had gone dark since supporting Trump in 2024 reemerged to back Van Epps with about $1.7 million. U.S. House Speaker Mike Johnson R-La. visited the Nashville-area district on Monday. “When you’re in a deep red district sometimes people assume that the Republican the conservative will win,” he said Tuesday. “And you cannot assume that because anything can happen.” Chip Saltsman a political strategist and former Tennessee Republican Party chair said his party had brought in its heaviest hitters simply because there were not other competing contests not because Republicans feared a loss. “It’s the only election going on. Why wouldn’t the speaker come?” he asked. “There was one race and you would expect everybody to do everything they could.” Despite concerns about low turnout for the post-Thanksgiving election about 180000 people voted similar to the number in the 2022 midterms. The House Majority PAC put $1 million behind Behn who said her campaign had “inspired an entire country.” U.S. Rep. Pete Aguilar of California the No. 3 House Democrat said Republicans “see the writing on the wall” and “it’s a mess over there.” “They’re fighting amongst themselves right now,” he said Wednesday. Although Democrats were optimistic the result contributed to some murmuring within the party about the best path forward as it grasps for a path back to power in Washington. Among special elections this year the shift in Behn’s direction was the second smallest providing an opening for some factions that believe more moderate candidates would fare better. “Each time we nominate a far-left candidate in a swing district who declares themselves to be radical and alienates the voters in the middle who deliver majorities we set back that cause,” said a statement from Lanae Erickson a senior vice president at Third Way a centrist Democrat think tank. Republicans tried to turn Behn’s own words against her in television ads such as when she described herself as a “radical” or claimed to be “bullying” immigration agents and state police officers. Also cited were comments Behn made about Nashville years ago when she said, “I hate this city,” and complained about bachelorette parties. Several high-profile progressive leaders including U.S. Rep. Alexandria Ocasio-Cortez D-N.Y. had rallied for Behn in the campaign’s final days.",
        "image":"/images/tennessee_capitol_nashville_2025.webp",
        "slug":"tennessee-special-election-gop-victory-anxious",
        "date":"04, December 2025",
        "author":"Marcus Bennett"
    },
   {
        "category":"politics",
        "title":"Justice Department expands legal action against states that have refused its demands for voter data",
        "shortdescription":"The U.S. Justice Department is intensifying legal efforts against states refusing to provide requested voter data, aiming to enforce compliance and protect voting integrity.",
        "description":"The Justice Department on Tuesday sued six more states in its ongoing campaign to obtain detailed voter data and other election information. The department announced it was suing Delaware Maryland New Mexico Rhode Island Vermont and Washington over their “failure” to produce statewide voter registration lists. It has portrayed the litigation as part of an effort to ensure the security of elections but Democratic officials have raised concerns over how the data will be used and whether the department will follow privacy laws in protecting it. Tuesday’s actions bring to at least 14 the number of states the Justice Department has sued in its quest for the voter information. “Our federal elections laws ensure every American citizen may vote freely and fairly,” said Assistant Attorney General Harmeet Dhillon of the department’s Civil Rights Division. “States that continue to defy federal voting laws interfere with our mission of ensuring that Americans have accurate voter lists as they go to the polls that every vote counts equally and that all voters have confidence in election results.” The department has requested the voter data from at least 26 states according to an Associated Press tally. It’s prompted concerns among some election officials because states have the constitutional authority to run elections and federal law protects the sharing of individual data with the government. It also signals the transformation of the Justice Department’s involvement in elections under President Donald Trump. Many requests included basic questions about the procedures states use to comply with federal voting laws such as how they identify and remove duplicate voter registrations or deceased or otherwise ineligible voters. Certain questions were more state-specific and referenced data points or perceived inconsistencies from a recent survey from the U.S. Election Assistance Commission. Some states have sent the department redacted versions of their voter lists which in many cases are also available to the public. But the Justice Department also has requested copies that contain personally identifiable information including voters’ names birth dates addresses and driver’s license numbers or partial Social Security numbers. The New Mexico Secretary of State’s office said it already provided the Justice Department with voter data that is publicly available but said it’s legally prevented from turning over “personal private voter information” office spokesperson Alex Curtas said in a statement. Rhode Island Attorney General Attorney Peter Neronha said his office was aware of the lawsuit and called it the “latest example of the weaponization of the Department of Justice to further the Trump administration’s unlawful whims.” “We stand with and will defend the secretary and win because lawsuits concerning lawful conduct are largely unsuccessful,” Neronha said. “But I’m not surprised that this administration is confused about what it means to behave lawfully.” The Justice Department’s actions come alongside Trump’s push to investigate the 2020 election which he lost to Democrat Joe Biden and influence the 2026 midterms. At the same time voting rights groups have sued the administration arguing that recent updates to a federal tool for verifying citizenship could result in voters being unlawfully purged from voter lists. Last month 10 Democratic secretaries of state asked the Trump administration to provide more information about its wide-ranging efforts to seek the statewide voter registration lists. They cited concerns that federal agencies have apparently misled them and might be entering the data in a program used to verify U.S. citizenship.",
        "image":"/images/justice_department_building_dc_2025.webp",
        "slug":"justice-dept-expands-voter-data-action",
        "date":"03, December 2025",
        "author":"Travis Monroe"
    },
   {
        "category":"politics",
        "title":"Democrat Mandela Barnes, a former US Senate candidate, enters the Wisconsin governor’s race",
        "shortdescription":"Former U.S. Senate candidate Mandela Barnes has officially entered the Wisconsin governor’s race, aiming to bring Democratic leadership to the state.",
        "description":"Democrat Mandela Barnes who served four years as Wisconsin’s lieutenant governor and narrowly lost a 2022 U.S. Senate bid said in an interview Tuesday that he jumped into the battleground state’s open race for governor because “the moment is too urgent.” Given his prominent name recognition and statewide funding network Barnes enters the 2026 race as the presumptive front-runner in a crowded primary of lesser-known candidates who have no built-in network of support. Wisconsin is a politically divided state that elected President Donald Trump in 2016 and 2024 and President Joe Biden in 2020. All three elections were decided by less than a percentage point. Barnes used his campaign launch video to appeal to Democratic voters with an attack on Trump and to pitch a broader message for key independent and moderate voters focused on improving the economy. “I decided to get into this race because the moment is too urgent,” Barnes told The Associated Press. “We need bold leadership to take on Donald Trump. Things are getting much more difficult for people all across Wisconsin.” Barnes has met with some opposition among Democrats who have publicly expressed worries about him running after he lost the Senate race to Republican incumbent Sen. Ron Johnson three years ago. If he wins next year he will become Wisconsin’s first Black governor. “Mandela had his opportunity. He didn’t close. And that means it’s time for a new chapter,” the Black-owned Milwaukee Courier newspaper wrote in an Oct. 25 editorial. “We need a candidate who can unite this state — and win. Mandela Barnes already showed us he can’t.” Barnes lost to Johnson by 1 percentage point which amounts to just under 27,000 votes. Barnes on Tuesday recalled speaking with former President Barack Obama the day after his defeat. Barnes said Obama talked about the campaign for Congress that he lost. “He got back out there and he kept organizing,” Barnes said. “That’s what I’ve been up to.” After his defeat Barnes formed a voter turnout group called Power to the Polls which he says helped bolster turnout among Black voters in Milwaukee and strengthened his position heading into the governor’s race. He also has a political action committee. Barnes joins a crowded field in the open race for governor that already includes the current lieutenant governor two state lawmakers the highest elected official in the Democratic stronghold of Milwaukee County and a former state economic development director. Republican U.S. Rep. Tom Tiffany a staunch Trump supporter is the highest profile GOP candidate. He faces a challenge from Washington County Executive Josh Schoemann. Tiffany called Barnes a “dangerous far-left extremist” and said voters “rejected him in 2022 and they will do it again in 2026.” He made a series of posts on the social platform X that he said showed why Barnes’ agenda was wrong for the state. Tiffany noted Barnes’ past support for reduced funding for police allowing immigrants who are not citizens to get driver’s licenses and pay in-state college tuition and implementing policies that recognize climate change. Barnes told AP that Tiffany has been nothing but a “rubber stamp” for Trump. “He’s put politics before the people he represents,” Barnes said. ”He has sat idly by as things have become more difficult. And people are tired of political games. They’re tired of the nonsense. They don’t want somebody who’s just going to suck up to the president.” It will be Wisconsin’s highest-profile race next year as Democrats angle to take control of the state Legislature thanks to redrawn election maps that are friendlier to the party. The governor’s race is open because current Democratic Gov. Tony Evers decided against seeking a third term. Barnes a former state representative won the primary for lieutenant governor in 2018 and served in that position during Evers’ first term. The current lieutenant governor Sara Rodriguez was the first Democrat to get into the governor’s race this year. Others running include Milwaukee County Executive David Crowley state Sen. Kelda Roys state Rep. Francesca Hong and former state economic development director Missy Hughes. An August primary will narrow the field ahead of the November election. The last open race for governor in Wisconsin was in 2010. Republican Scott Walker won that year and served two terms before Evers defeated him in 2018. Evers won his first race by just over 1 percentage point in 2018. He won reelection by more than 3 points in 2022.",
        "image":"/images/mandela_barnes_wisconsin_2025.webp",
        "slug":"mandela-barnes-wisconsin-governor-race",
        "date":"03, December 2025",
        "author":"Jenna Whitmore"
    },
   {
        "category":"politics",
        "title":"Lawmakers will hear from Navy admiral who ordered attack that killed boat strike survivors",
        "shortdescription":"Lawmakers are set to question the Navy admiral responsible for an attack that killed survivors of a prior boat strike, seeking accountability and details on the incident.",
        "description":"The Navy admiral who reportedly issued orders for the U.S. military to fire upon survivors of an attack on an alleged drug boat is expected Thursday on Capitol Hill to provide a classified briefing to top congressional lawmakers overseeing national security. The information from Adm. Frank “Mitch” Bradley who is now the commander of U.S. Special Operations Command comes at a potentially crucial moment in the unfolding congressional investigation into how Defense Secretary Pete Hegseth handled the military operation in international waters near Venezuela. There are mounting questions over whether the strike may have violated the law. Lawmakers are seeking a full accounting of the strikes after The Washington Post reported that Bradley on Sept. 2 ordered an attack on two survivors to comply with Hegseth’s directive to “kill everybody.” Legal experts say the attack amounts to a crime if the survivors were targeted and lawmakers on both sides of the aisle are demanding accountability. Bradley will speak to a handful of top congressional leaders including the Republican chairs and ranking Democrats of the House and Senate committees on Armed Services and separately to the GOP chairman and Democratic vice chairman on the Senate Intelligence Committee. “This is an incredibly serious matter. This is about the safety of our troops. This is an incident that could expose members of our armed services to legal consequences,” Senate Democratic leader Chuck Schumer of New York said in a floor speech Wednesday. “And yet the American public and the Congress are still not hearing basic facts.” As Bradley appears for questions in the classified setting lawmakers will be seeking answers to key questions: What orders did Hegseth give regarding the operations? And what was the reasoning for the second strike? Democratic lawmakers are also demanding that the Trump administration release the full video of the Sept. 2 attack as well as written records of the orders and any directives from Hegseth. While Republicans who control the national security committees have not publicly called for those documents they have pledged a thorough review. “The investigation is going to be done by the numbers,” said Sen. Roger Wicker of Mississippi the chair of the Senate Armed Services Committee. “We’ll find out the ground truth.” Pressure builds on Hegseth President Donald Trump has stood behind Hegseth as he defends his handling of the attack but pressure is mounting on the defense secretary. Hegseth has said the aftermath of an initial strike on the boat was clouded in the “fog of war.” He has also said he “didn’t stick around” for the second strike but said Bradley “made the right call” and “had complete authority” to do it. Also on Thursday the Defense Department inspector general was expected to release a partially redacted report into Hegseth’s use of the Signal messaging app in March to share information about a military strike against Yemen’s Houthi militants. The report found that Hegseth put U.S. personnel and their mission at risk by using Signal according to two people familiar with the findings. The Pentagon however has cast the report as an exoneration of Hegseth. Who is Adm. Bradley? At the time of the attack Bradley was the commander of Joint Special Operations Command overseeing coordinated operations between the military’s elite special operations units out of Fort Bragg in North Carolina. About a month after the strike he was promoted to commander of U.S. Special Operations Command. His military career spanning over three decades was mostly spent serving in the elite Navy SEALs and commanding joint operations. He was among the first special forces officers to deploy to Afghanistan after the Sept. 11 attacks. His latest promotion to admiral was approved by unanimous voice vote in the Senate earlier this year and Democratic and Republican senators praised his record. “I’m expecting Bradley to tell the truth and shed some light on what actually happened,” said Virginia Sen. Mark Warner the ranking Democrat on the Senate Intelligence Committee adding that he had “great respect for his record.” Sen. Thom Tillis a North Carolina Republican described Bradley as among those who are “rock solid” and “the most extraordinary people that have ever served in the military.” But lawmakers like Tillis have also made it clear they expect a reckoning if it is found that survivors were targeted. “Anybody in the chain of command that was responsible for it that had vision of it needs to be held accountable,” he said. What else are lawmakers seeking? The scope of the investigation is unclear but there is other documentation of the strike that could fill in what happened. Obtaining that information though will largely depend on action from Republican lawmakers — a potentially painful prospect for them if it puts them at odds with the president. Sen. Jack Reed the top Democrat on the Armed Services Committee said he and Wicker have formally requested the executive orders authorizing the operations and the complete videos from the strikes. They are also seeking the intelligence that identified the vessels as legitimate targets the rules of engagement for the attacks and any criteria used to determine who was a combatant and who was a civilian. Military officials were aware that there were survivors in the water after the initial strike but carried out the follow-on strike under the rationale that it needed to sink the vessel according to two people familiar with the matter who spoke on the condition of anonymity. What remains unclear — and what lawmakers hope to clarify in their briefing with Bradley — was who ordered the strikes and whether Hegseth was involved one of the people said. Republican lawmakers who are close to Trump have sought to defend Hegseth this week standing behind the military campaign against drug cartels that the president deems “narco-terrorists.” “I see nothing wrong with what took place,” said Sen. Markwayne Mullin an Oklahoma Republican as he argued that the Trump administration was justified in using war powers against drug cartels. More than 80 people have been killed in the series of strikes that started in September. And for critics of the campaign like Sen. Richard Blumenthal D-Conn. the pressing questions about the legality of killing survivors are a natural outgrowth of military action that was always on shaky legal ground. He said it was clear that Hegseth is responsible even if he didn’t explicitly order a second attack. “He may not have been in the room but he was in the loop,” Blumenthal said. “And it was his order that was instrumental and foreseeably resulted in the deaths of these survivors.”",
        "image":"/images/navy_admiral_capitol_2025.webp",
        "slug":"navy-admiral-attack-hearing",
        "date":"04, December 2025",
        "author":"Jenna Whitmore"
    },
   {
        "category":"politics",
        "title":"Pentagon knew boat attack left survivors but still launched a follow-on strike, AP sources say",
        "shortdescription":"AP reports that the Pentagon was aware the initial boat attack left survivors but proceeded with a follow-up strike, raising questions about military decision-making and accountability.",
        "description":"The Pentagon knew there were survivors after a September attack on an alleged drug boat in the Caribbean Sea and the U.S. military still carried out a follow-up strike according to two people familiar with the matter. The rationale for the second strike was that it was needed to sink the vessel according to the people familiar with the matter who spoke Wednesday on the condition of anonymity because they weren’t authorized to discuss it publicly. The Trump administration says all 11 people aboard were killed. What remains unclear was who ordered the strikes and whether Defense Secretary Pete Hegseth was involved one of the people said. The details are becoming crucial as lawmakers have launched investigations and are seeking to determine whether the U.S. acted lawfully during its military operations. From AP’s Standards and Stylebook teams: The AP is using anonymous sourcing to provide information for this story. Click here to hear Washington Bureau Chief Anna Johnson explain AP’s policy on the use of anonymous sources. The questions are expected to emerge Thursday during a classified congressional briefing with the commander that the Trump administration says ordered the second strike, Adm. Frank “Mitch” Bradley. The Pentagon did not respond Wednesday to a request for comment about the reported new details about the Sept. 2 attack. Hegseth is under growing scrutiny over the department’s strikes on alleged drug traffickers in the Caribbean and eastern Pacific Ocean and in particular the follow-on strike that reportedly killed survivors. Some legal experts and lawmakers say that strike would have violated peacetime laws and those governing armed conflict. Hegseth has defended the second strike as emerging in the “fog of war,” saying during a Cabinet meeting this week at the White House that he didn’t see any survivors but also “didn’t stick around” for the rest of the mission. The defense secretary has also said that Bradley, as the admiral in charge, “made the right call” in ordering the second hit, which he “had complete authority to do.” President Donald Trump was asked Wednesday whether he would release the video of the follow-on strike, as leading Democratic lawmakers have demanded. He replied: “I don’t know what they have, but whatever they have we’d certainly release. No problem,” he told reporters. The Trump administration has said the U.S. is in “armed conflict” with drug cartels, even though Congress has not approved any authorization for the use of military force in the region. A strike later in September has led to the family of a Colombian man filing a formal challenge to the premier human rights watchdog in the Americas, arguing that his death was an extrajudicial killing. The petition from the family of Alejandro Carranza says the military bombed his fishing boat on Sept. 15 in violation of human rights conventions. The follow-on strike on Sept. 2 was on the first vessel hit in what the Trump administration calls a counterdrug campaign that has grown to over 20 known strikes and more than 80 dead. The information about the follow-on strike was not presented to lawmakers during a classified briefing in September, in the days after the incident. It was disclosed later, one of the people said, and the explanation provided by the department has been broadly unsatisfactory to various members of the national security committees in Congress. In a rare flex of bipartisan oversight, the Armed Services committees in both the House and Senate swiftly announced investigations into the strikes as lawmakers of both parties raise questions. Bradley is scheduled to appear Thursday in a classified briefing with the panels’ two Republican chairmen and two ranking Democratic members.",
        "image":"/images/pentagon_building_2025.webp",
        "slug":"pentagon-boat-attack-followon-strike",
        "date":"04, December 2025",
        "author":"Claire Addison"
    },
   {
        "category":"politics",
        "title":"Supreme Court won’t immediately let Trump administration fire copyright office head",
        "shortdescription":"The Supreme Court blocked the Trump administration from immediately firing the head of the U.S. Copyright Office, pausing the move while legal challenges proceed.",
        "description":"The Supreme Court won’t immediately allow the Trump administration to fire the director of the U.S. Copyright Office, instead delaying a decision until after they rule in two other high-profile firing cases. The justices’ Wednesday order leaves in effect for now lower court rulings that held that the official, Shira Perlmutter, could not be unilaterally fired. The case is the latest that relates to Trump’s authority to install his own people at the head of federal agencies. The Supreme Court has largely allowed Trump to fire officials, even as court challenges proceed. Justice Clarence Thomas said he would have allowed Perlmutter to be fired as her lawsuit proceeds. The court majority, though, decided to wait to make a decision until after they rule in two other lawsuits over Trump firings. Arguments are set for December in the first case, over the removal of Rebecca Slaughter as a member of the Federal Trade Commission. And in January the court will hear the case of Federal Reserve governor Lisa Cook, who remains in her job despite Trump’s attempt to fire her. Rulings are expected weeks or months after the court hears arguments. Perlmutter’s case concerns an office that is within the Library of Congress. She is the register of copyrights and also advises Congress on copyright issues. Despite the ties to Congress, the register “wields executive power” in regulating copyrights, Solicitor General D. John Sauer told the court. Perlmutter claims Trump fired her in May because he disapproved of advice she gave to Congress in a report related to artificial intelligence. Perlmutter had received an email from the White House notifying her that “your position as the Register of Copyrights and Director at the U.S. Copyright Office is terminated effective immediately,” her office said. A divided appellate panel ruled that Perlmutter could keep her job while the case moves forward. Perlmutter’s attorneys have argued that she is a renowned copyright expert. She has served as register of copyrights since then-Librarian of Congress Carla Hayden appointed her to the job in October 2020. Trump appointed Deputy Attorney General Todd Blanche to replace Hayden at the Library of Congress. The White House fired Hayden amid criticism from conservatives that she was advancing a “woke” agenda.",
        "image":"/images/supreme_court_dc_2025.webp",
        "slug":"supreme-court-trump-copyright-head",
        "date":"26, November 2025",
        "author":"Claire Addison"
    },
   {
        "category":"politics",
        "title":"Supreme Court meets to weigh Trump’s birthright citizenship restrictions, blocked by lower courts",
        "shortdescription":"The Supreme Court is reviewing challenges to Trump’s proposed restrictions on birthright citizenship, which have been blocked by lower courts, with potential national implications.",
        "description":"The Supreme Court is meeting in private Friday with a key issue on its agenda — President Donald Trump’s birthright citizenship order declaring that children born to parents who are in the United States illegally or temporarily are not American citizens. The justices could say as soon as Monday whether they will hear Trump’s appeal of lower court rulings that have uniformly struck down the citizenship restrictions. They have not taken effect anywhere in the United States. If the court steps in now, the case would be argued in the spring, with a definitive ruling expected by early summer. The birthright citizenship order, which Trump signed on the first day of his second term in the White House, is part of his administration’s broad immigration crackdown. Other actions include immigration enforcement surges in several cities and the first peacetime invocation of the 18th century Alien Enemies Act. The administration is facing multiple court challenges, and the high court has sent mixed signals in emergency orders it has issued. The justices effectively stopped the use of the Alien Enemies Act to rapidly deport alleged Venezuelan gang members without court hearings, while they allowed the resumption of sweeping immigration stops in the Los Angeles area after a lower court blocked the practice of stopping people solely based on their race, language, job or location. The justices also are weighing the administration’s emergency appeal to be allowed to deploy National Guard troops in the Chicago area for immigration enforcement actions. A lower court has indefinitely prevented the deployment. Birthright citizenship is the first Trump immigration-related policy to reach the court for a final ruling. Trump’s order would upend more than 125 years of understanding that the Constitution’s 14th Amendment confers citizenship on everyone born on American soil, with narrow exceptions for the children of foreign diplomats and those born to a foreign occupying force. In a series of decisions, lower courts have struck down the executive order as unconstitutional, or likely so, even after a Supreme Court ruling in late June that limited judges’ use of nationwide injunctions. While the Supreme Court curbed the use of nationwide injunctions, it did not rule out other court orders that could have nationwide effects, including in class-action lawsuits and those brought by states. The justices did not decide at that time whether the underlying citizenship order is constitutional. But every lower court that has looked at the issue has concluded that Trump’s order violates or most likely violates the 14th Amendment, which was intended to ensure that Black people, including former slaves, had citizenship. The administration is appealing two cases. The U.S. Court of Appeals for the 9th Circuit in San Francisco ruled in July that a group of states that sued over the order needed a nationwide injunction to prevent the problems that would be caused by birthright citizenship being in effect in some states and not others. Also in July, a federal judge in New Hampshire blocked the citizenship order in a class-action lawsuit including all children who would be affected. The American Civil Liberties Union, leading the legal team in the New Hampshire case, urged the court to reject the appeal because the administration’s “arguments are so flimsy,” ACLU lawyer Cody Wofsy said. “But if the court decides to hear the case, we’re more than ready to take Trump on and win.” Birthright citizenship automatically makes anyone born in the United States an American citizen, including children born to mothers who are in the country illegally, under long-standing rules. The right was enshrined soon after the Civil War in the first sentence of the 14th Amendment. The administration has asserted that children of noncitizens are not “subject to the jurisdiction” of the United States and therefore not entitled to citizenship. “The lower court’s decisions invalidated a policy of prime importance to the president and his administration in a manner that undermines our border security,” Solicitor General D. John Sauer wrote in urging the high court’s review. “Those decisions confer, without lawful justification, the privilege of American citizenship on hundreds of thousands of unqualified people.”",
        "image":"/images/supreme_court_dc_2025_birthright.webp",
        "slug":"supreme-court-trump-birthright-citizenship",
        "date":"21, November 2025",
        "author":"Claire Addison"
    },
   {
        "category":"politics",
        "title":"Business groups ask Supreme Court to pause California climate reporting laws in emergency appeal",
        "shortdescription":"Business groups have asked the Supreme Court to temporarily halt California’s climate reporting requirements, seeking relief through an emergency appeal.",
        "description":"The U.S. Chamber of Commerce asked the Supreme Court on Friday to pause new California laws expected to require thousands of companies to report emissions and climate-risk information. The laws are the most sweeping of their kind in the nation, and a collection of business groups argued in an emergency appeal that they violate free-speech rights. The measures were signed by Democratic Gov. Gavin Newsom in 2023, and reporting requirements are expected to start early next year. Lower courts have so far refused to block the laws, which the state says will increase transparency and encourage companies to assess how they can cut their emissions. The Chamber of Commerce asked the justices to put the laws on hold while lawsuits continue to play out. One requires businesses that make more than $1 billion a year and operate in California to annually report their direct and indirect carbon emissions, beginning in 2026 and 2027, respectively. That includes planet-warming pollution from burning fossil fuels directly, as well as releases from activities such as delivering products from warehouses to stores and employee business travel. The Chamber of Commerce estimates it will affect about 5,000 companies, though state air regulators say it will apply to roughly 2,600. The other law requires companies that make more than $500 million a year to biennially disclose how climate change could hurt them financially. The state Air Resources Board estimates more than 4,100 companies will have to comply. “Without this Court’s immediate intervention, California’s unconstitutional efforts to slant public debate through compelled speech will take effect and inflict irreparable harm on thousands of companies across the country,” the companies argued. Companies that fail to publish could be subject to civil penalties. ExxonMobil also challenged the laws in a lawsuit filed last month. The state has argued that the laws don’t violate the First Amendment because commercial speech isn’t protected the same way under the Constitution. In 2023, Newsom called the emissions-disclosure law an important policy and of the state’s “bold responses to the climate crisis, turning information transparency into climate action.” The environmental group Ceres has said the information will help people decide whether to support the businesses. The U.S. Securities and Exchange Commission approved a rule last year requiring some public companies to report their greenhouse gas emissions and climate risks, but the agency paused the regulation amid litigation. The conservative-majority Supreme Court has cast a skeptical eye on some environmental regulations in recent years, including a landmark decision that limited the Environmental Protection Agency’s authority to regulate carbon dioxide emissions from power plants in 2022, and another that halted the agency’s air-pollution-fighting “good neighbor” rule.",
        "image":"/images/california_state_capitol_2025.webp",
        "slug":"supreme-court-california-climate-laws",
        "date":"16, November 2025",
        "author":"Claire Addison"
    },
   {
        "category":"politics",
        "title":"Supreme Court extends its order blocking full SNAP payments, with shutdown potentially near an end",
        "shortdescription":"The Supreme Court extended its order blocking full SNAP payments, as the federal shutdown shows signs of nearing a resolution.",
        "description":"The Supreme Court on Tuesday extended an order blocking full SNAP payments, amid signals that the government shutdown could soon end and food aid payments resume. The order keeps in place at least for a few more days a chaotic situation. People who depend on the Supplemental Nutrition Assistance Program to feed their families in some states have received their full monthly allocations, while others have received nothing. The order, which is three sentences long, comes with no explanation on the court’s thinking, and will expire just before midnight Thursday. The Senate has approved a bill to end the shutdown and the House of Representatives could vote on it as early as Wednesday. Reopening the government would restart the program that helps 42 million Americans buy groceries, but it’s not clear how quickly full payments would resume. The justices chose what is effectively the path of least resistance, anticipating the federal government shutdown will end soon while avoiding any substantive legal ruling about whether lower court orders to keep full payments flowing during the shutdown are correct. Justice Ketanji Brown Jackson was the only one of the nine justices to say she would have revived the lower court orders immediately, but didn’t otherwise explain her vote. Jackson signed the initial order temporarily freezing the payments. The court’s action doesn’t do anything to settle uncertainty across the country. Beneficiaries in some states have received their full monthly allocations while in others they have received nothing. Some states have issued partial payments. How quickly SNAP benefits could reach recipients if the government reopens would vary by state. But states and advocates say that it’s easier to make full payments quickly than partial ones. In Pennsylvania, full November benefits went out to some people on Friday. But Jim Malliard, 41, of Franklin, said he had not received anything by Monday. Malliard is a full-time caretaker for his wife, who is blind and has had several strokes this year, and his teenage daughter, who suffered severe medical complications from surgery last year. That stress has only been compounded by the pause in the $350 monthly SNAP payment he previously received for himself, his wife and daughter. He said he is down to $10 in his account and is relying on what’s left in the pantry — mostly rice and ramen. “It’s kind of been a lot of late nights, making sure I had everything down to the penny to make sure I was right,” Malliard said. “To say anxiety has been my issue for the past two weeks is putting it mildly.” The political wrangling in Washington has shocked many Americans, and some have been moved to help. “I figure that I’ve spent money on dumber stuff than trying to feed other people during a manufactured famine,” said Ashley Oxenford, a teacher who set out a “little food pantry” in her front yard this week for vulnerable neighbors in Carthage, New York. The Trump administration chose to cut off SNAP funding after October due to the shutdown. That decision sparked lawsuits and a string of swift and contradictory judicial rulings that deal with government power — and impact food access for about 1 in 8 Americans. The administration went along with two rulings on Oct. 31 by judges who said the government must provide at least partial funding for SNAP. It eventually said recipients would get up to 65% of their regular benefits. But it balked last week when one of the judges said it must fund the program fully for November, even if that means digging into funds the government said need to be maintained in case of emergencies elsewhere. The U.S. Supreme Court agreed to pause that order in a ruling late Sunday. An appeals court said Monday that full funding should resume, and that requirement was set to kick in Tuesday night before the top court extended the order blocking full SNAP payments. The U.S. Senate on Monday passed legislation to reopen the federal government with a plan that would include replenishing SNAP funds. Speaker Mike Johnson told members of the House to return to Washington to consider the deal a small group of Senate Democrats made with Republicans. President Donald Trump has not said whether he would sign it if it reaches his desk, but told reporters at the White House on Sunday that it “looks like we’re getting close to the shutdown ending.” Still, the Trump administration said in a Supreme Court filing Monday that it shouldn’t be up to the courts. “The answer to this crisis is not for federal courts to reallocate resources without lawful authority,” Solicitor General D. John Sauer said in the papers. “The only way to end this crisis — which the Executive is adamant to end — is for Congress to reopen the government.” After Tuesday’s ruling, Attorney General Pam Bondi posted on social media: “Thank you to the Court for allowing Congress to continue its swift progress.” The coalition of cities and nonprofit groups who challenged the SNAP pause said in a court filing Tuesday that the Department of Agriculture, which administers SNAP, is to blame for the confusion. “The chaos was sown by USDA’s delays and intransigence,” they said, “not by the district court’s efforts to mitigate that chaos and the harm it has inflicted on families who need food.”",
        "image":"/images/supreme_court_dc_2025_snap.webp",
        "slug":"supreme-court-snap-payments-block",
        "date":"20, November 2025",
        "author":"Jenna Whitmore"
    },
   {
        "category":"politics",
        "title":"The Latest: Bill to end government shutdown passes the Senate, heads to House next for final vote",
        "shortdescription":"The Senate approved a bill to end the government shutdown, sending it to the House for the final vote to restore federal operations",
        "description":"The longest U.S. government shutdown in history moved closer to an end Monday after a small group of Senate Democrats reached a deal with Republicans, breaking a six-week stalemate with a 60-40 vote, though the shutdown could continue for a few more days as the House returns to vote on the legislation. The bill does not resolve expiring Affordable Care Act tax credits, which Democrats had sought to extend. The shutdown has disrupted federal services, including flight operations and SNAP food aid, with the Trump administration seeking to keep SNAP payments frozen while families struggle. States like New Mexico have enacted legislation to provide state-funded food assistance amid the federal disruption. Meanwhile, clean energy groups sued the administration over cuts to projects in Democratic-leaning states, California lawmakers proposed $23 billion in bonds for scientific research in response to federal cuts, and federal courts in Manhattan closed on Fridays due to the shutdown. Trump proposed $10,000 bonuses for air traffic controllers and defended his foreign policy focus, including comments praising Syrian President Ahmad al-Sharaa as a “tough” leader, while criticizing Rep. Marjorie Taylor Greene for losing focus on domestic affordability issues.",
        "image":"/images/us_senate_chamber_2025.webp",
        "slug":"government-shutdown-bill-passes-senate",
        "date":"26, November 2025",
        "author":"Jenna Whitmore"
    },
   {
        "category":"politics",
        "title":"Trump’s not going to the Supreme Court hearing on tariffs. But his treasury secretary will be there",
        "shortdescription":"Trump will skip the Supreme Court hearing on tariffs, leaving Treasury Secretary to represent the administration and address the case.",
        "description":"President Donald Trump will not attend Wednesday’s Supreme Court hearing on the legality of tariffs central to his economic and foreign policy, but Treasury Secretary Scott Bessent said he will be present to “have a ringside seat” and emphasize the administration’s view of the matter as an “economic emergency.” Trump, who had expressed a desire to attend, decided against appearing in person, calling it potentially distracting and saying, “It’s not about me, it’s about our country.” The court will hear arguments on whether Trump overstepped federal law under the International Emergency Economic Powers Act (IEEPA) in imposing sweeping import taxes. Lower courts earlier ruled that the president lacked such authority but left the tariffs in place pending the Supreme Court’s decision. Bessent stressed that, regardless of the outcome, the administration has alternative authorities and existing trade deals to maintain economic stability.",
        "image":"/images/supreme_court_dc_2025_tariffs.webp",
        "slug":"trump-skips-supreme-court-tariffs",
        "date":"16, November 2025",
        "author":"Travis Monroe"
    },
   {
        "category":"politics",
        "title":"Nvidia CEO Jensen Huang visits Republicans as debate over intensifying AI race rages",
        "shortdescription":"Nvidia CEO Jensen Huang met with Republican leaders amid growing debates over the intensifying AI race and its implications for technology policy.",
        "description":"Nvidia CEO Jensen Huang met separately with President Donald Trump and Republican senators Wednesday as tech executives work to secure favorable federal policies for the artificial intelligence industry, including the limited sale of Nvidia’s highly valued computer chips to U.S. rivals like China. Huang’s closed-door meeting with Republicans on the Senate Banking Committee came at a moment of intensifying lobbying, soaring investments and audacious forecasts by major tech companies about AI’s potential transformative effects. Huang is among the Silicon Valley executives who warn that any restrictions on the technology will halt its advancement despite mounting concerns among policymakers and the public about AI’s potential pitfalls or the ways foreign rivals like China may use American hardware. “I’ve said repeatedly that we support export control, that we should ensure that American companies have the best and the most and first,” Huang told reporters before his meeting on Capitol Hill. He added that he shared concerns about selling AI chips to China but believed that restrictions haven’t slowed Chinese advancement in the AI race. “We need to be able to compete around the world. The one thing we can’t do is we can’t degrade the chips that we sell to China. They won’t accept that. There’s a reason why they wouldn’t accept that, and so we should offer the most competitive chips we can to the Chinese market,” Huang said. Huang also said he’d met with Trump earlier Wednesday and discussed export controls for Nvidia’s chips. Huang added that he wished the president “a happy holidays.” The Trump administration in May reversed Biden-era restrictions that had prevented Nvidia and other chipmakers from exporting their chips to a wide range of countries. The White House in August also announced an unusual deal that would allow Nvidia and another U.S. chipmaker, Advanced Micro Devices, to sell their chips in the Chinese market but would require the U.S. government to take a 15% cut of the sales. The deal divided lawmakers on Capitol Hill, where there is broad support for controls on AI exports. Members of Congress have generally considered the sale of high-end AI chips to China to be a national security risk. China is the main competitor to the U.S. in the race to develop artificial superintelligence. Lawmakers have also proposed a flurry of bills this year to regulate AI’s impact on dozens of industries, though none have become law. Most Republican senators who attended the meeting with Huang declined to discuss their conversations. But a handful described the meeting as positive and productive. “For me, this is a very healthy discussion to have,” said Sen. Mike Rounds, a South Dakota Republican. Rounds said lawmakers had a “general discussion” with Huang about the state of AI and said senators were still open to a wide range of policies. Asked whether he believed Nvidia’s interests and goals were fully aligned with U.S. national security, Rounds replied: “They currently do not sell chips in China. And they understand that they’re an American company. They want to be able to compete around the rest of the world. They’d love to some time be able to compete in China again, but they recognize that export controls are important as well for our own national security.” Other Republicans were more skeptical of Huang’s message. Sen. John Kennedy, a Louisiana Republican who sits on the upper chamber’s Banking Committee, said he skipped the meeting entirely. “I don’t consider him to be an objective, credible source about whether we should be selling chips to China,” Kennedy told reporters. “He’s got more money than the Father, the Son and the Holy Ghost, and he wants even more. I don’t blame you for that, but if I’m looking for someone to give me objective advice about whether we should make our technology available to China, he’s not it.” Some Democrats, shut out from the meeting altogether, expressed frustration at Huang’s presence on Capitol Hill. “Evidently, he wants to go lobby Republicans in secret rather than explain himself,” said Massachusetts Sen. Elizabeth Warren, the top Democrat on the Senate Banking Committee. Warren added that she wanted Huang to testify in a public congressional hearing and answer “questions about why his company wants to favor Chinese manufacturers over American companies that need access to those high-quality chips.”",
        "image":"/images/jensen_huang_nvidia_2025.webp",
        "slug":"nvidia-ceo-huang-ai-republicans",
        "date":"04, December 2025",
        "author":"Evan Carlisle"
    },
   {
        "category":"politics",
        "title":"Pete Hegseth faces deepening scrutiny from Congress over boat strikes",
        "shortdescription":"Pete Hegseth is under increasing Congressional scrutiny regarding his role in decisions tied to recent deadly boat strikes, as lawmakers seek accountability.",
        "description":"WASHINGTON  — Pete Hegseth barely squeaked through a grueling Senate confirmation process to become secretary of defense earlier this year, facing lawmakers wary of the Fox News Channel host and skeptical of his capacity, temperament and fitness for the job. Just three months later, he quickly became embroiled in Signalgate as he and other top U.S. officials used the popular Signal messaging application to discuss pending military strikes in Yemen. A Pentagon inspector general’s report delivered to lawmakers Wednesday found his actions posed a risk to personnel and mission. And now, in what may be his most career-defining moment yet, Hegseth is confronting questions about the use of military force and demands he release the videotapes after a special operations team reportedly attacked survivors of a strike on an alleged drug boat off the coast of Venezuela. Some lawmakers and legal experts say the second strike would have violated the laws of armed conflict. “These are serious charges, and that’s the reason we’re going to have special oversight,” said Sen. Roger Wicker of Mississippi, the Republican chair of the Senate Armed Services Committee. The scrutiny surrounding Hegseth’s brash leadership style is surfacing what has been long-building discontent in Congress over President Donald Trump’s choice to helm the U.S. military, and it’s posing a potentially existential moment for Hegseth as the congressional committees overseeing the military launch an investigation amid mounting calls from Democratic senators for his resignation. Since working to become defense secretary, Hegseth has vowed to bring a “warrior culture” to the U.S. government’s most powerful and expensive department, from rebranding it as the Department of War to essentially discarding the rules that govern how soldiers conduct themselves when lives are on the line. Hegseth on Tuesday cited the “fog of war” in defending the follow-up strike, saying that there were explosions and fire and that he did not see survivors in the water when the second strike was ordered and launched. He chided those second-guessing his actions as being part of the problem. Yet the approach to the operation was in line with the direction of the military under Hegseth, a former infantry officer with the Army National Guard, part of the post-Sept. 11 generation, who was deployed to Iraq and Afghanistan and earned Bronze Stars. During a speech in September, he told an unusual gathering of top military brass whom he had summoned from all corners of the globe to the Quantico Marine Corps Base in Virginia that they should not “fight with stupid rules of engagement.” “We untie the hands of our warfighters to intimidate, demoralize, hunt and kill the enemies of our country,” he said. “No more politically correct and overbearing rules of engagement, just common sense, maximum lethality and authority for warfighters.” But now lawmakers and military and legal experts say the Sept. 2 attack borders on illegal military action. “Somebody made a horrible decision. Somebody needs to be held accountable,” said Sen. Thom Tillis, a North Carolina Republican who in January held out support for Hegseth until only moments before casting a crucial vote for his confirmation. “Secretary Talk Show Host may have been experiencing the ‘fog of war,’ but that doesn’t change the fact that this was an extrajudicial killing amounting to murder or a war crime,” said Sen. Chris Van Hollen, D-Md. “He must resign.” Rep. Don Bacon, a Republican who served 30 years active duty in the Air Force, finishing his career at the rank of brigadier general, said he hasn’t been a fan of Hegseth’s leadership. “I don’t think he was up to the task,” Bacon said. Trump, a Republican, has largely stood by his defense secretary, among the most important Cabinet-level positions, but the decisions by Wicker, alongside House Armed Services Chair Mike Rogers of Alabama and the top Democrats on the committees, to open investigations provide a rare moment of Congress asserting itself and its authority to conduct oversight of the Trump administration. Senate Majority Leader John Thune, R-S.D., who shepherded the defense secretary’s nomination to confirmation, has said the boat strikes are within Trump’s authority as commander in chief — and he noted that Hegseth serves at the pleasure of the president. “I don’t have, at this point, an evaluation of the secretary,” Thune said at the start of the week. “Others can make those evaluations.” But Hegseth also has strong allies on Capitol Hill, and it remains unclear how much Republicans would actually be willing to push back on the president, especially when they have spent the first year in his administration yielding to his various demands. Vice President JD Vance, who cast a rare tiebreaking vote to confirm Hegseth, has vigorously defended him in the attack. And Sen. Eric Schmitt, another close ally to Trump, dismissed criticism of Hegseth as “nonsense” and part of an effort to undermine Trump’s focus on Central and South America. “He’s not part of the Washington elite,” said Schmitt, R-Mo. “He’s not a think tanker that people thought Trump was going to pick. ... And so, for that reason and others, they just, they don’t like him.” Tension between some Republican lawmakers and the Pentagon has been rising for months. Capitol Hill has been angered by recent moves to restrict how defense officials communicate with lawmakers and the slow pace of information on Trump’s campaign to destroy boats carrying drugs off the coast of Venezuela. As he defends his job, Hegseth has spoken to both Wicker and Rogers, the top lawmakers overseeing the military. Rogers said he was “satisfied” with Hegseth after that conversation, while Wicker said that he told Hegseth that he would like him to testify to Congress. Hegseth at first tried to brush aside the initial report about the strike by posting a photo of the cartoon character Franklin the Turtle firing on a boat from a helicopter, but that only inflamed criticism of him and angered lawmakers who felt he was not taking the allegations seriously. Senate Democratic leader Chuck Schumer of New York called Hegseth a “national embarrassment,” adding the defense secretary’s social media post of the cartoon turtle is “something no serious leader would ever think of doing.” Schumer repeated his insistence Wednesday that Hegseth “release the full, unedited tapes” of what happened. Later this week, the chairs of the armed services committees, along with the top Democrats on the committees, will hear private testimony from Navy Vice Adm. Frank “Mitch” Bradley, who the White House has said ordered the second strike on the survivors. Republicans have been careful to withhold judgment on the strike until they complete their investigation, but Democrats say that these problems with Hegseth were a long time coming. Sen. Tim Kaine, a Virginia Democrat, pointed back to Hegseth’s tumultuous confirmation hearing, at which issues were raised with his management of nonprofits, as well as allegations of a sexual assault and abuse, and drinking on the job. Hegseth had vowed not to consume alcohol if confirmed. “You don’t suddenly change your judgment level or change your character when you get confirmed to be secretary of defense,” Kaine said. “Instead, the things that have been part of your character just become much more dire and existential.”",
        "image":"/images/pete_hegseth_capitol_2025.webp",
        "slug":"pete-hegseth-congress-boat-strikes",
        "date":"04, December 2025",
        "author":"Evan Carlisle"
    },
   {
        "category":"politics",
        "title":"Progressive group targets Senate Democrats for backing Trump’s judicial nominees",
        "shortdescription":"A progressive organization is pressuring Senate Democrats for supporting Trump’s judicial nominees, criticizing the party for enabling conservative appointments.",
        "description":"A progressive group is targeting two Senate Democrats and an independent senator who voted to confirm some of President Donald Trump’s judicial nominees, promising to spend more than $1 million in hopes of pushing congressional Democrats to take a stronger stand against the Republican president. In a weeklong advertising campaign that began on Wednesday, Demand Justice is targeting only senators who aren’t up for reelection next year: Democrats John Fetterman of Pennsylvania and Maggie Hassan of New Hampshire, along with independent Angus King of Maine, who caucuses with Democrats. But the group’s president, Josh Orton, said the blitz is only an opening salvo. He threatened an escalation targeting more imminently vulnerable lawmakers and those with presidential ambitions unless they “find their moral compass, and stand up to Trump.” “We want to change Senate Democratic behavior so that they begin acting in a more moral way and in a more politically expedient way,” Orton said. The push comes after eight members of the Senate Democratic caucus — including Fetterman, Hassan and King — joined with Republicans to end a government shutdown, a move that angered large swaths of the party’s base. The party is wrestling over the best strategy to fight what many Democrats see as Trump’s authoritarian ambitions while plotting to bounce back from major losses in 2024. In confirmation hearings, Trump’s second-term judicial nominees have avoided acknowledging that he lost the 2020 campaign or that the Jan. 6, 2021, attack on the U.S. Capitol was a violent insurrection. Democrats shouldn’t give bipartisan cover to judges who are not “able to answer these simple questions of fact,” Orton said. Trump’s nominees have also angered many on the left for their views on abortion. A review by The Associated Press found that roughly half of them have revealed anti-abortion views, been associated with anti-abortion groups or defended abortion restrictions. The Democratic base is clamoring for its representatives to aggressively challenge Trump, who has pushed the boundaries of presidential power to new heights since returning to the White House in January. Democratic leaders, meanwhile, are grappling with the limits of their power in Washington, where Republicans control both chambers of Congress and the White House. Fetterman is a frequent target of the left over his staunch support for Israel in the Gaza war and his willingness to buck the majority of his party. He defended his voting record last month, telling CBS News he’s voted overwhelmingly with the rest of the Democrats. “If Democrats have a problem with somebody that votes 91% of the same times as you are — more than nine out of 10 times — then maybe our party has a bigger problem,” Fetterman said. Hassan said she voted to reopen the government, despite the backlash on the left, because many of her constituents were suffering and it was unlikely Republicans would agree to a better deal. She said she supported some of Trump’s executive branch nominees “who are qualified or acting in good faith.” King was the lone member of the Democratic Caucus to vote to confirm a federal judge in Missouri who, as a lawyer, had worked on cases challenging abortion rights. He later said the vote was “a mistake.”",
        "image":"/images/senate_chamber_dc_2025.webp",
        "slug":"progressive-group-targets-senate-democrats",
        "date":"04, December 2025",
        "author":"Evan Carlisle"
    },
   {
        "category":"politics",
        "title":"Doodling, drowsiness and a conspicuous misspelling highlight Trump’s last Cabinet meeting of 2025",
        "shortdescription":"Trump’s final Cabinet meeting of 2025 drew attention for doodling, drowsiness, and a notable misspelling, raising eyebrows over the session’s conduct.",
        "description":"WASHINGTON  — With Tuesday’s White House Cabinet meeting chugging past the two-hour mark, President Donald Trump’s eyes fluttered and closed, while his budget director busied himself doodling a fluffy cloud, and Defense Secretary Pete Hegseth was lucky enough to speak early despite the title on his nameplate being misspelled. The sleepy and occasionally slipshod gathering nonetheless ended with a flurry of news, as Trump declared he didn’t want Somalis in the U.S., and Hegseth cited the “fog of war” in defending a follow-up strike on an alleged drug-carrying boat in the Caribbean Sea in September. The president noted that it was the last time his Cabinet would gather until 2026, and though marathon sessions with top advisers lavishing praise have become a Trump trademark since his return to the White House, this latest installment felt at times like a holiday break was needed. Trump offered lengthy opening comments largely rehashing his key previous policy announcements from recent months and repeated old grievances, including false claims about winning the 2020 election. He then gave each Cabinet member a chance to speak, declaring, “We’re gonna go quickly,” which did little to stop most from offering long presentations. Hegseth went first, praising the administration’s move to rename his agency the Department of War — something that can’t be officially done without an act of Congress — while his nameplate labeled him the “ssecretary of war,” a mistake that became a source of online ridicule. As each official spoke, a TV camera trained on Trump showed him struggling to stay alert, occasionally drooping or closing his eyes. Trump’s apparent sleepiness followed his criticism of a New York Times story examining his schedule and stamina at age 79, which he again slammed, assuring attendees that “Trump is sharp.” Budget director Russell Vought was seen sketching mountains framed by pine trees topped with fluffy clouds reminiscent of Bob Ross’s landscape paintings, adding an arrow underneath whose purpose was unclear. Some Cabinet members also defied the president on affordability messaging: Agriculture Secretary Brooke Rollins discussed pressures on farmers, Treasury Secretary Scott Bessent called affordability a “crisis,” and Housing Secretary Scott Turner highlighted efforts to help first-time homebuyers. The final speaker, Secretary of State Marco Rubio, acknowledged, “I know I’m last, so I wanted to be fast. But there’s a lot to cover.” The meeting lasted over two hours, shorter than Trump’s previous record of three hours and 17 minutes in August, though the president noted, “We’re spending a lot of time in here.” Trump wrapped up by jokingly inviting reporters to ask questions and playfully acknowledging a journalist holding a boom mic for two hours. In the Q&A, Hegseth said he did not see survivors in the water during the September boat strike off Venezuela, citing the “fog of war” and adding he “didn’t stick around” for the remainder of the mission. Trump later declared he didn’t want Somali immigrants in the U.S., suggesting residents should stay in their homeland and criticizing them for being reliant on U.S. aid while contributing little, which drew applause from his Cabinet. The meeting concluded with Trump slapping his hand twice on the table, pushing back his chair, standing up, and thumping Hegseth on the shoulder.",
        "image":"/images/trump_cabinet_meeting_2025.webp",
        "slug":"trump-last-cabinet-meeting-2025",
        "date":"03, December 2025",
        "author":"Evan Carlisle"
    },
   {
        "category":"politics",
        "title":"Turkey’s energy minister warns of threat to oil and gas supplies after tankers targeted",
        "shortdescription":"Turkey’s energy minister warned that recent attacks on tankers pose a serious threat to the country’s oil and gas supplies, highlighting regional energy security risks.",
        "description":"Turkey’s energy minister, Alparslan Bayraktar, called for the protection of oil and gas supplies in the Black Sea after three Russian tankers were targeted off the Turkish coast, expressing concern not only for shipping but also for two undersea pipelines, Blue Stream and Turk Stream, that transport natural gas from Russia to Turkey. He referenced the 2022 sabotage of the Nord Stream pipeline between Russia and Germany, highlighting Turkey’s dependence on imported gas, and urged all parties to keep energy infrastructure out of conflict, emphasizing the importance of uninterrupted energy flows in the Black Sea and the Bosphorus and Dardanelles straits. Ukraine claimed its naval drones struck two tankers on Nov. 28, with a third hit Tuesday near the Turkish port of Sinop, and President Recep Tayyip Erdogan condemned the attacks as threats to navigational safety, human life, and the environment within Turkey’s exclusive zone. Russian oil and gas account for nearly half of Turkey’s energy needs, and the NATO member has faced pressure from Washington to reduce reliance on Moscow. During Erdogan’s visit to Donald Trump in September, the U.S. president encouraged Turkey to ease ties with Russia, including in energy, while Turkish companies signed a multibillion-dollar deal to buy U.S. liquefied natural gas. Defending Turkey’s reliance on Russian supplies, Bayraktar said Russia has been “a very reliable supply to the Turkish market” since Turkish households began switching to gas in the 1980s, but acknowledged the need for a balanced supply portfolio and efforts to diversify sources for competitive pricing. He noted that Turkey’s state-owned BOTAS finalized a gas supply contract with Russia’s Gazprom and that Turkey is also collaborating with Russia on nuclear energy, with Rosatom building the Akkuyu nuclear power plant on the Mediterranean coast, expected to generate around 10% of Turkey’s electricity when operational. The project has faced delays due to sanctions on Russian entities following the 2022 invasion of Ukraine, and while some components were sourced from China to circumvent Western restrictions, financing challenges remain, including $2 billion “stuck in JP Morgan” due to frozen Russian assets, which Bayraktar said Turkey must help release to support project completion, with the first electricity from Akkuyu expected next year.",
        "image":"/images/turkey_energy_ministry_2025.webp",
        "slug":"turkey-energy-minister-oil-gas-threat",
        "date":"04, December 2025",
        "author":"Sophie Langford"
    },
   {
        "category":"politics",
        "title":"NY attorney general challenges authority of acting US attorney investigating her Trump lawsuits",
        "shortdescription":"New York’s attorney general is contesting the authority of the acting U.S. attorney probing her lawsuits against Trump, questioning the legitimacy of the investigation.",
        "description":"President Donald Trump’s effort to install political loyalists as top federal prosecutors has encountered legal challenges, with judges ruling that his handpicked U.S. attorneys in New Jersey, eastern Virginia, Nevada, and Los Angeles were serving unlawfully. Now, a federal judge is set to consider New York Attorney General Letitia James’ argument that the administration similarly circumvented the law to appoint John Sarcone as acting U.S. attorney for northern New York, with a court hearing scheduled for Thursday. James, a Democrat, is challenging Sarcone’s authority to oversee a Justice Department investigation into regulatory lawsuits she filed against Trump and the National Rifle Association, disputing the legitimacy of subpoenas issued as part of Sarcone’s probe and claiming his appointment renders any legal actions unlawful. Justice Department lawyers counter that Sarcone was properly appointed and that the subpoenas should stand. The dispute reflects broader questions over the legality of unconventional strategies used by the Trump administration to appoint prosecutors unlikely to be confirmed by the Senate. The New York hearing comes a week after a federal judge in Virginia dismissed indictments against James and former FBI Director James Comey, concluding that interim U.S. attorney Lindsey Halligan had been unlawfully appointed. Additionally, a federal appeals court recently disqualified Trump’s former lawyer Alina Habba from serving as New Jersey’s top federal prosecutor. Under federal law, presidential nominees for U.S. attorney require Senate confirmation, while interim appointments by the attorney general expire after 120 days unless extended by judges; Sarcone’s appointment bypassed this process. Trump has not nominated anyone for the Northern District of New York, and when Sarcone’s 120-day term expired, judges declined to retain him. Attorney General Pam Bondi then appointed him as a special attorney and designated him first assistant U.S. attorney, allowing him to serve as acting U.S. attorney, a move James’ lawyers contend circumvents federal law. The subpoenas in New York seek records related to civil cases James filed against Trump over alleged business fraud and against the NRA and two of its executives. Justice Department lawyers argue the attorney general has authority to appoint and delegate to attorneys within her department, and that Sarcone can conduct grand jury investigations even if not formally acting as U.S. attorney. Sarcone previously worked on Trump’s 2016 campaign and for the U.S. General Services Administration during Trump’s first term. Similar disputes occurred in New Jersey, Nevada, and Los Angeles, where courts disqualified Trump appointees for exceeding legal term limits or being improperly installed, reflecting ongoing conflicts over the administration’s attempts to place loyalists in key federal prosecutorial roles.",
        "image":"/images/ny_attorney_general_office_2025.webp",
        "slug":"ny-ag-challenges-us-attorney",
        "date":"03, December 2025",
        "author":"Sophie Langford"
    },
   {
        "category":"politics",
        "title":"As NYC prepares for Mamdani, departing Mayor Eric Adams wanders the globe",
        "shortdescription":"As New York City gears up for Mamdani, outgoing Mayor Eric Adams is traveling internationally, marking the end of his term with global engagements.",
        "description":"For Eric Adams, one unwritten perk of being mayor of New York City has been the chance to live out his boyhood “dream of traveling the globe.” He would hold onto that wanderlust through his federal indictment — focused, in part, on allegations that he accepted improper travel benefits from foreign nationals — and a losing reelection campaign hampered by the scandal. Now in the final month of his tenure, Adams is embracing his travel bug. In recent weeks, the lame-duck Democrat has embarked on trips to Albania, Israel, and Uzbekistan, drawing allegations of mayoral senioritis from some critics. He set off again Wednesday, flying to New Orleans to accept an award from the Combat Antisemitism Movement, the same group that honored him at a gala in Tel Aviv less than two weeks ago, which the mayor also attended. A spokesperson for Adams declined to share the cost of the trips, largely covered by city taxpayers, which typically include hotel and flight accommodations for Adams, as well as his security and aides. “On these official trips, Mayor Adams has been able to discuss bringing more innovation and jobs to the five boroughs, met with other governmental leaders from around the nation and across the globe, visited religious sites of different faiths, and more,” said Fabien Levy, a deputy mayor for communications, who joined the mayor on his trip to Israel and was with him Wednesday in New Orleans. Adams’ critics, meanwhile, accuse him of dodging government responsibilities while abusing publicly funded travel opportunities as he hunts for his next job. “He’s chosen to lean into the notion the people have that the city is kind of secondary to what’s best for him at any moment in time,” said New York City Public Advocate Jumaane Williams, adding that it’s been “hard to watch.” Adams has not denied that he is considering job offers overseas, cryptically telling reporters in October that “many people want me to do things in other countries.” A self-described “global leader,” Adams has long been unapologetic about his desire to see the world beyond New York. Before becoming mayor, he used his perch as Brooklyn’s borough president to execute “sister city” agreements in several countries, allowing him to make official visits to China, Senegal, and Turkey. In his first few years at City Hall, he headlined an event on antisemitism in Greece, attended the World Cup in Qatar, and traveled through Mexico, Ecuador, and Colombia urging migrants not to cross the border. Even while in New York, Adams could often be found raising the flag of another country or telling foreign leaders that he planned to grow old in their cities, among his stated retirement destinations being Baku, the capital of Azerbaijan, and the Israeli-annexed Golan Heights. It was his frequent travels to Turkey that drew the attention of federal authorities. In an indictment unveiled last year, prosecutors said Adams had accepted free or steeply discounted flights from Turkish officials seeking to buy his influence. Adams denied wrongdoing and the charges were ultimately dropped at President Donald Trump’s urging, but the scandal cratered his approval ratings and, he claimed, prevented him from competing in the Democratic primary. In early October, shortly after abandoning his ailing general election campaign, Adams embarked on a four-day trip to Albania to meet with Prime Minister Edi Rama and members of his cabinet, along with local business leaders; Adams has some connection to the country, as his son lived there while competing in Albania’s version of “American Idol.” A few weeks later, after Zohran Mamdani was elected, Adams’ office announced a trip to Israel. A common visit for all of the city’s recent mayors, the timing was interpreted by some as a jab at Mamdani, who has criticized Israel and sidestepped questions about whether he would visit. Over four days, Adams visited the Western Wall and met with President Isaac Herzog and Prime Minister Benjamin Netanyahu. Then, on his final day in Israel, Adams’ office said he would not immediately return to New York but would instead fly to Uzbekistan for five days to meet with leaders there to discuss ways to bring “innovation, businesses, and jobs to the five boroughs.” At times, the trip offered a remarkable split screen: That Friday, as Mamdani and Trump addressed the cameras for the first time, Adams shared a photo of himself meeting with more than a dozen members of Uzbekistan’s “Agency for Plant Quarantine and Protection.”",
        "image":"/images/eric_adams_nyc_2025.webp",
        "slug":"nyc-adams-prepares-mamdani",
        "date":"04, December 2025",
        "author":"Travis Monroe"
    }
]