[
    {
        "category": "sports",
        "title": "Lions and Cowboys need a win in Thursday night matchup to improve position in NFL playoff picture",
        "slug": "lions-cowboys-thursday-night-nfl-playoff-push",
        "shortdescription": "The Detroit Lions and Dallas Cowboys face off Thursday night, both needing a win to boost their standings in the NFL playoff race and strengthen their postseason chances.",
        "description": "The Detroit Lions and Dallas Cowboys are the top two teams in the hunt for an NFC wild card and are still holding on to hopes of competing for division championships. Detroit (7-5) hosts Dallas (6-5-1) on Thursday night and the winner will improve its position in the playoff picture while the loser may not have time to recover from the setback over the last month of the regular season. “Our margin for error is very small right now,” Lions coach Dan Campbell said. “We’ve got to find a way to win this next one in front of us. “Time’s running out.” After starting 5-2, the two-time defending NFC North champions have lost three of five to fall behind division-leading Chicago (9-3) and second-place Green Bay (8-3-1). The Cowboys, meanwhile, are surging into postseason contention behind a revitalized defense. They’re over .500 for the first time this year thanks to three straight victories — including one over Philadelphia — to potentially challenge the NFC East-leading Eagles (8-3) for the division title. Dallas quarterback Dak Prescott acknowledged he looked up the NFC playoff picture this week after he saw the AFC rundown on TV. “We just win and handle our business, we’ll put ourselves in a great spot,” Prescott said. Call it a comeback Lions edge rusher Aidan Hutchinson broke his left leg in two places in last year’s 47-9 early-season win at Dallas, ending his season. Hutchinson has 8 1/2 sacks, a career-high four forced fumbles and 24 quarterback hits this season. “Knowing how good of a player he is, we’ll have eyes on him and as many hands as we can,” Prescott said. While Hutchinson has had an impact in most games, he did not have a sack or a QB hit in last week’s loss to Green Bay. Testing a trend Detroit has played 56 regular-season games over three-plus years without losing two in a row. If the Lions win on Thursday night, the streak without consecutive setbacks will be the league’s longest since New England’s 57-game run that ended in 2006, according to Sportradar. Rubber match The Cowboys and Lions are playing for the third straight year after splitting the last two memorable matchups in Dallas. Detroit ended a six-game losing streak against Dallas with a 47-9 victory at AT&T Stadium last season. It was the most lopsided loss under owner Jerry Jones, who bought the Cowboys in 1989. Two years ago, Detroit lost at Dallas 20-19 after a 2-point conversion pass to offensive lineman Taylor Decker was negated because the officials said offensive lineman Dan Skipper reported as eligible and Decker did not. Each time Skipper has reported as eligible at home games since then, the crowd has roared for a player who has become an unlikely fan favorite. “He’s reliable, dependable, and he does a lot of jobs for us,” Campbell said. Potential shootout Dallas has the NFL’s top-ranked offense, averaging 393 yards a game, and ranks second with 29.3 points per game. Detroit averages 376 yards of offense, ranking third, and 29.2 points to tie for third in the league. The game will feature teams averaging at least 375 yards and 29 points for just the fifth time since 1970. Still no Diggs Dallas’ secondary has enjoyed the return of several injured players, most notably starting safeties Malik Hooker and Donovan Wilson. But the Cowboys will have to wait at least another week to see 2021 All-Pro cornerback Trevon Diggs back on the field. Diggs was ruled out for the seventh consecutive game with a concussion and issues with both knees, including a left knee that has been surgically repaired twice in the past two years. He was initially sidelined by the concussion, which he suffered in an accident at home. The former Alabama player has never come close to matching his league-leading 11 interceptions in 2021, and he’s had a tumultuous year that included a workout bonus in his contract being withheld and a brief benching by first-year coach Brian Schottenheimer. “I know who I am,” Diggs told reporters this week, declining to go into detail on the circumstances of the concussion. “I know what I can do on the field, and I’m going to put that out there and show if they forgot, I’m going to make sure to remind them.”",
        "image": "/images/lions_cowboys_nfl_2025.webp",
        "date": "04, December 2025",
        "author": "Marcus Bennett"
    },
    {
        "category": "sports",
        "title": "NASCAR owner Bob Jenkins ‘hurt’ by ‘take-it-or-leave-it’ charter offer made with hours to sign",
        "shortdescription": "NASCAR team owner Bob Jenkins expressed frustration after receiving a “take-it-or-leave-it” charter offer with only hours to decide, calling the process hurtful and rushed.",
        "description": "Front Row Motorsports owner Bob Jenkins testified Wednesday in the federal antitrust case against NASCAR that he was “honestly very hurt” by a “take-it-or-leave-it” offer on a new charter agreement that came with a deadline of mere hours to sign the 112-page document. Front Row, alongside 23XI Motorsports, is suing NASCAR over antitrust claims for the charter agreement that was presented on the eve of the 2024 playoffs and went into effect this year. He said he was out to dinner with his parents and had no cell signal when the charter offer came in. When he finally got phone service, he had dozens of missed calls and texts about the charter agreement and reached out to several rival owners. “There was a lot of passion, a lot of emotion, especially from Joe Gibbs, he felt like he had to sign it,” Jenkins testified. “Joe Gibbs felt like he let me down by signing. Not a single owner said, ‘I was happy to sign it.’ Not a single one.” Jenkins said the charter agreements arrived at 6 p.m. on a Friday with a midnight deadline to sign them. He felt the timing was deliberate as “no attorney on the East Coast was available to read a 112-page document.” He claimed NASCAR “knew we had to blindly sign it. Some of these owners have $500-$600 million facilities, long-term sponsors. They couldn’t walk away from that.” Jenkins asked for and received an extension on signing but testified NASCAR Commissioner Steve Phelps made clear it was for review purposes only and told Jenkins, “negotiations are concluded. We are not re-opening the document.” Jenkins, a fast-food franchise owner, plans to hand Front Row Motorsports down to his four sons so he testified he spoke to the two eldest about the charter offer. He explained that 13 of 15 organizations had signed — Jenkins said he felt NASCAR believed he would cave to the pressure of the other teams having already committed — but that he really did not believe the charter offer was a good deal and did not want to sign. When they agreed with him, he joined Basketball Hall of Famer Michael Jordan and three-time Daytona 500 winner Denny Hamlin, the owners of 23XI, in suing NASCAR. Front Row was one of the teams that received original charter agreements in 2016 when the system was created. He didn’t love the deal then but felt it was a step in the right direction in bolstering the health of the top stock car racing series in the United States. He felt the 2025 agreement went “virtually backward in so many ways. “It was insulting, it went so far backward. NASCAR wanted to run the governance with an iron fist, it was like taxation without representation,” he testified. “NASCAR has the right to do whatever it wants.” Front Row and 23XI have accused NASCAR of being a monopolistic bully in violation of federal antitrust laws in this landmark antitrust case that could rewrite the framework of the sport. The teams contend NASCAR is a monopoly that has handcuffed them with a no-win revenue model. The charter agreement that took effect this year ended more than two years of bitter negotiations in which neither side budged. The deal fell short of the requests made by all 15 teams, but 13 teams still signed under the belief they’d lose their protected status as a charter — which guarantees both entry into every race and a defined share of the purse. Jenkins has never turned a profit since launching his NASCAR team in the early 2000’s and estimates he’s lost $100 million even while winning the Daytona 500 in 2021. But he said he grew up a NASCAR fan, was a charter member of the Dale Earnhardt fan club beginning with Earnhardt’s rookie season and lived out a dream in becoming a team owner. He testified he’s fighting for NASCAR to be healthy and stable — for the Florida-based France family that owns it and all the participants. “This is not about bashing the France family,” Jenkins testified. “They’ve made a lot of great decisions. This charter is not one of them.” He said his fellow owners agree. “100% of the owners think the charter system is good,” Jenkins said. “The charter agreement is not.” NASCAR executive takes stand over alleged illegal monopoly abuses Scott Prime, NASCAR executive vice president in charge of strategy, testified for a second day to his role in shaping the Cup Series’ charter system when he worked outside the series for a consulting firm. Prime compiled a 2014 report for the McKinsey firm that stated concerns over the longevity of the sport if NASCAR didn’t act to improve the health of their race teams. One of the suggestions was issuing taxi-like “medallions,” which was the genesis for the charter system. Jeffrey Kessler, attorney for 23XI and Front Row, said even with charters, NASCAR teams remain stuck in a weakened negotiating state and with unfavorable terms because there are no other legitimate stock car series options. “You’re a monopoly,” Kessler told Prime. “There’s no place else to compete. There was no place else for them to go, correct?” “NASCAR is the premier stock car racing series today, yes,” Prime said. Prime said NASCAR became concerned about the threat of a breakaway stock car series during 2024 charter negotiations. He said at the time NASCAR considered several options that included offering charters to team owners on a “first come, first served” basis and as drastic an option as taking cars in-house for the France family to run and essentially eliminating race teams. “Only a monopolist has the power to say, ‘Take my offer and if you don’t take it, you will no longer be in this business, and someone else will take your place,’” Kessler said. NASCAR would present the take-it-or-leave it offer that left Jenkins hurt. How it got here The trial is expected to last two weeks. NASCAR is owned and operated by the France family, which founded the series in 1948. Kessler told the jury Monday that over a three-year period almost $400 million was paid to the France Family Trust and a 2023 evaluation by Goldman Sachs found NASCAR to be worth $5 billion. The pretrial discovery process revealed NASCAR made more than $100 million in 2024. NASCAR contends it is doing nothing wrong and has not restrained trade or commerce by its teams. The series says the original charters were given for free to teams when the system was created in 2016 and the demand for them created a market of $1.5 billion in equity for chartered organizations. The new charter agreement upped the guaranteed money for every chartered car to $12.5 million in annual revenue, from $9 million. But Hamlin and Jenkins have both testified it costs $20 million to bring a single car to the track for all 38 races and that figure does not include any overhead, operating costs or a driver’s salary. Both testified they don’t have the ability to slash costs and teams are too reliant on outside sponsorship to survive. “It’s offensive to say I’ve overspent. We have a model that works for us,” Jenkins testified. “I have never turned a profit. And it’s not from malpractice. The level we compete at is just so expensive.” Prime testified as much and noted in his consulting role he discovered in 2014 that teams lost a combined $85 million, or an average of $1.3 million a car. He also learned that under the system before charters, when cars had to qualify for a race based on speed, a team would lose $700,000 if it failed to make the field. Behind the scenes NASCAR’s lawyers were admonished by Judge Kenneth Bell after the jurors were dismissed for the day for violating rulings on what could be introduced in court. The lawyers had been told they could not use text exchanges between Spire co-owner Jeff Dickerson and Prime because Dickerson is not a witness, and they could not discuss Jenkins’ income stream from non-NASCAR businesses. “These will not happen again,” Bell warned the defense. Christopher Yates, who has been lead attorney in the year since the case began, has through three days let his associates handle all the in-court action. Meanwhile, as the two sides left court at the end of the day, a spectator waited for Jordan and played the introduction music that always played before Jordan began an NBA game. Jordan, during a break in court, told a reporter he did not watch North Carolina’s win over Kentucky on Tuesday night.",
        "image": "/images/nascar_bob_jenkins_2025.webp",
        "slug": "nascar-bob-jenkins-hurt-by-last-minute-charter-offer",
        "date": "04, December 2025",
        "author": "Marcus Bennett"
    },
    {
        "category": "sports",
        "title": "Antetokounmpo undergoes MRI after leaving Bucks’ game with Pistons due to right calf strain",
        "shortdescription": "Giannis Antetokounmpo left the Bucks’ game against the Pistons with a right calf strain and is undergoing an MRI to assess the injury’s severity.",
        "description": "Giannis Antetokounmpo left the Milwaukee Bucks’ game against the Detroit Pistons on Wednesday night after straining his right calf in the first quarter. Milwaukee coach Doc Rivers said after the Bucks’ 113-109 victory that Antetokounmpo was undergoing an MRI. Rivers added that he believed the Bucks had ruled out the possibility that Antetokounmpo had injured his Achilles tendon on the play. The two-time MVP had just assisted on AJ Green’s layup less than three minutes into the game when he headed back up the court and slipped in the painted area. Antetokounmpo went down, clutched his right leg and eventually was helped up before walking gingerly to the locker room. Rivers said he believed Antetokounmpo’s injury may have stemmed from contact with a Detroit defender while driving along the baseline before passing to Green. “I thought the bump was what made him lose his balance,” Rivers said. The Bucks announced later in the first quarter that Antetokounmpo would miss the rest of the game. Antetokounmpo had missed the Bucks’ 2024 first-round playoff loss to the Indiana Pacers due to a left calf strain. Antetokounmpo was playing his fourth game since returning from a left adductor strain that caused him to miss four games. The Bucks went winless during that stretch of four games Antetokounmpo didn’t play. “We’ve got to hang our hat on defense,” Bucks forward Kyle Kuzma said. “I think we didn’t do a good job of that when he was out the first time.” They rallied from an 18-point deficit Wednesday and believe they can perform better this time if Antetokounmpo has an extended absence. Antetokounmpo apparently was impressed with the way the Bucks responded against the Pistons. “What’s so crazy is Giannis is the first person texting in the team group message, ‘Good job, fellas, way to get one,’” Bucks forward Bobby Portis said. The two-time MVP entered Wednesday ranked fourth in the NBA in scoring (30.6), fifth in rebounding (10.7) and 17th in assists (6.4). The injury came after ESPN reported earlier in the day that Antetokounmpo and his agent, Alex Saratsis, had started conversations with the Bucks about the superstar’s future and whether he’s best suited to stay in Milwaukee or play elsewhere. Rivers disputed that report during his pregame availability by saying “there’s been no conversations” in that regard. “Giannis has never asked to be traded — ever,” Rivers said. “I can’t make that more clear.”",
        "image": "/images/antetokounmpo_bucks_game_2025.webp",
        "slug": "antetokounmpo-mri-right-calf-strain",
        "date": "03, December 2025",
        "author": "Marcus Bennett"
    },
    {
        "category": "sports",
        "title": "Jamal Murray delivers impressive, efficient 52-point night as Nuggets beat Pacers 135-120",
        "shortdescription": "Jamal Murray scored a remarkable 52 points in an efficient performance, leading the Denver Nuggets to a 135‑120 victory over the Indiana Pacers.",
        "description": "Denver guard Jamal Murray was listed as questionable just a few hours before the Nuggets’ game Wednesday night against Indiana. By tip-off, he left nothing to chance. Just two nights after spraining his right ankle, Murray delivered one of the NBA’s most-efficient performances all season. He made 19 of 25 shots, including an incredible 10 of 11 on 3-pointers, to finish with a season-high 52 points in a 135-120 victory over the defending Eastern Conference champs. “Keep shooting,” Murray said when asked what went through his mind as the shots continued to fall. “You’ve been doing this so long, there’s no need to oversimplify. Just playing, having fun, playing, having fun.” Murray was in such a groove, he even took a moment to sign an autograph — during the game. And he wasn’t the only enjoying the show. NBA Commissioner Adam Silver got a first-hand glimpse at what Nuggets coach David Adelman described as one of the most efficient 50-point games in recent memory. Teammate Bruce Brown, who is back with Denver where he won an NBA title, said Murray’s shooting made his job easier. “Just give him the ball,” Brown said he was thinking. “Get out of the, go to the corner. If he need me, I’ll be open, but I’ll give it right back to him and just let him work.” Murray’s shots fell from everywhere — deep, deep 3s, midrange shots, even baskets in the paint. post. One that even hit the front of the rim and looked like it would bounce off for a rare miss instead bounced above the rim and fell through the net as the Pacers had rallied from a 29-point deficit to get within striking distance in the fourth quarter. The only thing that he really missed was matching his career high of 55 points that he had at Portland in February. It was that kind of night and it’s been that kind of season for Murray and the NBA’s highest scoring team. Aaron Gordon scored 50 points in October’s season-opening loss, Nikola dropped 55 in a November win over the Los Angeles Clippers and now Murray had 52 on a night the Nuggets fell one point short of their season-high in a 139-136 loss to San Antonio on Nov. 28. The difference in winning this one Murray believes was, ironically, defense. “For me, the defense fuels the offense,” he said. “I know when we’re in half court, we execute well, we share the ball. We’re unselfish, we cut, we move, make shots. I think the difference with us is when we play defense we can add to that and, on the other hand, stop the other team from scoring.” Murray didn’t just have fun scoring. He also finished with six rebounds and four assists. Not bad for a guy who Adelman wanted to see go through pregame warmups before declaring him available to play. But Murray never doubted he’d be out there to help his team. “It felt pretty good, honestly,” he said. “We did a lot of treatment going into the game today and it felt good. Maybe a little sore at the end of the first quarter, but it was nothing I couldn’t handle.”",
        "image": "/images/jamal_murray_nuggets_win_2025.webp",
        "slug": "jamal-murray-52-points-nuggets-beat-pacers",
        "date": "04, December 2025",
        "author": "Marcus Bennett"
    },
    {
        "category": "sports",
        "title": "Cooper Flagg didn’t wilt without Anthony Davis and now Mavs hope they flourish together",
        "shortdescription": "Cooper Flagg impressed in the Mavericks’ lineup even without Anthony Davis, and the team now hopes their combined talents will flourish together moving forward.",
        "description": "Cooper Flagg followed Anthony Davis’ bank shot with a jumper of his own, then blocked a jump hook from Anthony Wiggins at the other end before scoring a contested layup on an assist from Davis. Just like that, the rookie No. 1 overall pick and the 10-time All-Star combined to seal Dallas’ 118-108 victory over the Miami Heat on Wednesday night, extending the first winning streak of the season for the Mavericks to three games. Flagg knew his NBA career would start without help on the court from star guard Kyrie Irving, who is recovering from an ACL tear last March. The 18-year-old former Duke standout also had to persevere for a month without Davis, who was sidelined with a left calf strain. A loss in Davis’ return at the Los Angeles Lakers last week dropped the Mavericks to 5-15, but they won a night later without him before consecutive victories over Denver and the Heat, two teams that should be playoff contenders. “When you talk about the stars, he didn’t have the two stars on the floor, so he had to endure the best wing defender, and I thought he did an incredible job,” coach Jason Kidd said. “When you look at the clutch situations, he responded in a positive way. For an 18-year-old to be leaned on without AD or Kai out there, I thought he responded in a positive way.” While Davis was out, Flagg found himself in the company of LeBron James a couple of times. In a 118-115 victory over New Orleans last month, Flagg had 29 points, seven rebounds and five assists. James is the only other player with at least 25 points, five rebounds and five assists in a game as an 18-year-old. With Davis resting on the second night of a back-to-back in a 114-110 victory at the Los Angeles Clippers on Saturday, Flagg became the youngest player in NBA history to score 35 points. He and James are the only 18-year-olds with 30-point games. “I think I learned a lot throughout that period, and as a team I think we learned a lot as well,” Flagg said. “Obviously it wasn’t the start we were looking for or hoping to have, but I think it’ll give us a lot of gratitude moving forward. If we can find success and we can think back to a really rocky start, I think I grew a lot in that time period as well.” Flagg was 9 of 13 from the field and led Dallas with 22 points against the Heat, and is shooting 57% in the four games since Davis returned. They did get five games together to start the season, but Flagg wasn’t quite as assertive then. Four-time champion and 13-year veteran Klay Thompson has come out of a shooting slump recently, which also has helped ease the burden on Flagg. Thompson scored 17 points in his relatively new role off the bench against the Heat, and Davis had 17 points and 17 rebounds. “It’s so much better for us when he’s out there,” Flagg said about Davis. “I think just between him and Klay on the court at the same time, the amount of gravity that those two guys have of just pulling defenses toward them and just creating space out there, it’s huge for me.” It’s far from a guarantee that Davis can stay healthy, with him missing more games than he has played since the oft-injured forward was acquired in the much-criticized trade that sent superstar Luka Doncic to the Lakers last February. If Davis stays on the court, Flagg will have part of the formula the Mavs envisioned with title-winning vets easing his transition to the NBA after he essentially turned pro a year earlier than other one-and-done college stars. And that’s not even including Irving, who presumably could return sometime after Jan. 1. “You’re going to have to put your best defender on someone and so most of the time that’s AD,” Kidd said. “So he gets the secondary defender and for him, it’s his ability to get to the paint, but also to be able to play off AD, where he doesn’t have to do everything like he did here early on, where we were asking him to be the point guard, score, defend, do everything, which he’s not afraid of doing, but now he has some help.” Davis illustrated it by combining with Flagg to score the final eight Dallas points to stop a Miami rally close out the Heat.",
        "image": "/images/cooper_flagg_mavs_2025.webp",
        "slug": "cooper-flagg-mavs-hope-synergy-with-davis",
        "date": "03, December 2025",
        "author": "Jenna Whitmore"
    },
    {
        "category": "sports",
        "title": "More angst-filled coaching changes are inevitable unless college football overhauls its calendar",
        "shortdescription": "Analysts warn that more coaching upheavals are likely in college football unless the sport overhauls its scheduling and calendar to ease pressure on teams and staff.",
        "description": "Lane Kiffin’s awkward and angst-filled departure from Ole Miss will happen again. It’s inevitable unless college administrators and football coaches agree to reimagine an imperfect calendar that has been a mess for decades. Under the current format, national signing day happens during conference championship week, the transfer portal opens during the College Football Playoff and some coaches are secretly interviewing for other jobs before Halloween. Clunky and clumsy at best. Chaotic and conflicted might be more accurate. No one has an ideal solution. Even the thought of adopting an NFL-like format seems flawed. “You want the best idea? Blow it up and start from scratch,” UNLV coach Dan Mullen said. “It’s a shame you’re going to lose a lot of things that are great in college football, but you already have.” Three Southeastern Conference programs — Florida, LSU and Ole Miss — courted Kiffin for weeks before he finally picked the Tigers and left the other two fanbases in emotional shambles. The Gators pivoted to Tulane coach Jon Sumrall; the Rebels stayed in-house and promoted defensive coordinator Pete Golding. Florida and Ole Miss were left trying to convince themselves they’re better off without Kiffin. Anyone who has witnessed his messy exits from basically every job he’s held might not have needed much convincing. But the real villain is a college football calendar that essentially forces teams to scramble to get coaches in place before signing day for high school recruits, which was moved last year from the third to the first Wednesday in December. Even in an era of the quick fix through the transfer portal, football teams need high school athletes to build out rosters. What happens when things go bad? Take a look at Penn State, which fired its coach in October but has yet to hire a replacement. The Nittany Lions have lost dozens of commitments in recent days, have locked down just a handful of signees, all of which has prominent boosters demanding answers. While Kiffin left right away, some others finish out the season at their ‘old’ jobs. A handful of Power Four schools hired Group of Five head coaches and allowed them to remain in place even though it made for a trickier signing day.Kiffin, meanwhile, wanted to coach the Rebels through the CFP but was told no thanks; Ole Miss officials surely didn’t want him having daily contact with players who could follow him to Baton Rouge. “Somebody’s got to get all this stuff under control,” said new Oklahoma State coach Eric Morris, who is remaining with North Texas through the season. “Just makes no sense at any level that we’re sitting here talking about people that are going to be in the College Football Playoff, a team and their coach isn’t going to be there to help them get through the whole entire season. “It’s not sustainable. There are so many things that are not sustainable right now in what we’re doing.” Signing day a moving target for decade. Since the early 1980s, the much-anticipated — often overhyped — signing day had been in early February. It seemed perfectly placed, set weeks after the last bowl games had been played and a national champion had been crowned. But coaches grew tired of having to continuously court high school kids during the football season and wanted a chance to lock them up long before February. In response, the NCAA delivered an early signing period in 2017. That worked well for a while. But with the CFP expanding the postseason and stretching games well into January, the early signing period started to muddy the calendar. It prompts ADs to fire struggling coaches in the middle of the season to get a jump on their search for a replacement, and the transfer portal made roster management even messier. “It’s a game of musical chairs, and we all know what happens to the guy who doesn’t get a seat,” Florida athletic director Scott Stricklin said. Stricklin has a solution, or at least a working theory of something that might work. His idea includes eliminating spring practice, moving signing day back to February, opening the transfer portal between March and April, and mandating that only players who were with a team last season can take part in offseason conditioning programs. And then newcomers would be allowed to join for summer workouts that would include the 15 practices normally held in the spring. “Coaches don’t want to hear that because they think, ‘Oh my gosh, I’ve got to have eight months before I kick the ball off with these kids,’” Stricklin said. … “The football schedules combined with the semester structure, and the idea that everybody wants their teams put together in January, unless we fix that, it’s never going to work.” Texas Tech coach Joey McGuire had a different suggestion. He wants to start the season a week earlier than usual, play conference title games over Thanksgiving weekend and play postseason games every seven days. “You could play the national championship on January 1st and then the portal would open on January 2nd, so the season would actually be over,” he said. “Until you do that, we’re still going to have this.” Would an NFL-style calendar be the best solution? There has been rampant talk about college football adopting an NFL-style calendar, which would mean coaching movement after the season in January and February, player movement in March and then team workouts after. And there are penalties for tampering with coaches and players under contract. McGuire said colleges should consider something similar. He offered that teams who hire coaches who leave other teams in the middle of a playoff run — much like Kiffin did at Ole Miss — would be ineligible for the CFP the following year. He added that those coaches making a jump would not be allowed to bring players with them. “They can get in the transfer portal, but they’ve got to go somewhere else; they can’t follow you,” he said. “Until there’s some penalties in that, we’re going to get the same thing over and over.” And it will lead to more Kiffin-like exits and fanbase excitability. “Does anybody have a perfect solution? No,” Mullen said. “Here’s why: There are 136 Division I teams. There’s a lot of different conferences. Every one of those 136 teams operates on a different schedule. I know it’s like, ‘Hey, let’s look at a pro model.’” Maybe the biggest problem with the pro model is that, even though college sports look more like the pros every day, there is still school — and a school calendar — involved. “Then let’s go to every president and every chancellor and say, ‘If you’re a Division I school, classes start on this day and end on that day.’ That’s a way to fix it because then you can really set the calendar. But it’s hard when some people are on quarters, some people are on trimester, some are on semester. … When everybody’s working on a different calendar, it’s hard to come up with the exact thing.”",
        "image": "/images/college_football_coaching_changes_2025.webp",
        "slug": "college-football-coaching-changes-calendar",
        "date": "04, December 2025",
        "author": "Sophie Langford"
    },
    {
        "category": "sports",
        "title": "Changing face of college football results in blue-chip prospects making some surprising choices",
        "shortdescription": "The evolving landscape of college football is prompting top prospects to make unexpected decisions about where to play, reshaping traditional recruiting patterns.",
        "description": "The changing landscape of college football means the nation’s premier recruits are no longer signing with the same handful of programs. That became particularly apparent this week when the nation’s top-ranked prospect landed in Vanderbilt of all places. Vanderbilt parlayed the first 10-win season in school history into a recruiting coup when Nashville (Tennessee) Christian quarterback Jared Curtis decided to stay home and sign with the Commodores. Curtis is the No. 1 overall player in his class according to composite rankings of recruiting sites compiled by 247Sports. “Being here in Nashville and seeing what Vandy has been doing this season has been amazing, and over the past few weeks, I felt more and more that I wanna be a part of that, to be close to home, to play in front of my family and friends and to be what I love to be, an underdog,” Curtis said Tuesday in an X post announcing his decision. Curtis had been committed to Georgia up until this week. He instead is taking a chance that he can help Vanderbilt continue to thrive after star quarterback Diego Pavia’s departure. “If you’re interested in inheriting success, if you’re interested in walking into a trophy case that’s already full and a hallway full of NFL players on the walls, there are other programs where you can do that,” Vanderbilt coach Clark Lea said Wednesday. “If you can walk these hallways and see your picture on the wall and if you can look at an empty case and (see) the trophies that will go in there, if you want to put your signature on the success, then this is the perfect place.” Curtis’ decision wasn’t an aberration. Three of the 247Sports Composite’s top five prospects signed with home-state schools generally unaccustomed to acquiring five-star recruits. Houston got the nation’s No. 3 recruit by signing Keisean Henderson of Legacy the School of Sport Sciences in Spring, Texas. Edge rusher Zion Elee, rated fifth overall, is going from Baltimore’s St. Frances Academy to Maryland. That represents a sea change from just five years ago, when seven of the 247Sports Composite’s top 10 recruits signed with either Ohio State or Alabama. “This is where college football is at now,” said Andrew Ivins, the director of scouting at 247Sports. “There has been a flattening of the curve.” As college programs debate how to construct their rosters in an era of revenue sharing and determine how much to invest in the transfer portal, high school recruiting has become a different type of game in which blue-blood programs don’t have an exclusive hold on the nation’s top prospects. “It parallels the NFL,” Ivins said. “Some schools aren’t going to want to tie up 20% of their budget in a quarterback. They’re going to want to use it elsewhere. Everyone’s trying to figure out how to use their money. For programs that haven’t had a ton of success, it’s easy to rally around a program-changing talent and make that investment in hopes of breaking through.” The No. 1 spot in the 247Sports Composite’s team rankings will go to either Southern California or Oregon, making this the first time since 2008 that honor has gone to a school from outside the Southeastern Conference. It could come down to the decision of wide receiver Chris Henry (No. 10 in the 247Sports Composite), who had verbally committed to Ohio State but didn’t sign Wednesday and was still considering both Oregon and USC. USC and Oregon were followed in order by Notre Dame, Alabama, Georgia, Ohio State, Tennessee, Texas, Texas A&M and Miami as of late Wednesday night. Oregon landed six top-50 recruits in offensive lineman Immanuel Iheanacho (No. 16), tight end Kendre Harrison (No. 18), wide receiver Jalen Lott (No. 22), edge rusher Anthony Jones (No. 26), safety Jett Washington (No. 36) and safety Davon Benjamin (No. 47). Notre Dame continued its recent pattern of signing sons of former NFL players by adding wide receivers Kadon Finley and Devin Fitzgerald, and linebacker Thomas Davis Jr. Fitzgerald is the son of 11-time Pro Bowl receiver Larry Fitzgerald, Finley’s dad is former Green Bay Packers tight end Jermichael Finley and Davis’ father is three-time Pro Bowl linebacker Thomas Davis. SEC A name worth knowing is defensive lineman Lamar Brown (No. 2 in the 247Sports Composite). He’s committed to LSU but didn’t sign Wednesday as new Tigers coach Lane Kiffin fills out his staff. Tennessee landed two of the nation’s top 11 prospects in quarterback Faizon Brandon (No. 7) and Tristen Keys (No. 11). Texas added quarterback Dia Bell (No. 9). Big Ten Michigan signed two top-10 recruits in edge rusher Carter Meadows (No. 6) and running back Savion Hiter (No. 8). Henry’s potential wavering on his Ohio State commitment came after South Florida announced it was hiring Buckeyes offensive coordinator/wide receivers coach Brian Hartline as its head coach. Penn State’s prolonged coaching search after the firing of James Franklin decimated its class. The Nittany Lions signed just two players Wednesday. Atlantic Coast Conference Consider it one more wrinkle in a bizarre year for this conference. The two teams facing off Saturday in the ACC championship game — Duke and Virginia — had the league’s two lowest-rated signing classes as of Wednesday afternoon. Miami, Florida State and North Carolina all ranked ahead of Clemson, which had been the ACC’s heavyweight on the field and on the recruiting trail for much of the last decade. Big 12 Texas Tech spent the offseason signing elite transfers that have the Red Raiders on the verge of a College Football Playoff appearance. It turns out Texas Tech can sign top recruits as well. The Red Raiders had the Big 12’s best signing class and added two top-15 prospects in offensive tackle Felix Ojo (No. 13) and edge rusher LaDamion Guyton (No. 15).",
        "image": "/images/college_football_recruits_2025.webp",
        "slug": "college-football-blue-chip-prospects-surprising-choices",
        "date": "04, December 2025",
        "author": "Jenna Whitmore"
    },
    {
        "category": "sports",
        "title": "Ovechkin scores twice as Capitals crush Sharks 7-1 for sixth straight win",
        "shortdescription": "Alexander Ovechkin scored two goals as the Washington Capitals dominated the San Jose Sharks 7‑1, marking their sixth consecutive victory.",
        "description": "Alex Ovechkin scored twice to extend his record to 911 career goals, Riley Leonard had four points and the Washington Capitals beat the San Jose Sharks 7-1 on Wednesday night for their sixth straight win. Ovechkin started a four-goal barrage in the first period when he scored on a rebound near the side of the net midway. He added a power-play goal in the second to give him 14 goals on the season and 10 in the past 11 games. Washington got plenty of help, getting goals from Sonny Milano, Leonard, Brandon Duhaime later in the period to knock out Yaroslav Askarov and help extend the team’s longest winning streak since also winning six straight in January last season. Leonard finished with two goals and two assists and Dylan Strome also scored for Washington. Charlie Lindgren made 23 saves and added his second career assist for the Capitals. Pavol Regenda scored his second goal since being called up from the AHL earlier this week when he converted on the power play in the third period to cut the deficit to 7-1 and deny Lindgren the shutout. Askarov had won nine of his last 11 starts, allowing two goals or fewer in eight of those wins. But this was the second time in the past eight days that he was knocked out early after getting replaced early in the second period last Wednesday in Colorado after allowing four goals. Askarov made eight saves and Alex Nedeljkovic stopped 15 of 18 shots in relief. The Sharks had won seven of their last eight home games but were never in this game after Ovechkin got the scoring barrage started. Ovechkin’s goal in the second gave him 181 career muiltigoal games — eight shy of Wayne Gretzky’s record.",
        "image": "/images/ovechkin_capitals_win_2025.webp",
        "slug": "ovechkin-scores-twice-capsitals-crush-sharks",
        "date": "04, December 2025",
        "author": "Jenna Whitmore"
    },
    {
        "category": "sports",
        "title": "Rams QB Matthew Stafford has already moved past the 3-turnover game that slowed his standout season",
        "shortdescription": "Rams quarterback Matthew Stafford has bounced back from a three-turnover game, continuing his strong performance and keeping his standout season on track.",
        "description": "Matthew Stafford’s 192 career interceptions are the most among active quarterbacks. He has also fumbled 91 times in his 17-year NFL career. So his three crucial turnovers in the Los Angeles Rams’ 31-28 loss at Carolina aren’t going to send Stafford into a funk or a crisis of competence. “I know that whether we win or we lose, I move on pretty darn quickly,” Stafford said Wednesday. “I just know that I have another challenge in front of me.” The eighth-leading passer in NFL history has the experience and the maturity to know that a quarterback can’t allow mistakes or bad luck to beat him twice — particularly not during a season in which he has played his way into strong contention for his first league MVP award. “I’ve played in a lot of games now, so (moving on) just feels like it comes easy to me,” Stafford said. “It doesn’t mean that I don’t care about each and every single one of them, and do everything I can to try and help us win each and every one of them. But I do know that unless it’s the last game of the year, there’s another one coming, and you better be ready for it.” Stafford knows that his two interceptions — doubling his season total — and a late fumble were the biggest reasons why the Rams lost to the Panthers and fell out of the No. 1 spot in the NFC standings. There’s still nothing he’ll do much differently when he leads Los Angeles (9-3) to Arizona on Sunday. “I’ve got a bunch of plays I’ve got to learn,” he said. “I’ve got to make sure everybody’s in the right spots at the right places. I do move on pretty quick, so I feel good about that, and I think the guys in our locker room do as well.” Stafford has had a reputation as an aggressive gunslinger for most of his career. He threw at least 10 interceptions in each of his first nine full seasons with Detroit, and he even led the NFL with 17 interceptions during his first season with the Rams. That season that ended with a Super Bowl victory — albeit one in which he also threw two interceptions to the Bengals before hitting Cooper Kupp for the winning touchdown on a masterful late drive. Stafford is still taking risks at 37 years old. He throws into tight windows with more frequency than most quarterbacks, usually trusting Davante Adams or Puka Nacua to come up with the ball in difficult spots. With increasing frequency, he’s also throwing the no-look passes for which he has become famous ever since he did it on the winning drive in the Super Bowl. Before the trip to rain-soaked Charlotte, Stafford had done an exceptional job of taking care of the ball this season, particularly during the Rams’ six-game winning streak to the top of the conference. He set an NFL record by throwing 28 straight touchdown passes without an interception while playing eight straight pick-free games, and he had lost only two fumbles in the Rams’ first 11 games. Coach Sean McVay isn’t discounting his star quarterback’s mistakes at Carolina, but he also doesn’t think Stafford needs much advice on how to play quarterback. “The first one, sometimes those are unfortunate occupational hazards of a tipped ball right there and there’s not a lot that you can do,” McVay said. “But then the next two, absolutely you talk about, ‘What are the things that we could do to prevent turning the football over, whether it’s the interception or the fumble?’” Stafford’s first interception since Week 3 was painful, because it came on a tipped pass by Carolina’s Derrick Brown into the arms of former Rams safety Nick Scott in the end zone. That turnover cost the Rams at least three points — and on their next drive, Mike Jackson jumped a route and returned Stafford’s second interception for a 48-yard touchdown. Stafford’s fumble came on the Rams’ last offensive snap, forced by Brown while Stafford tried to escape a collapsing pocket. Again, the Rams lost at least three points in what turned out to be a three-point loss. “I still thought we gave ourselves a chance at the end of the game to win it,” Stafford said. “It was a mistake by myself to let that ball come out of my hands and not give us a chance to at least extend the game or going into overtime.”",
        "image": "/images/matthew_stafford_rams_2025.webp",
        "slug": "rams-qb-stafford-moves-past-3-turnover-game",
        "date": "04, December 2025",
        "author": "Claire Addison"
    },
    {
        "category": "sports",
        "title": "Toyota deepens connections in F1 with Haas team sponsorship in 2026",
        "shortdescription": "Toyota strengthens its presence in Formula 1 by sponsoring the Haas team for the 2026 season, expanding its influence in the sport and motorsport partnerships.",
        "description": "Toyota is increasing its presence in Formula 1 after taking over the title sponsorship of the Haas team on Thursday. It’s another high-profile commitment to F1 by a major automaker as the General Motors-backed Cadillac team prepares to make its debut next year. The team’s new name in 2026 will be TGR Haas F1 Team. The TGR stands for Toyota Gazoo Racing, which is the racing division of the Toyota Motor Corporation. Taking over the title sponsorship means Toyota is more involved in F1 than at any time since it pulled its team out after the 2009 season. Since then, its circuit racing efforts have largely focused on sportscar events, including five straight wins at the 24 Hours of Le Mans from 2018-22. Haas and Toyota signed a technical partnership a year ago for research, engineering and driver development and the Haas car has carried some Toyota branding since. Toyota-linked Japanese drivers have taken part in tests using older Haas cars. Toyota ran its own team in F1 from 2002-09 but failed to win a race despite spending heavily. It eventually withdrew from the series while the parent company was under financial pressure. “It’s naturally a privilege to deepen our relationship with TGR through this new title partnership agreement,” Ayao Komatsu, team principal of Haas, said in a team statement, adding that the existing technical partnership has already “benefited us greatly.” Akio Toyoda, the chairman of the Toyota Motor Corporation, said: “Throughout our challenges in the 2025 season I witnessed young TGR drivers and engineers begin to believe in their own potential and set their sights on even greater dreams. Seeing this transformation moved me deeply. And today I can say this with confidence — Toyota has begun to move. Really move.” Toyoda has said previously he had second thoughts about pulling Toyota out of F1. He said part of his regret was not giving young drivers a better chance to compete in F1. The length of the sponsorship agreement wasn’t immediately clear and the statement mentioned only 2026. Haas has been in F1 since 2016 and is eighth in the constructors’ standings this season, which included Oliver Bearman placing fourth in Mexico. That was Haas’ best race result since 2018 even though he fell short of achieving the team’s first podium finish. The final race of 2025 is on Sunday in Abu Dhabi and three drivers are in contention for the world championship. Lando Norris of McLaren leads by 12 points over Max Verstappen of Red Bull. Oscar Piastri of McLaren is 16 points behind. Norris and Piastri are trying for their first season titles, Verstappen is after his fifth straight.",
        "image": "/images/toyota_haas_f1_sponsorship_2026.webp",
        "slug": "toyota-f1-haas-sponsorship-2026",
        "date": "04, December 2025",
        "author": "Claire Addison"
    },
    {
        "category": "sports",
        "title": "Denny Hamlin breaks down in tears as the first witness testifying at NASCAR antitrust trial",
        "shortdescription": "Denny Hamlin became emotional and broke down in tears while testifying as the first witness in the high-profile NASCAR antitrust trial.",
        "description": "The landmark federal antitrust trial against NASCAR opened Monday with three-time Daytona 500 winner Denny Hamlin breaking down in tears minutes into his testimony as the first witness in a case that could upend the venerable stock car series. Hamlin’s 23XI Racing, which he co-owns with Michael Jordan, and Front Row Motorsports claim the series is a monopolistic bully that leaves its teams no option but to comply with rules and financing they don’t agree with. As Jordan watched from the gallery, Hamlin began to cry and had to stop and compose himself when asked how he got into racing. He disclosed to The Associated Press last month that his father is dying, and he said on the stand he was emotional because his dad “is not in great health.” “We got to when I was about 20 and a decision had to be made, I could keep racing or go out and work for my dad’s trailer business,” Hamlin testified, adding that he later was thinking about what retirement looked like and found a team going out of business. He needed a partner and turned to Jordan, who he had developed a friendship with when the Basketball Hall of Famer owned the Charlotte Hornets and Hamlin was a season-ticket holder. “If I can’t be successful with Michael as a partner, I knew this was never going to work,” he said. The references to his early days in auto racing and the sacrifices his family made were intended to show how difficult it is for both team owners and drivers to make it at the top level of the sport. He said he never would have been able to start 23XI in 2021 had he not partnered with Jordan. Because of Jordan’s presence with the team, Hamlin testified, 23XI has turned a profit in all but one of its five seasons of operation. His attorney, Jeffrey Kessler, said in his opening statement that fast-food restaurant entrepreneur Bob Jenkins has never turned a profit since starting his Front Row team in 2004, a team that won the Daytona 500 in 2021. Kessler said a NASCAR-commissioned study found that 75% of teams lost money in 2024 and added that over a three-year period almost $400 million was paid to the France Family Trust. He said a 2023 evaluation by Goldman Sachs found NASCAR to be worth $5 billion. NASCAR is currently run by Jim France, son of founder Bill France Sr. “What the evidence is going to show is Mr. France ran this for the benefit of his family at the expense of the teams and sport,” Kessler said. At the heart of the lawsuit is NASCAR’s revenue sharing model, which 23XI and Front Row argue is unfair to race teams that often operate at a loss. Hamlin testified it cost $20 million to simply bring a single car to the track over a 38-race season, not including overhead expenses such as driver salary and business operations. “So, why would these people do this if you are just going to lose money because NASCAR isn’t giving you a fair deal?” asked Kessler, “Because you love stock car racing, and there’s nowhere else to do it.” The charter agreements signed for this year that triggered the lawsuit guarantee the teams $12.5 million in annual revenue per chartered car. NASCAR argues the guaranteed payouts are an increase from $9 million from the previous agreement, but Hamlin noted that 11 of the first 19 chartered teams are no longer in business. All three charters 23XI purchased came from teams that ceased operations, and Hamlin said 23XI paid $4.7 million for its first charter, $13.5 million for its second and $28 million for its third, acquired late last year. He acknowledged purchasing the third charter was a risk because of the pending litigation — and the price concerned him — but it was required if 23XI intends to build itself into a top team. The charter system guarantees a car a spot in the field each race week as well as a percentage of the purse and gives team owners an asset to sell should they want to get out of the business. NASCAR attorneys argued that the charter system has created $1.5 billion in equity for the 36 chartered teams. Prior to the charter system, teams raced “open,” with no guarantee they’d make the field or earn a payout. “The France family built NASCAR from nothing. They are an American success story,” Johnny Stephenson said in the opening statement for NASCAR. Stephenson is a colleague of Christopher Yates, who had previously handled most of the courtroom arguments for the defendants. “They’ve done it through hard work over 75 years. That’s the kind of effort that doesn’t deserve a lawsuit. That’s the kind of effort that deserves admiration.” The case has churned through hearings and arguments for more than a year despite calls from other NASCAR teams to settle. U.S. District Judge Kenneth Bell even helped mediate a failed two-day summit in October. A NASCAR victory could put 23XI, Front Row and their six combined cars out of business. Their charters — now being held by NASCAR — would likely be sold. The last charter went for $45 million, and NASCAR has indicated there is interest from potential buyers including private equity firms. A win for the teams could lead to monetary damages and the potential demolition of NASCAR as it is run today. The judge has the power to unravel a monopoly, and nothing is off the table, from ordering a sale of NASCAR to the dismantling of the charter system. Jordan’s presence factors into the trial Jordan’s presence in the courtroom gallery near Hamlin was a factor: Among those dismissed from serving on the jury was a man who said he can’t be impartial because “I like Mike” and another who said he had Michael Jordan posters on his walls growing up. A juror said they were a North Carolina fan but noted the football team at Jordan’s alma mater is not “doing too well right now” to which the star shook his head and laughed. NASCAR executives in the courtroom included chairman Jim France and vice chair Lesa France Kennedy, two scions of the family that founded NASCAR in 1948 and still owns it. Hamlin will resume testimony Tuesday morning. NASCAR Commissioner Steve Phelps, 23XI minority owner Curtis Polk, France Kennedy and other top executives had to leave the courtroom after opening arguments because they are all potential witnesses.",
        "image": "/images/denny_hamlin_nascar_trial_2025.webp",
        "slug": "denny-hamlin-emotional-nascar-antitrust-trial",
        "date": "02, December 2025",
        "author": "Travis Monroe"
    },
    {
        "category": "sports",
        "title": "TV presenter Laura Woods collapses live on air during coverage of England soccer match",
        "shortdescription": "TV presenter Laura Woods collapsed live on air while covering an England soccer match, prompting concern from viewers and colleagues during the broadcast.",
        "description": "British television presenter Laura Woods collapsed live on air Tuesday during pre-game coverage of the women’s international match between England and Ghana. Footage showed Woods stumble forward at the side of the field at Southampton’s St Mary’s Stadium when she was caught by co-presenters Ian Wright and Anita Asante. She later posted on Instagram that the incident was “a bit weird” and that she was embarrassed it had happened on TV. “Sorry to worry everyone, I’m OK, the wonderful paramedics at Saints have said it’s probably a virus, just need a bit of rest & hydration,” she posted. British broadcaster ITV swiftly cut to a commercial break before replacing Woods with stand-in presenter Katie Shanahan. “As you have probably noticed we don’t have the wonderful Laura Woods because she’s just been taken ill,” Shanahan said. “But she’s in very good hands so I’m stepping in at late notice.” Shanahan later added: “We want to reassure you all she is doing OK.” Woods’ fiancee Adam Collard also wrote on X: “Laura is all OK and with the right people. Thank you for all of your kind messages.”",
        "image": "/images/laura_woods_live_collapse_2025.webp",
        "slug": "laura-woods-collapses-live-england-match",
        "date": "03, December 2025",
        "author": "Claire Addison"
    },
    {
        "category": "sports",
        "title": "Broncos’ new addition: What Elijah Moore brings to the team",
        "shortdescription": "Elijah Moore joins the Denver Broncos, bringing speed, versatility, and playmaking ability that could bolster the team’s offense this season.",
        "description": "The Denver Broncos have added Elijah Moore to their practice squad following the veteran wide receiver’s release from the Buffalo Bills. “Obviously, he’s been a really good player at places that he’s been, so it adds some depth for this run we’re about to go on,” quarterback Bo Nix said Wednesday. The Bills released Moore last week after signing 12th-year receiver Brandin Cooks. Moore had nine catches for 112 yards in nine games for the Bills after signing a one-year, $5 million free agent deal. “We had some exposure to him, some experience with some guys on our staff,” Broncos coach Sean Payton said. “You’re always paying attention to that wire and if someone comes across it that you feel like either can help now or maybe in the future. I think it was more of us looking at a talented player.” Payton has steadfastly insisted he likes his group of wideouts and Denver made no move at the trade deadline to augment their receiving corps. What the Broncos (10-2) have been willing to do, however, is sign veterans to their practice squad such as tight end Marcedes Lewis and wide receiver Lil’Jordan Humphrey last month. Moore could be elevated on game days over the final five weeks of the season. The Broncos, who visit the Las Vegas Raiders this weekend, are vying to end Kansas City’s nine-year reign atop the AFC West and are chasing the No. 1 seed in the AFC playoff field. They’re a-half game behind New England (11-2). Moore also has played for the Cleveland Browns and New York Jets, who drafted him in the second round in 2021 out of Ole Miss. He had a 61-catch season last year in Cleveland and has nine career touchdowns.",
        "image": "/images/elijah_moore_broncos_2025.webp",
        "slug": "broncos-elijah-moore-team-impact",
        "date": "04, December 2025",
        "author": "Travis Monroe"
    },
    {
        "category": "sports",
        "title": "Texas jumps to No. 2 behind UConn in women’s AP Top 25 after beating South Carolina and UCLA",
        "shortdescription": "Texas rises to No. 2 in the AP Women’s Top 25 after key victories over South Carolina and UCLA, trailing only UConn in the national rankings.",
        "description": "Texas moved up to No. 2 behind UConn in The Associated Press Top 25 women’s basketball poll on Monday after beating two top teams in a Thanksgiving tournament. The Longhorns topped then-No. 2 South Carolina 66-64 a day after beating then-No. 3 UCLA 76-65 in Las Vegas. It was the first time in the past 25 years that a team has beaten two top three teams in such a short time frame. Texas received 10 first-place votes from a 32-member national media panel. No. 1 UConn garnered the other 22. The Huskies routed Xavier 104-39 to open Big East play. South Carolina fell to third and UCLA was fourth. LSU remained fifth. The Tigers, who haven’t played a ranked opponent yet, have scored over 100 points in each of their first eight games to set an NCAA record. They broke the mark of six in a row set by the 1981-82 Louisiana Tech team that LSU coach Kim Mulkey played on. Michigan, Maryland, TCU, Oklahoma and Iowa State rounded out the top 10. The Cyclones got a school-record 47-point effort from star post player Audi Crooks to beat Indiana on Sunday. In and out Ohio State debuted in this year’s poll at No. 23 after edging West Virginia last week 83-81. The Buckeyes followed that up with a 98-point win over Niagara, the most points scored in school history and the biggest margin of victory ever for the Buckeyes. N.C. State fell out of the poll. Conference supremacy The Big Ten matched the Southeastern Conference this week with eight teams ranked after Ohio State entered the Top 25. The Big 12 is next with five and the Atlantic Coast Conference has three. The Big East has one.Games of the week It’s ACC-SEC challenge week with a host of quality matchups between the two power conferences. On Thursday, No. 22 Louisville hosts No. 3 South Carolina; No. 11 North Carolina visits No. 2 Texas; and No. 13 Ole Miss plays No. 18 Notre Dame.",
        "image": "/images/texas_womens_basketball_2025.webp",
        "slug": "texas-women-basketball-ap-top25-no2",
        "date": "01, December 2025",
        "author": "Travis Monroe"
    },
    {
        "category": "sports",
        "title": "Under a cloud, the Olympic flame begins its journey to the Milan Cortina Winter Olympics",
        "shortdescription": "The Olympic flame has started its journey to the Milan‑Cortina Winter Games, symbolizing the countdown to the international sporting event despite challenging weather conditions.",
        "description": "The Olympic flame began its journey Wednesday to the Milan Cortina Winter Games — missing a little of its usual magic. Bad weather lashing western Greece forced organizers to move the torch-lighting ceremony indoors, from Olympia’s ancient stadium and temples to a nearby museum. The flame is lit by focusing the sun’s rays with a concave mirror. But with skies overcast, officials used a backup flame kindled during a brief spell of sunshine at Monday’s rehearsal. Greek rower Petros Gaidatzis launched the torch relay, which, after reaching Italy, will be carried across the host country by about 10,000 runners before the Feb. 6–22 competition. The sun ultimately made an appearance over rain-soaked OIympia on Wednesday during the indoor ceremony. “It’s incredibly memorable and a little bit emotional for me to be standing here,” said IOC President Kirsty Coventry, who was overseeing her first torch lighting after being elected to the post in March. “It feels like the past and the present are really coming together. We are extremely happy that today’s ceremony reminds us what the games stand for.” Italy is hosting its third Winter Games, but preparations have been plagued by cost overruns and construction setbacks. Organizers say there’s plenty for fans to look forward to: a program featuring 116 medal events, the debut of ski mountaineering, higher female participation and the return of NHL players to Olympic hockey. After a short tour of Greece and a handover on Dec. 4, the flame will begin a 63-day, 12,000-kilometer relay through all 110 Italian provinces, highlighting cultural sites and host venues before reaching Milan’s San Siro Stadium for the opening ceremony. “Over the next few weeks, the Olympic flame will pass through all the Italian provinces, 60 cities, 300 towns, 20 regions and all the UNESCO sites. It will travel from the northern peaks to the southern shores,” said Giovanni Malago, head of the Milan Cortina Organizing Committee. Speakers at Wednesday’s ceremony urged world leaders to recognize the spirit of the Olympic Truce – an ancient Greek tradition pausing conflicts during the games to allow safe participation. “Today humanity is going through a time of multiple and parallel crises. Wars proliferate from Europe to the Middle East and from Asia to Africa. So we should honestly admit that a society at war is a failed society,” the mayor of Ancient Olympia, Aristidis Panayiotopoulos, said. “The flame allows us to again recall the values that guide humanity, values that were born and forged here.” Despite moving indoors, Wednesday’s ceremony retained its traditional elements: sculptural dance gestures by performers dressed as priestesses and male kouroi, and invocations in Greek to the ancient gods. Artemis Ignatiou, the ceremony’s artistic director, said the team had prepared for the possibility of bad weather and that, despite the setback, “we gained something special: the energy of the museum and the archaeological space itself.” Speaking to The Associated Press, Ignatiou said dancing among the statues “gave the ceremony a timeless feeling.” A separate flame for the March 6–15 Winter Paralympics will be lit Feb. 24 at Stoke Mandeville Hospital in England, the birthplace of the Paralympic movement.",
        "image": "/images/olympic_flame_milan_cortina_2025.webp",
        "slug": "olympic-flame-journey-milan-cortina",
        "date": "04, December 2025",
        "author": "Evan Carlisle"
    },
    {
        "category": "sports",
        "title": "Harnessing the power of AI to help revolutionize Olympic-level figure skating",
        "shortdescription": "AI technology is being used to enhance training and performance in Olympic-level figure skating, helping athletes refine techniques and gain a competitive edge.",
        "description": "American figure skater Andrew Torgashev was at an invitation-only camp organized by U.S. Figure Skating not long ago, a chance for elite athletes preparing for the high-level Grand Prix season to work out any flaws in their performances. He tried a quad toe loop, a four-revolution jump where skaters launch from the back outside edge of their blade with the help of a toe pick from the other foot. The jump itself is the easiest of skating’s six primary jumps, but four revolutions ups the difficulty. To the naked eye, Torgashev landed it perfectly. To the camera watching him, Torgashev landed a quarter-revolution short. It was a small error, to be sure, but the kind that could make the difference in whether Torgashev medals in a sport where tenths and even hundredths of a point matter. And he knew instantly thanks to feedback he received from the camera — or, more accurately, the app it was running, designed by a pair of computer whiz kids with no background in skating, but who saw in the sport a chance to not only help athletes in training but perhaps someday assist in the actual scoring of competitions. The app is called OOFSkate, and powered by AI technology it analyzes from a tablet or mobile phone a skater’s jump height, rotation speed, airtime and even landing quality. It provides skaters with feedback without having to wear sensors or other technology. “Our vision for the system is to automate the technical calling of the sport,” said Jerry Lu, who along with his old college roomate, Jacob Blindenbach, have built out the system. “This manifests itself in a combination of using AI-assisted computer vision, but also the knowledge of figure skating, essentially taking out the stuff that should be judged without subjectivity.” In other words, let humans judge the artistic side of the sport. Let computers handle the technical stuff. “What are the things that go into a particular jump? We’re trying to measure those things as a semi-automated technical assistant,” Lu told The Associated Press in an interview ahead of this week’s Grand Prix Final, one of the premier events in the sport. “But also, it’s a coaching tool that teachers around the country can use to evaluate their own athletes.” How it works The system itself seems remarkably simple: It uses a phone or tablet camera to capture a skater in motion, then overlays the key points of a jump or spin — the idealized version of a given element — and records the metrics that technical panels typically use. Instantly, a coach or judge can know whether a skater completed three full turns of a triple lutz, or landed on the correct blade edge for a salchow. They can know how high the skater jumped, which is one of the judging criteria, and how fast they were spinning. It also helps the individual skater, who can marry the jump they have just done in practice against what they may have done in the past, or even compare the way they are performing any given element against the way the best have performed it. In the case of U.S. Figure Skating, a team library will allow them to compare their skills to benchmark data collected over the years. “So if I’m Andrew Torgashev and I’m at Champs Camp,” Lu said, “I can do a quad toe loop and can compare it against myself, along with all the other athletes that have executed this. ‘Am I spinning as well as Mikhail Shaidorov? Or a previous version of myself?’” Going high-tech Lu and Blindenbach met while studying at the University of Virginia, where both were swimmers. They were drawn to ways emerging technology could help athletes in the water, such as accelerometers that better measure an athlete’s performance. They went separate ways upon graduation, Lu to the MIT Sports Lab in Massachusetts and Blindenbach to Columbia in New York to specialize in artificial intelligence. But they stayed in touch, thinking up ways they could implement technology in other sports. “We thought this would be a way to push the Olympic sports we love,” Blindenbach said. It was NBC, which has the broadcast rights to the Summer and Winter Games in the U.S., that ultimately brought the pair into the figure skating world. The network asked them to conceive of some kind of technology that could help its analysts, former Olympians Tara Lipinski and Johnny Weir, with providing their commentary in real time. U.S. Figure Skating got on board with the project, realizing its potential to help train its high-level athletes. Olympic skaters Jason Brown and Alysa Liu, along with her coach, Massimo Scali, have provided feedback. And almost weekly, Lu or Blindenbach head to the revered Skating Club of Boston, where they are able to put the latest iteration of their system to the test. It could be a revolutionary moment in a sport that often changes at a glacial pace. “At least from what I can tell, they all seem very open,” Lu said. “They love the sport, first of all. Whatever we can do to help the sport grow and become better, they would do. They are very inclusive of us being there, and shadowing them throughout the day — How do they train, how do they interact with coaches? It’s an artistic sport but it’s also an athletic sport.” Looking ahead The name OOFSkate originally came from what skaters tend to say after seeing their feedback from a jump — as in, “Oof, that wasn’t very good!” Then, one of the folks at U.S. Figure Skating gave it a second meaning: “Obsessed over form.” Indeed, the ability of OOFSkate to take the subjectivity out of judging form is intriguing, much like similar technology has taken the subjectivity out of line calls in tennis, and promises to take the same subjectivity out of balls and strikes in baseball. “If someone under-rotates,” Blindenbach explained, “that should always be called. There shouldn’t be a missed call or a controversy because something doesn’t play out. Sometimes a position makes it hard (for a judge) to see if they’re on an edge or off an edge on a lutz or a flip. We hope that AI can make the sport more fair.” Lu and Blindenbach are wary about looking too far ahead, though. Hawk-Eye, the system that uses high-speed cameras to track the flight of tennis balls and determine whether they land inbounds or out, was pioneered in the early 2000s, and just this past year did the All-England Club decide to replace human line judges with the system at Wimbledon. When it comes to the Olympics, the fact that Omega is its official data provider provides another obstacle in implementation. So given the slow pace of technological adoption, Lu and Blindenbach are focused for now on fine-tuning the system to help coaches, athletes and commentators better do their jobs, especially as many prepare for the Milan Cortina Olympics in February. “We don’t want to step on toes,” Blindenbach said. “When you go fully AI and take the human out of the loop, people generally get mad, and the results are poor. We want to assist. If that’s jump height or rotation, or if someone under-rotates by a quarter, these are easy things to do with AI, relatively speaking, compared to trying to capture something artistic. That’s where we see ourselves.”",
        "image": "/images/ai_figure_skating_2025.webp",
        "slug": "ai-revolutionizes-olympic-figure-skating",
        "date": "01, December 2025",
        "author": "Evan Carlisle"
    },
    {
        "category": "sports",
        "title": "Doping at your doorstep: The next Olympic drug crisis could be coming through the mail",
        "shortdescription": "Authorities warn of a potential Olympic doping crisis as performance-enhancing drugs could be increasingly sent through the mail, posing challenges for athletes and regulators.",
        "description": "The next Olympic doping scandal could be delivered right to your doorstep. A trove of so-called research chemicals known as peptides many of them banned by the World Anti-Doping Agency and some not approved for human use in the United States are available with the simple click of a button through online retailers. One seller is Amazon another is Alibaba a sponsor of the International Olympic Committee. The easy availability of the drugs combined with their hard-to-detect nature is precisely the toxic combination doping regulators and Olympic officials are trying to avoid. With the Milan Cortina Games just two months away they are hoping to break a string of scandals involving the Russians and Chinese that have disrupted the Games both summer and winter since 2014. Though online pharmaceuticals and supplements have for years been portrayed as a risk by anti-doping authorities the influx of certain hard-to-detect peptides chains of protein-building amino acids marketed to help with anything from anti-aging to workout recovery to weight and memory loss presents a more difficult challenge. These substances have proliferated said Oliver Catlin president of the Anti-Doping Sciences Institute whose late father Don was among the godfathers of anti-doping research. Most of these peptides are so-called research chemicals that are not approved by the U.S. Food and Drug Administration and are also banned by the WADA code either under its S2 category that encompasses peptides or under its SO classification a catch-all category for non-approved substances. The few substances specifically listed under the S0 category such as the hot-selling BPC 157 are placed there because the pharmacological make-up of the substances do not fit neatly into another category on the banned list. One tricky part of the S0 category is that it includes unapproved substances that are not specifically listed because there is no way to test for that drug and regulators do not want to reveal that to users. Catlin’s research found hundreds of the banned or illegal peptides available on the online market and an ever-shifting menu of items with some of them removed after The Associated Press started asking questions. Amazon and Alibaba respond to questions about availability of peptides. Dan Burke a former FDA official who now heads intelligence and investigations at the U.S. Anti-Doping Agency said the new-age peptides are hard to corral online because the American law prohibiting their sale dates to 1938 and it just isn’t working and does not work to this day. The bad guys know it and that is why the stuff proliferates said Burke. Though some peptides insulin and the newly popular weight-loss dynamo GLP-1 are time-tested perfectly legal with a prescription and effective other substances in the category are not legally marketable either as supplements or prescription or over-the-counter drugs. A number of them including BPC-157 could be found on multiple online sites including Amazon and Alibaba. The latter is a major IOC sponsor committed to helping the IOC transform the Olympic Games for the digital era. Asked by AP about this connection an IOC spokesperson said Alibaba confirmed to us that it consistently monitors its marketplaces and that it does not have prohibited substances for sale from the WADA 2025 list. Approached by AP a representative for Alibaba.com asked for links to problematic drugs sold by its marketplace and after the AP sent two of them said they had removed those items. The company said it bars all prohibited substances in accordance to the WADA banned list. Although some of these substances may not be legally restricted in ordinary consumer contexts we have proactively adopted stricter standards to define operational boundaries and our compliance efforts go beyond passive adherence and minimum legal requirements the company said in a statement. Amazon told AP it requires all products offered on its marketplace to comply with applicable laws and regulations and is in the process of removing products that violate its policies. A few days after being contacted by AP the website removed some of the drugs the AP had asked about but a number of listings remained and some new ones popped up. The current peptides boom comes some 25 years after the late Victor Conte became a household name in sports by developing and selling the clear and the cream. Those were the names for so-called designer steroids that led to the infamous scandal that emerged from Conte’s Bay Area Lab Co-operative BALCO and engulfed baseball and track. Like some peptides designer steroids were impossible to detect at the time but they were not easy to obtain. It took years to uncover their existence let alone to analyze their efficacy or sanction the athletes who used them. Fast forward 25 years and this new model of performance enhancers are in some cases just as difficult to detect but as easy to purchase as clicking a few buttons on a computer. WADA spokesman James Fitzgerald said the availability of PEDs on websites is not under its jurisdiction but that WADA began teaming with national anti-doping and law enforcement agencies two years ago to tackle the illegal manufacture sale and supply of performance enhancers of all sorts. The illegal manufacture and trafficking of PEDs is not just a problem for sport it is a societal issue that requires a multi-faceted approach he said. Whether the proliferation of the drugs could be the trigger point of the next Olympic scandal could take years to uncover. Like some of the blood-boosting drugs they purport to mimic most peptides disappear from the blood quickly which makes them hard to detect. The IOC stores blood samples for up to 10 years to account for possible improvements in detection long after the event ends. USADA and other anti-doping organizations have spent years warning athletes about the potential legal and eligibility risks of using unapproved substances whether via prescription drugs or unvetted supplements while also articulating the health risks for elite athletes and others looking to gain a small advantage in the gym. From a consumer-buyer-beware standpoint anytime you consume or inject something where you do not know what you are taking there is the possibility of adverse health effects and that is concerning said Matt Fedoruk USADA’s chief science officer.",
        "image": "/images/olympic_doping_mail_2025.webp",
        "slug": "olympic-doping-mail-threat",
        "date": "03, December 2025",
        "author": "Evan Carlisle"
    },
    {
        "category": "sports",
        "title": "Russian skiers and snowboarders allowed by CAS to try to qualify for Winter Olympics",
        "shortdescription": "The Court of Arbitration for Sport (CAS) has allowed Russian skiers and snowboarders to attempt qualifying for the Winter Olympics, overturning previous restrictions on their participation.",
        "description": "Russian skiers and snowboarders won a court ruling to apply as neutral athletes for qualification events to the Milan Cortina Winter Olympics after nearly four years of being excluded due to the war on Ukraine. Russian Sports Minister Mikhail Degtyaryov said an appeal to the Court of Arbitration for Sport overturned a blanket ban imposed by the International Ski and Snowboard Federation (FIS) days after the full military invasion in February 2022, which FIS had renewed in October. CAS later published its ruling, giving Russian and Belarusian winter sports athletes another legal win. Sports bodies have excluded Russians mainly for security reasons to protect athletes and prevent protests. There is limited time for a three-person FIS panel to process applications for neutral status before the Jan. 18 qualification deadline. The Milan Cortina Olympics begin on Feb. 6, with FIS running 57 of 116 gold medal events. Russian athletes and officials also face challenges getting visas for qualifying events in Alpine, cross-country, freestyle skiing, and snowboarding. Degtyaryov expects a small Russian team of around 15 athletes, far fewer than the 200 who competed in Beijing 2022 under the ROC banner, winning 32 medals including five gold. Recently, six Russians competed as Individual Neutral Athletes (AIN) in a luge test event at Cortina but did not finish higher than 19th. They did not register for World Cup races in Winterberg, Germany, but may compete in U.S. World Cup luge events in Park City and Lake Placid, which are Olympic qualifiers. Other qualifying World Cups in cross-country and freestyle skiing run until mid-January in Canada, the U.S., Germany, Italy, and Switzerland. Neutral status is approved under IOC guidance for athletes who have not publicly supported the invasion or have ties to military or state agencies. FIS said it would demand strict neutrality toward Russia and Belarus. CAS judges ruled that Russian and Belarusian athletes meeting FIS eligibility standards should be allowed to enter international events, citing FIS statutes requiring political neutrality and protection from discrimination. Some Russian and Belarusian athletes competed at the Paris Summer Games without national identity, flag, anthem, or team colors, with both countries banned from team sports. The IOC must assess neutral status before inviting athletes to the Milan Cortina Games, and last week invited two Russian figure skaters and one Belarusian.",
        "image": "/images/russian_skiers_snowboarders_2025.webp",
        "slug": "cas-permits-russian-skiers-snowboarders-winter-olympics",
        "date": "02, December 2025",
        "author": "Sophie Langford"
    },
    {
        "category": "sports",
        "title": "Behind the scenes of Cortina’s trailer-park Olympic Village: 400 mobile homes in an Alpine valley",
        "shortdescription": "The Cortina Winter Olympics will host athletes in a unique village of 400 mobile homes set in an Alpine valley, offering a behind-the-scenes look at the unconventional accommodation.",
        "description": "The Winter Olympians who have signed up to stay in Cortina d’Ampezzo’s Athletes Village should not expect luxury accommodations or a cozy fire to snuggle up next to after a long day on the mountain. The temporary Village that will house up to 1,400 athletes and other team members during the Feb. 6-22 Milan Cortina Games consists of 377 rented mobile homes arranged in close proximity to one another on a humid valley floor. The Associated Press was the first international media outlet allowed in for an early look at the facility, which is in an unpopulated area about a 10-minute drive or 1-hour walk north of downtown Cortina. “It’s located in a very quiet area of Cortina, where you have the opportunity to hear the sound of the mountains, isolate yourself if you wish, concentrate if you desire, or go out for a pleasant workout,” said Fabio Saldini, the Italian government commissioner overseeing infrastructure for the games. “The beauty of a Village like this lies in the fact that everything will be removed afterward. Nothing is permanent; the environment will not return to its previous state but will be improved,” Saldini added. “This is a temporary village, but of high design.” Providing lodging for athletes is one of the most important responsibilities for Olympic organizers. It’s particularly challenging for the geographically dispersed Milan Cortina Games. Cortina’s trailer park is one of the two main Olympic villages — the other one is in Milan. Winter sports powerhouse Norway has chosen to house its skiers in hotels rather than in the official Olympic villages, according to Norwegian news agency NTB. Many other nations like the U.S. and Germany, plus host Italy, said their athletes will stay in the villages, though it’s unlikely Alpine superstars Lindsey Vonn or Mikaela Shiffrin will stay in the mobile home park in Cortina. Cortina will host women’s Alpine skiing, curling, bobsled, luge and skeleton during the games. The Village will also be essential for the Paralympics, which will be held March 6-15. “Most of the nations will use the Village — both for the living part and above all for the common areas like the gym,” Saldini said. “Even those staying outside the Village will come here.” Each trailer is divided into two rooms, with up to two people in each room. Every room has its own bathroom and shower. But open the trailer door and athletes could be met with a biting wind each morning — or they might be treated to unforgettable images of the sun lighting up and reflecting off jagged mountain peaks. Warm boots — not slippers — might be the best attire for the walk to the big cafeteria for breakfast. Anyone staying in trailers near the outskirts of the 1.4-kilometer long (nearly mile-long) Village will have a 10-minute walk to the common areas — which also include a gym, game room, offices, relaxation areas and a laundromat. A snowstorm made for blizzard-like conditions during AP’s visit in late November, without any permanent buildings to block the wind. February, though, brings more hours of sunlight to the area. The altitude at the Village area is 1,292 meters (4,239 feet) — slightly higher than in downtown Cortina. “There’s just the forest here,” said Paride Casagrande, the Village’s construction manager. “The wind is an element. But it doesn’t blow all day long every day. It depends on the day. There could be very cold days and there could be very comfortable days. But the fact remains that we’re in a natural area where it’s cold.” When organizers of the Paris Summer Olympics announced that they would not provide air conditioners in the Athletes Village, the U.S. and other teams brought their own machines — undercutting plans to cut carbon emissions. Nobody should have to bring their own climate-controlling machines this time. Every room in the Cortina Village has its own heating controls. A thermostat regulates a heating unit mounted on the wall and there’s also an infrared panel on the ceiling that helps maintain the temperature — both run on electricity. “Without much power, the temperature can be brought up to 25-26 degrees Celsius (77-79 Fahrenheit), which should be all that’s necessary,” Casagrande said. “But it’s all subjective, considering that I’ve been seeing athletes walking around outside in their underwear even though it’s snowing out,” Casagrande added, referring to sliding competitors in town for a test event. “The choice is up to the athletes.” Every mobile home sits on at least two wheels, used only for positioning, not transport, Casagrande said. The homes were brought to Cortina by oversize-load trucks. All of the rooms are about 18 square meters (200 square feet), with one of the two rooms in each mobile home slightly larger than the other to accommodate Paralympians. The rooms for Paralympians also have handicap-accessible showers, toilets and beds. The total cost for the Village is 38 million euros ($44 million). While the mobile homes are being rented, it would cost up to 80,000 euros ($93,000) to buy one. After the Olympics and the Paralympics, the mobile homes will be re-used at camping sites around Italy, with some of them already destined for a hockey club in nearby Brunico. The bigger buildings — also temporary — for the cafeteria, gym and other common areas are already being heated by a thermal power plant running on natural gas that also warms the Village’s water supply. Air handling units placed on top of the buildings regulate the air. Trees were cut down to set the Village up, drawing some protests from climate activists. “Most of them were already dead,” Casagrande said. “But we’ve also brought in new plants and (trees). … This is a natural park and we’re going to leave it just as we found it.”",
        "image": "/images/cortina_olympic_trailer_village_2025.webp",
        "slug": "cortina-olympic-village-trailer-park",
        "date": "30, November 2025",
        "author": "Sophie Langford"
    },
    {
        "category": "sports",
        "title": "Austin McNamara’s rise as Jets’ punting ‘sniper’ began by watching YouTube videos as a kid",
        "shortdescription": "Jets punter Austin McNamara honed his skills from a young age by studying YouTube videos, shaping his rise as a precise and impactful player in the NFL.",
        "description": "Austin McNamara’s journey to becoming one of the NFL’s top young punters began on a computer screen. The New York Jets' first-year standout loved playing soccer and basketball while growing up in Gilbert, Arizona, but never participated in organized football until high school. That’s when McNamara thought, just for kicks, he’d give a new sport a try. And with his soccer background, McNamara had an idea where he’d be best suited on the football field. “I knew kicking would come a little more natural for me,” McNamara said. “And it did. I think it clicked right away.” But not before McNamara and his father Brian spent countless hours on YouTube watching videos of every kicker and punter they could find — college and NFL games, workout videos, whatever was available — with plenty of rewinding, pausing and rewatching in between. “Me and my dad, we really didn’t know where to start,” McNamara recalled. “We just Googled how to punt, how to kick. I think we probably Googled how to kick a field goal first because my first love is actually kicking field goals. That’s more fun because you score points. Punting, you don’t score points. So I was like, ‘Oh, I like field goals better.’” The 24-year-old McNamara is making his living these days by booming punts for the Jets. His 43.6-yard net average ranks seventh in the NFL and his 22 punts downed inside the 20-yard line is fourth. “He is a weapon and I call him a weapon,” coach Aaron Glenn said after McNamara had a season-high 49.5 net average in the Jets’ 27-24 win over Atlanta and downed three of his six punts inside the 20. “We call him our sniper,” Glenn added, “because he has the ability to flip the field for us at any given time.” McNamara’s consistency has some even mentioning him for Pro Bowl recognition. His EPA — expected points added, a statistic that measures how a punter’s performance impacts his team’s scoring potential — is 16.4, which leads the NFL and would be the highest by a Jets punter since Tru Media began tracking it in 2000. “I’m just trying to do my part and help the team out, put us in the best position possible to win,” he said. “It keeps me motivated, for sure.” McNamara has come a long way from those days as a young teenager studying every aspect of kicking he could: how to swing his leg on punts, where to hit the ball and all the footwork involved. He and his father also bought a few footballs and rigged their own kicking tee holder out of PVC pipes. “We just went out there and kind of messed around, and I just learned from there,” McNamara said. “I kind of fell in love with it.” His next big step came in December 2015 when he attended his first kicking camp. “That’s kind of when I learned and got some actual coaching, like, from an actual person,” McNamara said with a laugh. “Not just YouTube or just me and my dad trying to figure it out.” McNamara punted and kicked field goals throughout his four years at Highland High School while watching college and NFL games and focusing on the punters and kickers. And it paid off. He earned first team all-state honors after his senior year and was heavily recruited by Division I football programs as a punter before choosing Texas Tech over Arizona, Arizona State, Missouri, Nebraska and Utah State. McNamara ended his five-year career with the Red Raiders with a 45.91 punting average, the highest in school and Big 12 history. He also had the longest punt in Texas Tech history with an 87-yarder against West Virginia in 2020. Still, he went undrafted last year, was signed by Cincinnati as a free agent and was cut by the Bengals during training camp in August 2024. He went back home to continue training in Arizona, but had workouts with about a dozen teams over the next several months before the Jets signed him in March to compete for their punting job. “I was pretty confident in myself and I knew I’d get another shot,” McNamara said. “It was just a matter of when. I wanted to keep pursuing it and not give up on it right away. And so I’m glad I didn’t.” So are the Jets. New York released veteran Thomas Morstead during the offseason and signed both McNamara and Kai Kroeger to replace him despite neither ever having punted in a regular-season NFL game. McNamara won the job early in training camp and has been kicking himself ever since. “I feel great where I’m at,” McNamara said. “Obviously, I’m humbled and excited to keep it going and finishing strong.”",
        "image": "/images/austin_mcnamara_jets_2025.webp",
        "slug": "austin-mcnamara-jets-punting-sniper",
        "date": "04, December 2025",
        "author": "Travis Monroe"
    }
]