[
    {
        "category":"us",
        "title":"Gov. Walz denounces Trump for calling Minnesota’s Somali community ‘garbage’",
        "shortdescription":"Gov. Tim Walz condemned Donald Trump for referring to Minnesota’s Somali community as “garbage” during a recent speech. The governor called the remarks divisive and harmful to Minnesotans.",
        "description":"Democratic Gov. Tim Walz denounced President Donald Trump on Thursday for calling Minnesota’s Somali community “garbage” and dismissing the state as a “hellhole.” Walz said Trump slandered all Minnesotans and that his expressions of contempt for the state’s Somali community — the largest in the U.S. — were “unprecedented for a United States president. We’ve got little children going to school today who their president called them garbage.” Republican legislative leaders stopped short of accepting the governor’s invitation to join him in condemnation, and countered that the dispute wouldn’t have erupted if Walz had acted more effectively to prevent fraud in social service programs. What Trump has said about Somali people Trump’s rhetoric against Somalis in the state has intensified since a conservative news outlet, City Journal, claimed last month that taxpayer dollars from defrauded government programs have flowed to the Somali militant group al-Shabab, an affiliate of al-Qaida. On Thanksgiving, Trump called Minnesota “a hub of fraudulent money laundering activity” and said he was terminating Temporary Protected Status for Somalis in Minnesota, a legal safeguard against deportation for immigrants from certain countries. The president went further Tuesday, saying at a Cabinet meeting that he did not want immigrants from the war-torn East African country to stay in the U.S. “We can go one way or the other, and we’re going to go the wrong way if we keep taking in garbage into our country,” he said. And Trump kept it up Wednesday, saying Minnesota had become a “hellhole” because of them. “Somalians should be out of here,” he told reporters. “They’ve destroyed our country.” Immigration enforcement in Minnesota Federal authorities have prepared an immigration enforcement operation in Minnesota this week that a person familiar with the planning said would focus on Somalis living unlawfully in the U.S. A congressional report put the number of Somalis with protected status at around 700 nationwide. Within that, Walz estimated the number of Minnesota Somalis to be around 300. Walz and community leaders said they didn’t have figures on how many people might have been detained in recent days. The Immigration and Customs Enforcement press office did not reply to requests for details Wednesday or Thursday. The Minneapolis-St. Paul area is home to about 84,000 people of Somali descent, who make up nearly one-third of the Somalis living in the U.S. Almost 58% of the Somalis in Minnesota were born in the U.S., and 87% of the foreign-born Somalis in Minnesota are naturalized U.S. citizens. Uncertainty around fraud in government programs It’s unclear how much loss there’s been due to fraud schemes against government programs in Minnesota. Many but not all of the defendants in those cases are Somali Americans, and most are U.S. citizens. Federal prosecutor Joe Thompson — who led the investigation into the $300 million Feeding Our Future scandal, which has led to charges against 78 people — estimated in an interview with KSTP-TV this summer that the total across several programs could reach $1 billion. Walz said an audit due for completion by late January should give a better picture, but allowed that the $1 billion figure “certainly could be” accurate. He said his administration is taking aggressive action to prevent additional fraud. Republicans are treading lightly “Demonizing an entire group of people by their race and their ethnicity, a very group of people who contribute to the vitality — economic, cultural — of this state is something I was hoping we’d never have to see. This is on top of all the other vile comments,” Walz told reporters during a briefing on the state’s budget. Republican Minnesota House Speaker Lisa Demuth, who is running for governor and has said she hopes to win Trump’s endorsement, hedged when asked if she would condemn the president’s remarks, too. “In no way do I believe any community is all bad. Just like I don’t believe any community is all good,” Demuth said. “What we need to do is call the fraudsters in any community accountable for their actions and stop it here in the state of Minnesota.” GOP state Sen. Eric Pratt, who is running for the suburban congressional seat being vacated by Democratic U.S. Rep. Angie Craig, went a little further. “It wasn’t said the way that I would have said it,” Pratt said. “But what I will say is, I share the president’s frustration in the amount of fraud and corruption that’s effectively gone on in the state. I mean, it’s really put a black eye on the state, and we are in the national news for all the wrong reasons.” Lawmakers in Ohio speak out The president’s attacks also drew condemnations Thursday from lawmakers in Ohio, which has the second-largest Somali population in the U.S. “Our Somali neighbors deserve to live in a state where they are respected for their contributions and not singled out by divisive commentary,” said state Rep. Terrence Upchurch, president of the Ohio Legislative Black Caucus. “President Trump’s comments about Somali immigrants are xenophobic, dangerous and wholly unacceptable from any public official, let alone the President of the United States,” the Ohio Jewish Caucus said in a separate statement.",
        "image":"/images/walz-trump-somali-remarks.webp",
        "slug":"walz-denounces-trump-somali-community-remarks",
        "date":"05, December 2025",
        "author":"Marcus Bennett"
    },
    {
        "category":"us",
        "title":"Immigration crackdown in New Orleans has a target of 5,000 arrests. Is that possible?",
        "shortdescription":"New Orleans officials aim for 5,000 immigration-related arrests amid a renewed crackdown. Experts question whether the city has the resources to meet such an ambitious target.",
        "description":"Trump administration officials overseeing the immigration crackdown launched this week in New Orleans are aiming to make 5,000 arrests, a target that some city leaders who oppose the operation say is unrealistic and would require detaining more than just violent offenders. It’s an ambitious goal that would surpass the number of arrests during a two-month enforcement blitz this fall around Chicago, a region with a much bigger immigrant population than New Orleans, and records tracking the first weeks of the Chicago operation also showed most arrestees didn’t have a violent criminal record. In Los Angeles — the first major battleground in President Donald Trump’s aggressive immigration plan — roughly 5,000 people were arrested over the summer in an area where about a third of LA County’s roughly 10 million residents are foreign-born. “There is no rational basis that a sweep of New Orleans, or the surrounding parishes, would ever yield anywhere near 5,000 criminals, let alone ones that are considered ‘violent’ by any definition,” New Orleans City Council President J.P. Morrell said Thursday. Census Bureau figures show the New Orleans metro area had a foreign-born population of almost 100,000 residents last year, and that just under 60% were not U.S. citizens. “The amount of violent crime attributed to illegal immigrants is negligible,” Morrell said, noting crime in New Orleans is at historic lows. Violent crimes, including murders, rapes and robberies, have fallen by 12% through October compared to a year ago, from 2,167 violent crimes to 1,897, according to New Orleans police statistics. Federal agents in marked and unmarked vehicles began spreading out across New Orleans and its suburbs Wednesday, making arrests in home improvement store parking lots and patrolling neighborhoods with large immigrant populations. Alejandra Vasquez, who runs a social media page in New Orleans that reports the whereabouts of federal agents, said she has received a flood of messages, photos and video since the operations began, saying her heart is broken because agents are taking working people and families rather than criminals. Several hundred agents from Customs and Border Protection and Immigration and Customs Enforcement are participating in the two-month operation dubbed “Catahoula Crunch.” U.S. House Speaker Mike Johnson, of Louisiana, is among Republicans supporting the crackdown, saying Democrats’ sanctuary city policies have failed and that residents deserve better. About two dozen protesters were removed from a New Orleans City Council meeting Thursday after chants of “Shame,” with police pushing or carrying some protesters out. Planning documents obtained by the Associated Press show the operation covers southeast Louisiana and parts of Mississippi. Homeland Security spokesperson Tricia McLaughlin said agents are targeting immigrants released after arrests for violent crimes and claimed arrests already include individuals with records of homicide, kidnapping, child abuse, robbery, theft and assault, though officials have not provided arrest numbers. She told CNN that efforts would continue “whether that will be 5,000 arrests or beyond.” Immigrant rights groups fear the only way to reach that goal is to target a broader group, and New Orleans City Council member Lesli Harris said there are nowhere near 5,000 violent offenders in the region. She said instead mothers, teenagers and workers are being detained during routine check-ins or at homes and workplaces, calling immigration violations civil matters that do not warrant disruptive mass arrests. During the “Operation Midway Blitz” crackdown in Chicago that began in September, immigration agents arrested more than 4,000 people across the city and suburbs, including parts of Indiana. While officials touted arrests of violent offenders, public records show that of about 1,900 arrested from early September to mid-October, only around 300 — roughly 15% — had criminal convictions, mostly traffic offenses, misdemeanors or nonviolent felonies, according to ICE data analyzed by the University of California Berkeley Deportation Data Project. New Orleans, historically shaped by French, Spanish, African and Native American cultures, has recently seen new immigration from Central and South America and Asia. Across Louisiana, there were over 145,000 foreign-born noncitizens according to the Census Bureau, and Pew Research Center estimated about 110,000 residents in the state were living in the U.S. illegally in 2023.",
        "image":"/images/new-orleans-immigration-crackdown.webp",
        "slug":"new-orleans-immigration-crackdown-5000-arrests",
        "date":"05, December 2025",
        "author":"Marcus Bennett"
    },
   {
        "category":"us",
        "title":"Michigan Supreme Court considers limits on courthouse immigration arrests",
        "shortdescription":"The Michigan Supreme Court is weighing whether to restrict immigration arrests in courthouses. The case addresses concerns about access to justice and public safety.",
        "description":"Law enforcement would be barred from making civil arrests — including immigration arrests of suspected noncitizens — in state and local courtrooms under a proposal being considered by the Michigan Supreme Court. The proposed rule change announced last month would prohibit civil arrests of people attending a court proceeding or having legal business in any of Michigan’s trial or appellate courthouses, without interfering with criminal or court-ordered arrests. If adopted, the amendment would align Michigan with states like New York, Connecticut and Illinois that have attempted to limit immigration arrests in local courts amid increased enforcement under President Donald Trump’s administration. While states cannot regulate federal immigration courts, advocates argue such restrictions in state courts prevent immigrants from avoiding hearings out of fear. “It’s an issue that affects everyone when you have any part of the population that is afraid to come and participate in our court proceedings,” said Susan Reed of the Michigan Immigrant Rights Center. The Trump administration has challenged similar state policies as “sanctuary” rules, but without success. The timing comes as immigration arrests have increased, with one analysis showing 2,388 likely arrests in federal immigration courts nationwide between May and July 2025, including nine in Detroit. Courthouse arrests remain relatively uncommon for people with no criminal history, but incidents — including one in Plymouth where a U.S. citizen was mistakenly detained — have raised concerns. Reed and ACLU of Michigan director Loren Khogali argue that even the presence of ICE can deter people from testifying or seeking court protection for issues like domestic violence or child custody, undermining court operations. Supporters say a rule would reduce fear and keep state courts focused on state matters. Meanwhile, the case for federal courthouse enforcement has shifted under Trump, who reversed Biden-era protections in schools, hospitals and courthouses. New guidance instructs ICE officers to pursue civil enforcement when credible information indicates a target will be present, preferably in non-public areas and in coordination with court security. Using courthouses can reduce risks because entrants are screened for weapons, ICE Acting Director Todd Lyons said. The Department of Homeland Security reported it was on pace to deport 600,000 people by the end of Trump’s first year back in office, with more than 65,000 held in detention as of mid-November. Other states have moved similarly: New York’s 2020 law limits civil arrests in courthouses to cases where federal agents have a criminal warrant or judge’s order, surviving a Trump administration lawsuit claiming it obstructed lawful enforcement. Illinois approved a similar ban in October, including a process allowing residents to sue agents who violate rights, while Connecticut passed legislation expanding civil arrest restrictions and restricting face coverings in court. In Michigan, the Supreme Court — where six of seven justices were appointed or nominated by Democratic governors — is now collecting public comments through Dec. 22. Justice Brian Zahra, the lone Republican nominee, opposed even publishing the proposal for comment. A public hearing is planned, and the court may adopt the rule as written, modify it, or reject it entirely. Of nearly 500 comments submitted by Dec. 1, most support the rule, citing fears that federal enforcement deters people from accessing the justice system. “When people are too afraid to enter the courthouse, they lose access to justice and the entire system suffers,” Michigan attorney Jeremy Orr wrote. Opponents argue that state courts should not interfere with federal immigration enforcement, saying immigration law must be followed uniformly. “Come here legally or ICE will see you to the door,” wrote commenter Victoria Muterspaugh.",
        "image":"/images/michigan-courthouse-immigration-arrests.webp",
        "slug":"michigan-court-limits-courthouse-immigration-arrests",
        "date":"05, December 2025",
        "author":"Travis Monroe"
    },
   {
        "category":"us",
        "title":"A county jail in Arkansas produces hundreds of ICE arrests under a program surging across the US",
        "shortdescription":"An Arkansas county jail is generating hundreds of ICE arrests through a rapidly expanding federal partnership program. Supporters call it effective, while critics warn of civil rights concerns.",
        "description":"ROGERS, Ark.  — She was already separated from her husband, the family breadwinner and father of her two youngest children, and had lost the home they shared in Arkansas. Then Cristina Osornio was ensnared by the nation’s rapidly expanding immigration enforcement crackdown just months after her husband was deported to Mexico. Following a traffic stop in Benton County, in the state’s northwest corner, she was jailed for several days on an Immigration and Customs Enforcement hold, records show, even though she is a legal permanent U.S. resident and the mother of six children. Best known as home to Walmart headquarters, the county and the wider region have emerged as a little-known hot spot in the Trump administration’s crackdown, according to an Associated Press review of ICE arrest data, jail records, police reports and interviews with residents, immigration lawyers and watchdogs. The county offers a window into what the future may hold in places where local and state law enforcement authorities cooperate broadly with ICE, as the Department of Homeland Security offers financial incentives in exchange for help making arrests. The partnership in Arkansas has led to the detention and deportation of some violent criminals but also repeatedly turned misdemeanor arrests into the first steps toward deportations, records show. The arrests have split apart families, sparked protests and spread fear through the immigrant community, including people born in Mexico, El Salvador, Guatemala, Honduras and the Marshall Islands. “Nobody is safe at this point because they are targeting you because of your skin color,” said Osornio, 35, who was born in Mexico but has lived in the U.S. since she was 3 months old. Her odyssey began in September, when an officer in the city of Rogers cited her for driving without insurance and with a suspended license, body cam video shows. She was arrested on a warrant for missing a court appearance in a misdemeanor case and taken to the Benton County Jail, where an ICE hold was placed on her. After four days behind bars, she said she was released without explanation. She called it a “very scary” experience that exacerbated her health conditions. More than 450 people were arrested by ICE at the Benton County Jail from Jan. 1 through Oct. 15, according to ICE arrest data from the University of California Berkeley Deportation Data Project analyzed by AP. That’s more than 1.5 arrests per day in the county of roughly 300,000 people. Most of the arrests were made through the county’s so-called 287(g) agreement, which allows deputies to question people booked into the jail about their immigration status. Benton County’s program accounted for more than 4% of roughly 7,000 arrests nationwide under similar programs during the first 9½ months of this year, data shows. Under the program, deputies alert ICE to inmates suspected of being in the country illegally, who are usually held without bond and eventually transferred into ICE custody. After a couple of days, they are often moved to the neighboring Washington County Detention Center in Fayetteville, which holds detainees for ICE, before being taken to detention centers in Louisiana and possibly deported. ICE now has more than 1,180 cooperation agreements with state and local law enforcement agencies, up from 135 at the start of the administration, and has offered payments to cover training, equipment and salaries in some circumstances. Arrests under the programs have surged as more agencies sign on, particularly in Republican-led states such as Florida. Earlier this year, Arkansas Gov. Sarah Huckabee Sanders signed a law requiring all county sheriffs to cooperate with ICE through 287(g) or other expedited detention programs. Benton County’s partnership with ICE has been controversial since its inception nearly 20 years ago. Arrests have shot up this year in the Trump stronghold, which has a large foreign-born population compared with the rest of Arkansas. About half of people arrested under the program have been convicted of crimes, while the other half have charges pending, but the severity varies widely. Jail records show recent ICE holds include people charged with forgery, sexual assault, drug trafficking, theft and public intoxication, with domestic violence and unsafe driving among the most common offenses. Local observers say they have tracked an increase in people facing ICE detention after traffic stops for violations such as driving without a license. “It just feels more aggressive,” said immigration attorney Nathan Bogart. “We’re seeing people detained more frequently on extremely minor charges. They’ve kind of just been let off the leash now.” County officials refused interview requests; Sheriff Shawn Holloway, a longtime champion of the program, did not respond. Body cam footage shows Officer Myles Tucker pulled Osornio over on Sept. 15 as she drove to a bank to get change for her job at Five Below. Tucker said her insurance was unconfirmed and she made a suspicious turn. He cited her for lacking insurance and driving with a suspended license, and learned she had a warrant related to a 2023 domestic violence case involving her husband. Osornio denied missing a court date and explained she had childcare difficulties due to her husband’s deportation. During the drive to jail, Tucker played Christian music and asked where she was born, saying it was required for jail paperwork. Osornio said she offered to show her residency and Social Security cards but was told to wait for an immigration agent who never appeared. Instead, she was told the ICE hold was lifted. In interviews, nonwhite residents said they fear driving in northwest Arkansas regardless of their legal status, leaving home only for work and relying on delivery services. Ernesto, a 73-year-old custodian from Venezuela whose asylum status was recently revoked, said he has seen people taken away during traffic stops. “Don’t just pull over people because they’re Latino or a foreigner,” he said. Attorney Lilia Pacheco said enforcement has intensified dramatically compared to the first Trump administration. She said her husband was recently pulled over despite obeying traffic laws and let go without explanation, prompting the family to install a dashboard camera for protection. Many immigrants from Mexico’s Guanajuato state fear cartel violence if deported, while those from El Salvador fear mass detentions, she said. Osornio’s husband, Edwin Sanchez-Mendoza, was arrested in September 2024 on misdemeanor charges after allegedly striking a teenage stepson. He said he acted in self-defense and believed the teen called police because he feared deportation. Sanchez-Mendoza was placed on an ICE hold; charges were dropped after he was transferred in January 2025. He later agreed to deportation due to poor conditions at the Louisiana ICE facility and now lives on his family’s farm in Mexico. His absence has devastated the family. Their daughter points at construction sites saying, “Look, Mom, Daddy’s working there.” Osornio lost their home and has struggled to pay rent and bills despite working retail. She suffered a stroke days after her release from jail and is receiving help from a local advocacy group and GoFundMe. Her husband wants her to move to Mexico, but she fears cartel violence and does not want to uproot her children from the only home they’ve known. She is awaiting her new permanent residency card. “Obviously over there it’s the cartels. But here now the scare is with immigration,” she said. “Now we don’t know even if we are safe here anymore. Ever since that happened to me, I don’t go anywhere. I don’t go out of my house.”",
        "image":"/images/arkansas-ice-arrests.webp",
        "slug":"arkansas-county-jail-ice-arrests-program-surge",
        "date":"05, December 2025",
        "author":"Marcus Bennett"
    },
   {
        "category":"us",
        "title":"Trump’s immigration message is colliding with his welcome to World Cup fans",
        "shortdescription":"Donald Trump’s hardline immigration message is clashing with efforts to welcome international fans arriving for the World Cup. The tension highlights contradictions in his broader public outreach.",
        "description":"WASHINGTON  — President Donald Trump will take center stage at Friday’s World Cup draw in Washington, rolling out the welcome mat for teams and fans from around the globe at a time when his administration is expanding restrictions on travel to the United States for people from 19 countries and he has hardened his rhetoric against immigrants. The administration is betting that its push to expedite visa processing for visitors and excitement about the matchups for next summer’s tournament — hosted by the United States, Canada and Mexico — will outweigh concerns that Trump’s immigration messaging undercuts the World Cup’s theme of global unity. In the past week, Trump has said he wants to permanently pause immigration from poor countries and has singled out Afghans and Somalis for contempt. He is also overseeing the signing of a peace agreement between Rwanda and Congo and is expected to be honored by FIFA for peacemaking efforts during the draw. Critics, including Sen. Chris Van Hollen, say Trump represents the opposite of what the World Cup stands for, while Andrew Giuliani, executive director of the White House FIFA task force, dismissed concerns about Trump’s rhetoric, calling him a blunt-speaking New Yorker. The administration is preparing to expand a travel ban that bars entry to citizens from 12 countries and imposes heightened restrictions on visitors from seven others, affecting two World Cup qualifiers — Iran and Haiti. While athletes, coaches and essential support personnel are exempt, fans from banned nations cannot enter the U.S. Iran has said it will boycott the draw after visas were denied to key officials, although its coach will attend. The State Department said it supports the World Cup while upholding national security. Giuliani emphasized that visa decisions are based on security and noted that some Iranian delegation members were approved while others were not, despite earlier assurances from FIFA President Gianni Infantino that visas would not be an issue. The White House is promoting efforts to reduce visa wait times for tournament attendees, with more than 400 additional consular officers deployed worldwide and a new “FIFA Pass” system for expedited visa appointments. Rep. Darin LaHood said the administration is working to make the event accessible and that sports transcend politics. Yet concerns persist as the administration’s immigration crackdown looms over preparations. During the Club World Cup this summer, social media warnings about immigration agents at matches alarmed organizers, though Giuliani said security would be routine. He also noted that Trump does not rule out any measure that enhances safety, raising questions about potential immigration enforcement at World Cup events. Fans from Haiti, which qualified for the first time in 50 years, are already grappling with the reality that they likely will not be allowed to attend. Rich André of the American Immigration Council said Haitians are eager to support their team but will probably be unable to enter the U.S., adding that the tournament cannot fully succeed without the presence of fans.",
        "image":"/images/trump-world-cup-immigration.webp",
        "slug":"trump-immigration-message-world-cup-fans",
        "date":"05, December 2025",
        "author":"Jenna Whitmore"
    },
   {
        "category":"us",
        "title":"Jo Ann Allen Boyce, who wrote a book about her experience integrating Clinton High School, has died",
        "shortdescription":"Jo Ann Allen Boyce, one of the Clinton 12 who helped integrate Clinton High School, has died. She later chronicled her historic experience in a widely respected memoir.",
        "description":"Jo Ann Allen Boyce, a member of the historic “Clinton 12” who helped integrate Clinton High School in Tennessee, died Wednesday at her Los Angeles home at age 84. Her daughter, Kamlyn Young, said Boyce died from pancreatic cancer, which she had lived with for a decade. Clinton High School was integrated in 1956, two years after the Brown v. Board of Education ruling and a year before the crisis at Little Rock Central High. Unlike the carefully selected Little Rock Nine, the Clinton 12 were simply the Black students who lived within the school district. As a 14-year-old, Boyce was excited to attend the previously all-white school she once had to walk past on her way to a segregated school in Knoxville. But integration sparked fierce resistance from local white residents, the Ku Klux Klan and outside segregationists, leading to violent protests and the National Guard’s deployment. Boyce later recalled that while the first day was calm, by midweek the crowds grew hostile and frightening. Inside the school, some children were kind or neutral, and she was even elected vice president of her homeroom, but others harassed the Black students with slurs, signs and thrown objects, making it difficult for her to focus on schoolwork. After high school, Boyce briefly joined a female singing group and then built a long career as a pediatric nurse. She frequently spoke at schools about her experiences and co-authored the 2019 children’s book “This Promise of Change.” Although her family initially supported integration, escalating violence forced them to leave Clinton for Los Angeles in December 1956. Only two of the Clinton 12 ultimately graduated from the school. Despite the trauma, Boyce later said she hadn’t wanted to leave, believing in the importance of her role. Her daughter said Boyce was strong, determined and fueled by optimism. Boyce told friends that several former classmates who mistreated her later apologized, and she tried to forgive them. She wrote fondly about her childhood in Clinton, where she attended a Black primary school, participated in church music and performed in plays and talent shows. Boyce is survived by her sister Mamie Hubbard, three children and three grandchildren. Her grandson, actor Cameron Boyce, died in 2019 at age 20 from an epileptic seizure.",
        "image":"/images/jo-ann-allen-boyce.webp",
        "slug":"jo-ann-allen-boyce-obituary-clinton-high-integration",
        "date":"05, December 2025",
        "author":"Jenna Whitmore"
    },
   {
        "category":"us",
        "title":"Oklahoma university instructor on leave after failing Bible-based essay on gender",
        "shortdescription":"An Oklahoma university instructor was placed on leave after failing a student’s Bible-based essay on gender. The case has sparked debate over academic standards and religious expression.",
        "description":"An instructor at the University of Oklahoma has been placed on leave after a student complained that she received a failing grade on a paper that cited the Bible to assert that the “belief in multiple genders” was “demonic.” Samantha Fulnecky, 20, filed a complaint with the administration, the latest flashpoint in the ongoing debate over academic freedom on college campuses amid President Donald Trump’s push to end diversity, equity and inclusion initiatives, and restrict how campuses discuss issues of race, gender and sexuality. “OU remains firmly committed to fairness, respect and protecting every student’s right to express sincerely held religious beliefs,” the university wrote in an email on Wednesday. The school added that the failing grade — which was supposed to account for 3% of Fulnecky’s final grade — would not affect the junior’s academic standing. An investigation into Fulnecky’s discrimination complaint is still ongoing. The assignment was for a psychology class about lifespan development. Students were asked to write a 650-word response to an academic study that examined whether conformity with gender norms was associated with popularity or bullying among middle school students. “Society pushing the lie that there are multiple genders and everyone should be whatever they want to be is demonic and severely harms American youth,” she wrote. She argued that promoting the belief in multiple genders would lead society to move “farther from God’s original plan for humans.” The essays were graded out of 25 points, broken down by whether the student demonstrated an understanding of the article and addressed a specific aspect of the argument put forth. Fulnecky received zero points for her work. “Please note that I am not deducting points because you have certain beliefs,” the instructor wrote in feedback obtained by The Oklahoman. Instead, the instructor said the paper did “not answer the questions for the assignment.” The paper “contradicts itself, heavily uses personal ideology over empirical evidence in a scientific class, and is at times offensive” the criticism went on. A contact for the instructor, whose name has not been confirmed by the university, was not immediately available. Fulnecky’s complaint to the administration soon went viral after the school’s chapter of Turning Point USA, a conservative group founded by Charlie Kirk, who was assassinated in September, posted about Fulnecky’s experience on the social media site X. “Professors like this are the very reason conservatives can’t voice their beliefs in the classroom,” the group posted. Oklahoma Gov. Kevin Stitt appeared to affirm that perspective, posting on X that the situation was “deeply concerning.” “I’m calling on the OU regents to review the results of the investigation & ensure other students aren’t unfairly penalized for their beliefs,” he wrote. The firestorm comes after a professor at Texas A&M was fired earlier this year after a video where a student confronted the instructor over her teaching of issues related to gender identity in a class on children’s literature went viral. A university committee in late November ruled that the firing was without good cause, and flouted formal procedure. Since Trump took office, student affinity groups have shuttered campus offices and professors have altered curriculums. The president has also threatened federal funding for schools who don’t comply with standards for teaching, admissions and gender in sports supported by the administration. Both supporters and opponents of the Trump administration’s campaign say that freedom of speech is at stake.",
        "image":"/images/oklahoma-bible-gender-essay.webp",
        "slug":"oklahoma-instructor-leave-bible-gender-essay",
        "date":"04, December 2025",
        "author":"Claire Addison"
    },
   {
        "category":"us",
        "title":"Program gives high schoolers hands-on teaching experience, with hopes they stay in Nevada",
        "shortdescription":"A Nevada program offers high school students hands-on classroom teaching experience. Leaders hope it will inspire them to stay in-state and join the future educator workforce.",
        "description":"As an elementary school student, Daniela Gutierrez didn’t have a teacher who tried to get close and form a connection with her. That experience stayed with Gutierrez, now a senior at Mojave High School in North Las Vegas, and inspired her future aspirations. “Since I didn’t have great teachers, I thought I could make a great teacher toward other kids in the future,” she said. But Gutierrez isn’t waiting for college to start working toward that goal. The 18-year-old is enrolled in the Teacher Academy College Pathway Program, a new state-sponsored initiative teaching students what it takes to become a teacher. It includes internship opportunities, potential future college tuition reimbursements, and earning college credits during high school at far lower costs than at Nevada colleges or universities. The program was born from the Clark County Education Association’s (CCEA) push to expand the “grow-your-own-teacher” training efforts already offered in Clark County schools, arguing that existing programs weren’t producing enough teachers to meet Nevada’s needs amid ongoing teacher shortages. During the 2023 and 2025 legislative sessions, the union partnered with Assemblywoman Shea Backus (D-Las Vegas) on two bills (AB428 and AB462) that built out the teacher pipeline by creating the academy. The legislation requires the Clark County School District (CCSD) to offer the program at every high school with 250 or more students, excluding magnet schools, career and technical academies, and alternative schools. By The Nevada Independent’s count, that is 33 schools, but the district says the program is offered at 46 high schools, with an estimated 4,200 high schoolers on some form of teacher training track. CCEA Director of Strategic Policy Initiatives Brenda Pearson said the academy is modeled after programs at three of the district’s career and technical schools. “I reached out to those schools to say, ‘What do you have here that is going so well, and how can we duplicate what you’re doing in other schools, specifically in our Title I buildings where the students don’t have the same type of opportunities?’” Pearson said. Implementation is optional at other high schools and districts. Students must participate in the program for at least two years and can receive full college tuition reimbursement if they work at a Nevada public school for at least three years, or one-third reimbursement per year of service. AB428 allocated $10 million to the Office of the State Treasurer for tuition abatement. To receive reimbursement, students must complete the FAFSA, which requires a Social Security number. “The overarching goal is to really grow and mold our students to be the teachers they need to then come back and serve their community,” said teacher Sierra Whittemore, who oversees Mojave’s program and is a CCSD graduate. “When you have teachers that are reflective of the community they teach, it is so much more impactful than when you’re just plopping in a random person that has no ties to anything.” Under CCEA’s latest contract, the union pledged $2 million through the 2026-2027 school year to support students at select high schools, including Title I schools like Mojave, Desert Pines, Eldorado and Western. That support may include helping students pay class fees or providing tutoring. “These are working-class kids who need an opportunity, and we think that this is going to give them just that,” Pearson said. “They deserve that opportunity for upward mobility.” The program gives students an up-close view of the teaching profession. At Mojave, Gutierrez said she’s learning classroom management and student engagement techniques. She interns in third grade teacher Joy Ammogawen’s class at nearby Raul P. Elizondo Elementary School, less than a mile away. One of her favorite experiences was helping a small group of students during a test. “I felt so special to be there to be assisting them on how to do it and them asking me for help,” she said. She also sees the challenges, such as handling misbehavior, but says those difficulties don’t discourage her. Gutierrez plans to attend UNLV and become an elementary school teacher. “I’m not interested in doing anything else,” she said. “There’s nothing else that moves me.”",
        "image":"/images/nevada-teacher-pipeline.webp",
        "slug":"nevada-high-school-teaching-experience-program",
        "date":"04, December 2025",
        "author":"Claire Addison"
    },
   {
        "category":"us",
        "title":"Chile becomes latest country to ban smartphone use during class",
        "shortdescription":"Chile has become the latest country to impose a nationwide ban on smartphone use during class. The move aims to boost student focus and curb classroom distractions.",
        "description":"SANTIAGO, Chile  — Chile has passed a bill outlawing the use of mobile phones and other smart devices during classes at elementary and middle schools. The new law will take effect next year, making Chile the latest country to restrict smartphone use among young students to reduce its harmful effects and curb classroom distractions. Other nations with various levels of restrictions on smartphone use at schools include France, Brazil, Hungary, the Netherlands and China. “We are advancing a cultural change for children and adolescents who today, more than ever, need to see each other’s faces again, socialize during recess, and regain concentration to further boost learning,” Education Minister Nicolás Cataldo wrote on social media after the decision. The Senate already approved the school cellphone ban in principle earlier this year, but made several changes that were put to a vote late Tuesday in Chile’s lower house of Congress. After a debate, lawmakers overwhelmingly endorsed the updated legislation banning smartphone use during class hours — except during emergencies and for educational and other purposes specified under the law. The bill must be signed by President Gabriel Boric before taking effect nationwide at the start of the 2026 school year. In response to rising concerns about young people and their mental health, parents and teachers in Chile have lobbied for such a law for years, arguing that the use of smartphones impairs students’ learning and emotional development. A school in Santiago, Chile’s capital, this year launched a successful pilot program that blocks cellphone signals. More than half of all Chilean students reported digital devices disrupting their learning, according to the most recent international study by the Organization for Economic Cooperation and Development, which evaluates student academic performance.",
        "image":"/images/chile-smartphone-ban-class.webp",
        "slug":"chile-bans-smartphone-use-during-class",
        "date":"03, December 2025",
        "author":"Claire Addison"
    },
   {
        "category":"us",
        "title":"West Virginia again bans religious reasons for school vaccine exemptions",
        "shortdescription":"West Virginia has reaffirmed its ban on religious exemptions for school vaccine requirements. Officials say the policy protects public health and maintains high immunization rates.",
        "description":"The West Virginia Board of Education on Tuesday reinstated a school vaccination mandate after the state Supreme Court paused a lower court’s ruling that allowed parents to cite religious beliefs to opt out of shots required for their children to attend classes. The Supreme Court earlier Tuesday issued a stay in last week’s ruling by Raleigh County Circuit Judge Michael Froble in a class-action lawsuit. In issuing an injunction, Froble said children of families who objected to the state’s compulsory vaccination law on religious grounds would be allowed to attend school and participate in extracurricular sports. The Supreme Court halted Froble’s ruling pending resolution of appeals in the case. In light of that, the board said in a statement that it “is reinstating its directive to county boards of education not to accept religious exemptions to compulsory vaccination laws. This directive will be in effect until the Supreme Court issues further guidance.” The board further said its priority is to ensure compliance with the vaccine law “and safeguard the health and well-being of all students across West Virginia.” The board had suspended the vaccine mandate last week after Froble’s ruling, which said that a state policy barring parents from seeking religious exemptions violated the Equal Protection for Religion Act signed into law in 2023 by then-Republican Gov. Jim Justice. West Virginia was among just a handful of states that granted only medical exemptions from school vaccinations when Republican Gov. Patrick Morrisey issued an executive order in January allowing religious exemptions. In June, the board directed public schools to ignore Morrisey’s executive order. Two groups had sued over the order, saying the Legislature, not the governor, has the authority to make such decisions. Legislation that would have allowed religious exemptions was passed by the state Senate and rejected by the House of Delegates earlier this year. Froble said in his ruling that the failure of the legislation did not determine the application of the 2023 law and rejected the defendants’ argument that religious exemptions can only be created by legislative action. Morrisey spokesman Drew Galang said in a statement Tuesday night that the governor’s office is reviewing the Supreme Court’s order. Miranda Guzman and other parents sued the state and local boards of education and the Raleigh County schools superintendent. Guzman had obtained a religious exemption to the vaccine mandate from the state health department and enrolled her child in elementary school for the 2025-26 school year. But on June 17, Guzman received an email from the local school superintendent rescinding the certificate, according to the lawsuit. Last month, Froble certified the lawsuit as a class action involving 570 families who had sought and received religious exemptions in other parts of the state. He said the class action also applies to parents who seek religious exemptions in the future. West Virginia’s school vaccination policy long has been heralded by medical experts as one of the most protective in the country for children. State law requires children to receive vaccines for chickenpox, hepatitis B, measles, meningitis, mumps, diphtheria, polio, rubella, tetanus and whooping cough before starting school. At least 30 states have religious freedom laws, including one signed by Georgia’s governor in April. The laws are modeled after the federal Religious Freedom Restoration Act, signed in 1993 by then-President Bill Clinton, which allows federal regulations that interfere with religious beliefs to be challenged.",
        "image":"/images/west-virginia-vaccine-exemptions.webp",
        "slug":"west-virginia-bans-religious-vaccine-exemptions",
        "date":"03, December 2025",
        "author":"Claire Addison"
    },
   {
        "category":"us",
        "title":"With ‘Trump Accounts,’ your baby could qualify for $1,000. Here’s what to know",
        "shortdescription":"A proposed “Trump Accounts” program could give newborns up to $1,000 in government-seeded savings. Here’s what families need to know about eligibility and how it would work.",
        "description":"When the children of wealthy households leave the nest, they often benefit from their parents’ largesse in the form of a trust fund, while less affluent peers may receive nothing at all or even be expected to support their families when they become adults. But what if all children, regardless of their family’s circumstances, could get a financial boost when they turn 18? That’s the idea behind “Trump Accounts,” a lesser-known provision of President Donald Trump’s tax legislation. The bill, signed into law earlier this year, gives $1,000 to every newborn as long as their parents open an account. That money is invested in the stock market by private firms, and the child can access the funds when they turn 18. Parents of older children can also open accounts, but they won’t get the $1,000 bonus. Backers say it’s a way to bolster capitalism and help children from low-income households build wealth at a time when openly socialist candidates are growing more popular. The new program gives the $1,000 bonus only to babies born during the calendar years of the Trump administration. Thanks to a historic donation announced Tuesday by billionaires Michael and Susan Dell, some children 10 and under could receive $250 in seed money if their parents open an account, reserved for kids in ZIP codes with a median family income of $150,000 or less who won’t get the $1,000 from the Treasury. A Trump Account is a new savings tool where money is invested in the stock market on behalf of a child, who can’t access the money until age 18 and can only use it for specific purposes such as tuition, starting a business or a down payment on a home. After a parent opens an account, the U.S. Treasury will contribute $1,000 for newborns, with private banks and brokerages managing the money in U.S. equity index funds that charge no more than 0.10% annually. Parents can contribute up to $2,500 annually in pretax income, with employers, relatives, friends, local governments and philanthropic groups also allowed to contribute. Yearly contributions are capped at $5,000, though government and charitable contributions do not count toward that cap. To qualify for the $1,000 seed money, a baby must be a U.S. citizen, have a Social Security number, and be born between Jan. 1, 2025, and Dec. 31, 2028. Any parent can open an account regardless of immigration status. The money can’t be accessed before age 18 except in rare circumstances, and disbursements will be taxed. Children born before 2025 won’t qualify for the $1,000 but can still have accounts opened for them if they are under 18 and may receive the Dells’ $250 donation if they meet criteria. The accounts won’t be open for contributions until July 2026, but parents can sign up now by submitting IRS Form 4547, not yet available as of Tuesday. In May, parents who sign up will receive instructions to complete account setup, and starting in July, the White House will offer a website for registration. Supporters say the accounts introduce more Americans to investing and give even impoverished children a chance to build wealth, countering rising interest in socialism. About 58% of U.S. households held stocks or bonds in 2022, but the wealthiest 1% owned nearly half the stock value. Before Trump Accounts, California, Connecticut and D.C. piloted similar “baby bonds” programs aimed at children in poverty, foster care, or who lost parents to COVID-19, but those programs exclude wealthier kids and are managed by states rather than private firms. Critics argue the accounts do little to help children in their early years, when they most need support, and don’t make up for cuts the Trump administration and congressional Republicans made to programs like food assistance and Medicaid; Republicans created the accounts in the same tax bill that reduced spending for some of those programs. Critics also say Trump Accounts will widen the wealth gap because affluent families can afford the maximum pretax contributions and therefore reap the largest gains, while poorer families may contribute little or nothing. Assuming a 7% return, the $1,000 seed money would grow to roughly $3,570 over 18 years.",
        "image":"/images/trump-accounts-baby.webp",
        "slug":"trump-accounts-baby-1000-benefit",
        "date":"03, December 2025",
        "author":"Jenna Whitmore"
    },
   {
        "category":"us",
        "title":"Academic society bans Larry Summers for life over his close ties to Jeffrey Epstein",
        "shortdescription":"An academic society has issued a lifetime ban on Larry Summers, citing concerns over his previously reported associations with Jeffrey Epstein. The group said the decision reflects its ethical standards and member expectations.",
        "description":"Former U.S. Treasury Secretary Larry Summers was banned for life Tuesday from an academic society in the latest fallout over recently released emails showing he maintained a friendly relationship with Jeffrey Epstein after the disgraced financier pleaded guilty to soliciting prostitution from a minor. The American Economic Association, a nonprofit scholarly association dedicated to economic research, said it had accepted Summers’ resignation and banned him for life from “attending, speaking at, or otherwise participating” in its events. “The AEA condemns Mr. Summers’ conduct, as reflected in publicly reported communications, as fundamentally inconsistent with its standards of professional integrity and with the trust placed in mentors within the economics profession,” the group said in a statement. A spokesperson for Summers declined to comment. The Epstein emails include messages in which Summers appeared to be getting advice from Epstein about pursuing a romantic relationship with a woman who viewed him as an “economic mentor.” “im a pretty good wing man , no?” Epstein wrote on Nov. 30, 2018. The next day, Summers told Epstein he had texted the woman, telling her he “had something brief to say to her.” “Am I thanking her or being sorry re my being married. I think the former,” he wrote. Summers’ wife, Elisa New, also emailed Epstein multiple times, including a 2015 message in which she thanked him for arranging financial support for a poetry project she directs. After the emails came out last month, Summers went on leave from teaching at Harvard University and from his position as director of the Mossavar-Rahmani Center for Business and Government at the Harvard Kennedy School. Other organizations that ended their affiliations with Summers include the Center for American Progress, the Center for Global Development and the Budget Lab at Yale University. Epstein, who authorities say died by suicide in jail in 2019, was a convicted sex offender with vast connections to wealthy and powerful people, making him a fixture of outrage and conspiracy theories about wrongdoing among American elites. Summers served as treasury secretary from 1999 to 2001 under President Bill Clinton. He was Harvard’s president from 2001 to 2006. When asked about the emails last week, Summers issued a statement saying he has “great regrets in my life” and that his association with Epstein was a “major error in judgement.”",
        "image":"/images/larry-summers-ban.webp",
        "slug":"academic-society-bans-larry-summers-epstein-ties",
        "date":"03, December 2025",
        "author":"Jenna Whitmore"
    },
   {
        "category":"us",
        "title":"Missouri court orders new wording for ballot measure seeking to restrict abortion rights",
        "shortdescription":"A Missouri court has ordered revised wording for a ballot measure aimed at restricting abortion rights. Judges ruled the original language was misleading and required clearer phrasing.",
        "description":"A Missouri appeals court panel ordered new wording Thursday for a ballot measure seeking to roll back abortion rights in the state, ruling that voters must be told the amendment would repeal “reproductive healthcare rights” they approved just one year ago. The ruling is the latest twist in Missouri’s shifting abortion landscape since the U.S. Supreme Court overturned Roe v. Wade in 2022. That ruling triggered Missouri’s near-total abortion ban, but abortion-rights advocates gathered signatures to place a constitutional amendment on the 2024 ballot allowing most abortions, which voters narrowly approved. In response, the Republican-led Legislature placed a new amendment on the 2026 ballot that would repeal the 2024 measure and instead allow abortion only in cases of medical emergency or fetal anomaly, or in cases of rape or incest up to 12 weeks of pregnancy. The measure would also ban gender transition treatments for minors, which are already prohibited under state law. A judge struck down the Legislature’s ballot summary as insufficient and unfair, later approving a revision written by Republican Secretary of State Denny Hoskins. But the appeals court ruled that Hoskins’ version “falsely implies” the measure would create new guarantees of access to reproductive health care. The panel imposed new wording stating the proposal would “Repeal the 2024 voter-approved Amendment providing reproductive healthcare rights, including abortion through fetal viability,” while listing the limited circumstances in which abortions would still be allowed. Hoskins’ office declined to comment. Missouri Attorney General Catherine Hanaway said she disagreed with the decision to revise the wording but was pleased the court kept the measure on the ballot, saying it allows “the people, not partisan litigants,” to decide the issue. The American Civil Liberties Union, which helped bring the lawsuit, said the new summary makes clear that voters are being asked to end protections passed in the last election. Abortion-rights advocates won seven ballot measures and lost three nationwide during the 2024 elections. An abortion-rights amendment will be on the ballot next year in Nevada, and potentially Virginia.",
        "image":"/images/missouri-ballot-measure-abortion.webp",
        "slug":"missouri-court-orders-new-ballot-measure-wording-abortion",
        "date":"05, December 2025",
        "author":"Evan Carlisle"
    },
   {
        "category":"us",
        "title":"Abortion is illegal again in North Dakota after court reverses a judge’s earlier decision",
        "shortdescription":"Abortion is once again illegal in North Dakota after a court reversed an earlier ruling that had blocked the state’s ban. The decision allows the near-total restriction to take effect immediately.",
        "description":"Abortion is again illegal in North Dakota after the state’s Supreme Court on Friday couldn’t muster the required majority to uphold a judge’s ruling that struck down the state’s ban last year. The law makes it a felony crime for anyone to perform an abortion, though it specifically protects patients from prosecution. Doctors could face up to five years in prison and a $10,000 fine. Three justices agreed the ban is unconstitutionally vague under the state constitution, while the other two said it is not unconstitutional. Because the state constitution requires at least four of the five justices to agree in order to strike down a law, the lower court ruling could not be affirmed. In his opinion, Justice Jerod Tufte said the natural rights guaranteed by the 1889 constitution do not extend to abortion and that the law “provides adequate and fair warning to those attempting to comply.” North Dakota Republican Attorney General Drew Wrigley welcomed the decision, calling it an affirmation of “important pro-life legislation.” Republican state Sen. Janne Myrdal, who introduced the 2023 law, said she was “thrilled and grateful” that the court upheld it. Challengers called the ruling “a devastating loss for pregnant North Dakotans.” Meetra Mehdizadeh of the Center for Reproductive Rights said the ban is “cruel and confusing,” forcing doctors to choose between providing care and risking prison. Even after the judge struck down the law last year, abortions in North Dakota were already limited to life- or health-preserving circumstances in hospitals. The state’s only abortion provider relocated from Fargo to Moorhead, Minnesota, in 2022. Justice Daniel Crothers, one of the three judges who found the law unconstitutional, wrote that the district court ruling was not wrong, arguing that the law’s vagueness about when an abortion may be performed to preserve a mother’s life or health renders the remaining portions inoperable. North Dakota’s reinstated ban criminalizes abortion with exceptions only for rape or incest within the first six weeks of pregnancy—before many women know they are pregnant—and to prevent the mother’s death or a “serious health risk.” North Dakota now joins 12 other states enforcing full abortion bans and four more that prohibit abortion around six weeks. Judge Bruce Romanick had originally struck down the ban passed in 2023, shortly after Roe v. Wade was overturned, and the Red River Women’s Clinic along with several physicians challenged the law. During the appeal process, both the district judge and the Supreme Court refused to keep the ban in effect, allowing patients with pregnancy complications to receive care without legal delays.",
        "image":"/images/north-dakota-abortion-ruling.webp",
        "slug":"north-dakota-abortion-illegal-court-reversal",
        "date":"22, November 2025",
        "author":"Evan Carlisle"
    },
   {
        "category":"us",
        "title":"What would have been the most restrictive abortion bill in the US stalls in South Carolina",
        "shortdescription":"A proposal that would have created the most restrictive abortion law in the U.S. has stalled in South Carolina. Lawmakers failed to advance the measure amid internal divisions.",
        "description":"A South Carolina bill that would allow judges to sentence women who get abortions to decades in prison and could restrict the use of IUDs and in vitro fertilization has stalled after failing to get out of a legislative subcommittee Tuesday. Four of the six Republicans on the subcommittee refused to vote on the bill, which would ban all abortions unless the woman’s life is threatened. The three Democrats were then able to vote against sending the bill forward. The proposal is not dead, but the effort revealed a lack of support for the most extreme positions among groups opposing abortions. If the bill had been sent to the full Medical Affairs Committee, it would have gone further than any other such proposal across the U.S. since the Supreme Court overturned Roe v. Wade in 2022. In declining to vote, Republican state Sen. Jeff Zell said he wants to stop as many abortions as possible but that most people aren’t interested in such extreme positions, noting that other issues are more important to South Carolinians. “Say what you want. Play your politics. I’m not interested in that. What I’m interested in is speaking on behalf of South Carolinians and they’re not interested in this bill right now,” Zell said. South Carolina already bans abortions after cardiac activity is detected, typically six weeks into pregnancy, before many women know they are pregnant, and allows abortions for rape and incest victims up to 12 weeks. Tuesday’s vote followed two failed attempts to lessen or eliminate a proposal to punish a woman who gets an abortion and anyone who helps her with up to 30 years in prison. Another failed attempt sought to remove a provision making it a crime to tell someone where they could obtain an abortion or take them to a place where it is legal. The bill also appeared to ban any contraception that prevents a fertilized egg from implanting, effectively banning IUDs and potentially limiting IVF. Providing information about abortions would be illegal, leaving doctors worried they couldn’t advise patients about legal options. Republican Sen. Richard Cash, the bill’s sponsor and one of the chamber’s strongest anti-abortion voices, wanted to keep the criminal penalties, saying that before Roe v. Wade was overturned, abortion opponents did not fully consider the ramifications of banning abortion, including how to treat embryos. “We never even thought about it. And now we do,” Cash said. Abortion remains an unsettled issue in conservative states, and anti-abortion groups are divided on how far restrictions should go. South Carolina Citizens for Life said last month it can’t support Cash’s bill because women who get abortions are victims and shouldn’t be punished. On the other side, groups like Equal Protection South Carolina argue “Abortion is murder and should be treated as such,” founder Mark Corral said. Democratic Sen. Brad Hutto said he is glad the bill isn’t advancing because it had so many bad components, but he expects abortion to resurface when the General Assembly begins its 2026 session. “I say, if it’s January, there’s an abortion bill,” Hutto said.",
        "image":"/images/south-carolina-abortion-bill.webp",
        "slug":"south-carolina-abortion-bill-stalls",
        "date":"19, November 2025",
        "author":"Evan Carlisle"
    },
   {
        "category":"us",
        "title":"South Carolina looks at most restrictive abortion bill in the US as opponents keep pushing limits",
        "shortdescription":"South Carolina lawmakers are considering what could become the most restrictive abortion bill in the U.S. Opponents warn the proposal shows how far some are willing to push new limits.",
        "description":"Sending women who get abortions to prison for decades. Outlawing IUDs. Sharply restricting in-vitro fertilization. These are the strictest abortion prohibitions and punishments in the nation being considered by South Carolina lawmakers, even as opponents of the procedure are divided over how far to go. The bill faces a long legislative path and uncertain prospects, even if it clears the state Senate subcommittee reviewing it. But the measure up for a second hearing Tuesday would go further than any considered since the U.S. Supreme Court overturned Roe v. Wade in 2022, as abortion remains an unsettled issue in conservative states. The proposal would ban all abortions unless the woman’s life is at risk and would eliminate existing exceptions for rape and incest up to 12 weeks. Current law bans abortions after cardiac activity is detected, typically around six weeks, before many women know they are pregnant. The measure also goes further than any other U.S. state: women who get an abortion and anyone who helps them could face up to 30 years in prison. It appears to ban contraception that prevents a fertilized egg from implanting, which would outlaw IUDs and sharply limit IVF. Providing information about abortions would be illegal, leaving doctors worried they could not suggest legal options elsewhere. OB-GYN Natalie Gregory said the bill would turn conversations about contraception, pregnancy loss and IVF into a legal minefield that could put her at risk of decades in prison. “It constitutes a unconstitutional reach that threatens the very fabric of health care in our state,” she said during an eight-hour public hearing last month, calling the bill a waste of time and public money. The proposal has also split abortion opponents who once celebrated the state’s six-week ban passed in 2021. South Carolina Citizens for Life said it cannot support the bill because women who get abortions are victims and should not be punished. Groups like Equal Protection South Carolina take the opposite view: “Abortion is murder and should be treated as such,” founder Mark Corral said. Mary Ziegler, a UC Davis law professor and leading abortion scholar, said the divide stems from decades of messaging portraying abortion as murder while avoiding directly punishing women. She describes the most aggressive anti-abortion activists as “abolitionists,” saying their success in reshaping conservative laws and shifting political climates has emboldened them to push ideas lacking broad public support. “It’s not going to go away. The trajectory keeps shifting and the abolitionists have more influence,” she said. As broader political debates move rightward—over same-sex marriage, women working outside the home, and more—Ziegler said lawmakers find it easier to introduce restrictions unimaginable in previous years. “There is more breathing room for abolitionists now,” she said. A similar House bill last year received a hearing but stalled when Republican House leaders expressed satisfaction with existing law. The Senate is less predictable, with nine of its 34 Republicans elected after the current law was passed; three of them defeated the chamber’s only Republican women, the “Sister Senators” who helped block a stricter ban post-Roe. Republican Sen. Richard Cash, the bill’s sponsor and one of the Senate’s strongest anti-abortion voices, will lead Tuesday’s subcommittee hearing. He has acknowledged concerns about banning contraception and limiting medical advice but hasn’t indicated what changes he might consider. Six of the nine subcommittee members are Republicans. GOP Senate leaders have emphasized that there is no commitment to advance the bill even if the subcommittee approves it. “I can say this definitively — there has been not only no decision made to bring up that bill, there’s been no discussion about bringing up that bill,” Senate Majority Leader Shane Massey said.",
        "image":"/images/south-carolina-abortion-proposal.webp",
        "slug":"south-carolina-considers-strictest-us-abortion-bill",
        "date":"19, November 2025",
        "author":"Sophie Langford"
    },
   {
        "category":"us",
        "title":"Deadly Asian floods are no fluke. They’re a climate warning, scientists say",
        "shortdescription":"Scientists say recent deadly floods across Asia are not isolated events but clear signals of a warming climate. Rising temperatures are intensifying extreme rainfall and disaster risks.",
        "description":"Southeast Asia is being pummeled by unusually severe floods this year, as late-arriving storms and relentless rains wreak havoc that has caught many places off guard. Deaths have topped 1,400 across Indonesia, Sri Lanka, and Thailand, with more than 1,000 still missing in floods and landslides. In Indonesia, entire villages remain cut off after bridges and roads were swept away. Thousands in Sri Lanka lack clean water, while Thailand’s prime minister acknowledged shortcomings in his government’s response. Malaysia is still reeling from one of its worst floods, which killed three and displaced thousands, while Vietnam and the Philippines have faced a year of punishing storms and floods that have left hundreds dead. What feels unprecedented is exactly what climate scientists expect: a new normal of punishing storms, floods and devastation. “Southeast Asia should brace for a likely continuation and potential worsening of extreme weather in 2026 and for many years immediately following that,” said Jemilah Mahmood of the Sunway Centre for Planetary Health. Climate patterns last year helped set the stage for 2025’s extreme weather. Atmospheric carbon dioxide levels jumped by the most on record in 2024, “turbocharging” the climate, according to the U.N. World Meteorological Organization. Asia is warming nearly twice as fast as the global average, intensifying storms, floods and heat. Warmer oceans fuel stronger, wetter storms; rising seas amplify storm surges; and systems like El Niño extend typhoon seasons. “While the total number of storms may not dramatically increase, their severity and unpredictability will,” said Benjamin Horton of City University of Hong Kong. Governments across the region were unprepared. Aslam Perwaiz of the Asian Disaster Preparedness Center said unpredictable and frequent disasters overwhelm governments focused more on response than preparedness. In Sri Lanka’s hardest-hit provinces, conditions remain little changed since the 2004 tsunami that killed 230,000. Poor and marginalized communities—such as tea plantation workers in landslide-prone areas—suffer most, said human-rights researcher Sarala Emmanuel. Unregulated development worsening ecosystems has amplified flood damage, added Sandun Thudugala of the Law and Society Trust. Deforestation appears to have intensified Indonesia’s floods: Aceh, North Sumatra and West Sumatra have lost over 19,600 square kilometers of forest since 2000—larger than New Jersey—according to Global Forest Watch. Losses from climate disasters are immense. Vietnam estimates more than $3 billion in losses in the first 11 months of the year. Thailand has seen at least $47 million in agricultural losses and nearly $781 million from southern floods in November alone. Indonesia averages $1.37 billion in annual natural disaster losses. Sri Lanka, which emits little carbon but suffers severe climate impacts while repaying foreign loans, urgently needs compensation, Thudugala said. In Peradeniya, Sri Lankan business owner Rohan Wickramarachchi said he and others must start over after floods reached the second floor of his building. At the COP30 climate conference, countries pledged to triple funding for climate adaptation and make $1.3 trillion available annually by 2035, though it remains unclear if the money will materialize. “What we’re seeing in the region is dramatic and unfortunately a stark reminder of the consequences of the climate crisis,” said Thomas Houlie of Climate Analytics.",
        "image":"/images/asian-floods-climate-warning.webp",
        "slug":"asian-floods-climate-warning-scientists",
        "date":"03, December 2025",
        "author":"Sophie Langford"
    },
   {
        "category":"us",
        "title":"Heavy snow predicted for Northeast as Midwest still struggles with Thanksgiving weather snarls",
        "shortdescription":"Forecasters warn of heavy snow in the Northeast as the Midwest continues recovering from severe Thanksgiving travel disruptions. Weather officials urge caution amid lingering storm impacts.",
        "description":"Black ice, snow showers and fog pestered post-holiday travelers in the Midwest on Monday while the Northeast geared up for its first major snowstorm of the season. More than 8 inches (20.32 centimeters) of snow fell at Chicago O’Hare International Airport over the weekend, setting a record for the highest single calendar day snowfall in November at the airport, surpassing a 1951 record, according to the National Weather Service. About 300 flights into and out of O’Hare were canceled by early Sunday evening and around 1,600 were delayed, with disruptions continuing into Monday. Hazardous road conditions were expected well into Monday night. In the Northeast, parts of northern New England anticipated up to 10 inches (25.4 centimeters) of snow as a windy, potentially icy storm approached, bringing soaking rain to some areas and heavy snow to others. Winter storm warnings and advisories were issued across Massachusetts, New Hampshire, Vermont, Maine, Connecticut and New York. In Pennsylvania, plowable snow was expected across large parts of the state. Crews began treating lanes along the 565-mile (909-kilometer) Pennsylvania Turnpike system on Monday, with vehicle restrictions on many eastern interstates set to begin at 5 a.m. Tuesday. More than 600 operators and safety workers were available to clear the turnpike’s 2,900 miles (4,667 kilometers) of lanes. In Chicago, travelers like 76-year-old Don Herrian faced long delays as crowds packed into O’Hare after Thanksgiving. Roads around the airport were clogged with slow-moving traffic, and travelers filled gate areas, restaurants and even floor space as they waited. Planes were being de-iced at airports including Ronald Reagan Washington National Airport and Minneapolis–Saint Paul International Airport. In Iowa, gusty winds blew snow back onto roads Sunday, prolonging hazardous travel conditions, with some areas of Iowa and Illinois receiving over a foot of snow, meteorologist Andrew Orrison said. Snow in the Great Lakes region tapered off as the storm moved toward the mid-Atlantic and Northeast, where up to a foot (30 centimeters) was possible by Tuesday. “It’s going to be the first snowfall of the season for many of these areas, and it’s going to be rather significant,” Orrison said, noting major cities were not expected to see heavy accumulation. The National Weather Service warned coastal Maine residents to delay travel from Tuesday morning to Wednesday morning due to snow. In New Hampshire, the Department of Transportation invited residents to submit names for its annual name-a-plow competition, joking on social media: “Welcome to The Department of the Seven Snowplows, our winter twist on a classic tale. Hawthorne had gables. We have orange snowplows just waiting for the perfect name.” Last year’s winning name was Ctrl-Salt-Delete, with this season’s winners to be announced in January.",
        "image":"/images/northeast-midwest-weather.webp",
        "slug":"northeast-heavy-snow-midwest-thanksgiving-weather",
        "date":"02, December 2025",
        "author":"Sophie Langford"
    },
   {
        "category":"us",
        "title":"Air Force pilot safely ejects before F-16 fighter jet crashes in California desert",
        "shortdescription":"An Air Force pilot safely ejected before an F-16 fighter jet crashed in the California desert. Officials say the cause of the crash is under investigation.",
        "description":"A fighter jet with the Air Force’s elite Thunderbirds demonstration squadron crashed in the Southern California desert Wednesday, but the pilot ejected safely, the military said. The San Bernardino County Fire Department reported that the pilot was taken to a hospital with injuries that were not life-threatening. The F-16C Fighting Falcon went down around 10:45 a.m. during a training mission “over controlled airspace in California,” according to Nellis Air Force Base in Nevada. Fire crews responded to an “aircraft emergency” near Trona, an unincorporated Mojave Desert community about 180 miles (290 kilometers) north of Los Angeles. In 2022, a Navy F/A-18E Super Hornet crashed near Trona, killing its pilot. Wednesday’s crash is under investigation, with further details to come from the 57th Wing Public Affairs Office, the Air Force said. Like the Navy’s Blue Angels, the Thunderbirds perform tight formation flying at air shows, maneuvering within inches of one another. The Air Force statement gave no details on what caused the crash. Formed in 1953, the Thunderbirds train seasonally at Nellis Air Force Base near Las Vegas, home to F-16 Falcon and F-22 Raptor fighter jets as well as A-10 Warthog ground-attack aircraft.",
        "image":"/images/f16-california-crash.webp",
        "slug":"f16-crash-california-desert-pilot-ejects",
        "date":"04, December 2025",
        "author":"Travis Monroe"
    },
   {
        "category":"us",
        "title":"Philadelphia transit agency says it’s complying with orders to upgrade railcars implicated in fires",
        "shortdescription":"Philadelphia’s transit agency says it is complying with federal directives to upgrade railcars linked to past fires. Officials report the work is underway to ensure passenger safety.",
        "description":"Pennsylvania Gov. Josh Shapiro and leaders of Philadelphia’s mass transit agency said Monday that the system is fully complying with federal orders to take measures to help prevent fires in an aging electric railcar model that is heavily used in its regional rail fleet. The October order from the Federal Railroad Administration followed investigations into five fires this year involving the Silverliner IV passenger railcars used by the Southeastern Pennsylvania Transportation Authority, or SEPTA. Shapiro announced he is sending an extra $220 million in state aid to help SEPTA comply, and the agency said that beginning Monday, some of the roughly 225 Silverliner IV cars will return to service for the first time since October. “We cannot let SEPTA fail,” Shapiro said at SEPTA’s Frazer maintenance plant, emphasizing the system’s importance to the economy, communities and the entire state. SEPTA, one of the nation’s largest transit agencies with 800,000 daily riders, blames inadequate public funding for a backlog of more than $10 billion in upgrades. The Silverliner IV cars make up about two-thirds of SEPTA’s regional rail fleet and date back to the mid-1970s, making them the oldest cars in the oldest rail fleet in the country. SEPTA has completed federally ordered inspections and begun equipment upgrades, Shapiro said, with federal inspectors contributing hundreds of hours. Riders have endured weeks of delays, cancellations and crowding as SEPTA ran at about one-third capacity during inspections. The agency expects regional rail service to return to full strength by mid-December. The announcement comes months after the Republican-controlled Legislature blocked Shapiro’s earlier request for more transit aid, arguing that highways also need funding and that SEPTA must raise fares and improve accountability. The funding impasse led to a brief shutdown of some services, described by SEPTA as more drastic than any ever undertaken by a major U.S. transit agency, as it sought to address a deficit of more than $200 million. Shapiro said the new aid will pay for Silverliner IV upgrades, improvements to make inspections and maintenance easier, and the leasing or purchase of railcars from other systems. SEPTA estimates nearly $1 billion is needed to replace the Silverliner IV fleet and a 10-year timeline to design, procure and build new cars. But Shapiro said riders cannot wait a decade, and the state money — pulled from a flexible transit capital account — will ensure the aging cars remain safe as long as they are in use. Shapiro stressed that SEPTA must be ready for major events next year, including FIFA World Cup matches, the nation’s 250th birthday celebrations, the MLB All-Star Game, the PGA Championship and NCAA March Madness. The five fires forced evacuations of all passengers — including one incident involving as many as 350 people — with only minor injuries. One car was involved in two fires, and two others were destroyed, according to the National Transportation Safety Board. The incidents come as SEPTA and major U.S. transit systems fight for more funding amid rising costs and slow ridership recovery.",
        "image":"/images/philadelphia-transit-railcar-upgrade-fire-orders.webp",
        "slug":"philadelphia-transit-upgrades-railcars-fire-orders",
        "date":"25, November 2025",
        "author":"Travis Monroe"
    }
]