[
    {
        "category": "world",
        "title": "Israel says it will start letting Palestinians leave Gaza through reopened border crossing",
        "shortdescription": "Israel announced it will reopen the Rafah border crossing to allow Palestinians to leave Gaza Strip for Egypt — marking the first major opportunity for civilians to exit the enclave since access was cut off. Acceptance will require both Israeli and Egyptian security approval, and only exit (not return) appears permitted for now.",
        "description": "Israel on Wednesday said it will start letting Palestinians leave Gaza through a reopened border crossing, complying with a U.S.-backed ceasefire deal even though it also said that partial remains returned by militants did not match the hostages still in Gaza. The missing remains of the two hostages threaten to stall a ceasefire between Israel and Hamas in its first phase. But by promising to open the Rafah crossing, Israel showed it was moving ahead with parts of the plan. The first phase of the plan is supposed to wind down with the return of the two remaining hostages. Palestinian militants, who appear to be struggling to find the remains amid the rubble of war-torn Gaza, said they were searching again on Wednesday. Following the exchanges, the 20-point plan calls for creating an international stabilization force, forming a technocratic Palestinian government and disarming Hamas. The World Health Organization says there are more than 16,500 sick and wounded people who need to leave Gaza for medical care. Two hostage bodies are still in Gaza: Israeli Ran Gvili and Thai national Sudthisak Rinthalak. In a statement Wednesday, the Prime Minister’s Office said forensic testing showed that remains returned Tuesday did not match either. Saraya al-Quds, the military arm of Palestinian Islamic Jihad, said its militants were moving to northern Gaza Wednesday morning to search for the remains. The group said on its Telegram channel that the militants were accompanied by workers from the Red Cross. Gvili was an Israeli police officer who helped people escape from the Nova music festival on Oct. 7, 2023, and was killed fighting at another location. Sudthisak Rinthalak was an agricultural worker from Thailand who had been employed at Kibbutz Be’eri, one of the hardest-hit communities in the attack. A total of 31 workers from Thailand were abducted, the largest group of foreigners to be held in captivity. Most of them were released in the first and second ceasefires. The Thai Foreign Ministry has said in addition to the hostages, 46 Thais have been killed during the war. Hamas has yet to comment on the latest handover or the news about the missing remains. Twenty living hostages and the remains of 26 others have been returned to Israel since the ceasefire began in early October. Both Hamas and Israel have accused the other of breaking the ceasefire multiple times. Rafah to open in ‘coming days’ The statement about opening Rafah came from COGAT, the Israeli military body charged with facilitating aid to Gaza. It said Israel would coordinate with Egypt on the exit of Palestinians, under the supervision of a mission from the European Union. Those wishing to leave Gaza will require “Israeli security approval,” COGAT said. The ceasefire deal calls for the crossing to be opened for medical evacuations and for travel to and from the strip. But an Israeli official, who spoke anonymously to discuss operational plans, said that all Palestinians who want to exit Gaza will be able to exit through Rafah as long as Egypt agrees to receive them, but the crossing won’t be open for people wishing to return to Gaza. The official said the EU still had to make some adjustments to logistics before the crossing could open. The crossing was sealed off in May 2024 when Israel’s military invaded the area. It was briefly opened in February this year for the evacuation of sick and wounded Palestinians for treatment, as part of the previous ceasefire deal. Israel sends envoy to meet with Lebanese officials.Israeli Prime Minister Benjamin Netanyahu said Wednesday he appointed an envoy to join talks with Lebanese diplomatic and economic officials. Netanyahu’s office called the appointment “the initial attempt to create a basis for relations and economic cooperation” between the two countries. It did not say when or where the talks would be held. Netanyahu’s office said the appointment would come from the office of his national security adviser. Israeli media identified the envoy as Uri Resnick, a former diplomat and the council’s deputy director for foreign policy. Israel and the Lebanon have been in a state of war since 1948. Israel and the Lebanese militant group Hezbollah fought a months-long war that ended in a shaky ceasefire one year ago. Palestinian hospital says Israel killed a man in Gaza.A Palestinian man was killed by Israeli fire on Wednesday in Gaza Strip, a hospital said, marking the latest reported Palestinian fatality in Gaza.Israeli forces shot the 46-year-old man in Gaza City’s eastern Zeitoun neighborhood, according to the Al-Ahli hospital, which received the body. Israel’s military did not immediately respond to request for comment. The hospital said the man was shot while in the “safe zone,” which, under the terms of the ceasefire, is not controlled by the Israeli military. The Gaza Health Ministry says more than 360 Palestinians have been killed across Gaza since the ceasefire took effect on Oct. 11. The ministry sets the total Palestinian death toll from the war over 70,100. The ministry does not distinguish between militants and civilians, though it says roughly half of those killed have been women and children. The ministry operates under the Hamas-run government. It is staffed by medical professionals and maintains detailed records viewed as generally reliable by the international community. Return of Palestinian bodies in flux.The exchanges of the dead have been the central component of the initial phase of the U.S.-brokered agreement, which requires Hamas to return all hostages’ remains as quickly as possible. Without the return of hostage remains, it seemed unlikely that Israel would release more Palestinian bodies on Wednesday.Israel has been releasing 15 Palestinian bodies for the remains of each hostage as part of the ceasefire agreement. The Gaza Health Ministry said the total number of remains received so far is 330. Health officials in Gaza have said they have only been able to identify a fraction of the bodies handed over by Israel, and the process is complicated by a lack of DNA testing kits. The exchanges have gone ahead even as Israel and Hamas have accused each other of violating other terms of the deal. Israeli officials have accused Hamas of handing over partial remains in some instances and staging the discovery of bodies in others. Hamas has accused Israel of opening fire on civilians and restricting the flow of humanitarian aid into the territory. The number of casualties has dropped since the ceasefire took effect, but officials in Gaza have continued to report deaths from strikes, while Israel has said that soldiers have also been killed in militant attacks. The ceasefire aims to wind down the war that was triggered by the Hamas-led attack on southern Israel, which killed about 1,200 people and saw 251 taken hostage.",
        "image": "/images/rafah-crossing-gaza-2025.webp",
        "slug": "israel-to-let-palestinians-leave-gaza-through-reopened-border-crossing",
        "date": "04, December 2025",
          "author":{
            "name":"Marcus Bennett",
            "role":"Political Correspondent",
            "bio":"Marcus covers U.S. politics and policy with sharp, accessible reporting. He breaks down political developments so readers understand what they mean in real life.",
            "image":"/images/marcus-bennett.webp",
            "email":"marcusbennett@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584651071329",
            "instagram":"https://www.instagram.com/marcusbennett2025/",
            "substack":"https://substack.com/@marcusbennett2",
            "medium":"https://medium.com/@marcusbennett_21499"
        }
    },
    {
        "category": "world",
        "title": "Japan’s Takaichi is winning fans not with politics but with her style and ‘work, work, work’ mantra",
        "shortdescription": "Japan’s first female prime minister Sanae Takaichi is gaining popularity more for her sharp style and her motto “work, work, work” than her politics — inspiring many young women who admire her fashion and relentless work ethic",
        "description": "The pledge by Japanese Prime Minister Sanae Takaichi to “work, work, work, work and work” for her country has been named the catchphrase of the year, recognizing the effort Japan’s first female leader had to make to reach the top. The ultraconservative Takaichi uttered the phase in October when she was elected as head of the ruling Liberal Democratic Party. Many were initially as worried about her work ethic as supportive of her enthusiasm. In a country notorious for long working hours, especially for working women who are also burdened with homemaking and caregiving, overwork is a sensitive topic. The recognition triggered a mixed reaction, with some interpreting it as satire. Accepting her award from a private committee this week, Takaichi said she only wanted to stress her enthusiasm. “I have no intention of encouraging other people to overwork, or suggesting long working hours as a virtue,” Takaichi said. “I hope there is no misunderstanding.” Takaichi, within weeks of taking office in late October, sparked a deepening spat with Beijing over her remark about possible Japanese military action in the event that China attacks Taiwan. As the nation’s first female prime minister, Takaichi has captured public attention for her workwear, with women scrambling to copy her style, and the interest has not worn off. But while her dress sense has won admiration from younger women who say they are “Sana-katsu,” or rooting for Sanae, it is unclear if her hard-line conservative policies will win the same praise. Takaichi is looking to regain right-wing supporters after the LDP’s big election losses under her moderate predecessor Shigeru Ishiba. During her speech to party members Oct. 4 she promised an all-out effort to rebuild the struggling party and regain public support, urging lawmakers to “work like a horse.” Then she added: “I will abandon the idea of a ‘work-life balance’ — I will work, work, work, work and work.” Repeating the word “work” in a low, determined voice left a strong impression at the time.Hard work — and then a hot tub Takaichi’s apparent long working hours and lack of sleep have worried fellow lawmakers. She held a meeting with aides at 3 a.m. before the first day of parliament Nov. 7, though she hasn’t started that early since. “I sleep about two hours now, four hours at the longest,” Takaichi, who also provides care for her husband who is recovering from a stroke, told MPs at a budget committee meeting last month. “It’s probably bad for my skin.” She says she likes to soak in a hot tub in the morning and at night to relax. ”That’s my blissful time,” she said. Her style-icon status has been boosted by her black bag, dubbed a “Sanae Bag,” which is officially called the Grace Delight Tote. It is made by Hamano Inc., a 145-year old bagmaker based in Tokyo. Priced at 136,400 yen ($875), the simple leather bag is just large enough to fit A4-sized papers. It is selling the best since its debut 30 years ago, according to the company. Takaichi was carrying the bag as she walked into the prime minister’s office on Oct. 21, and the scene immediately caused a sensation on social media. Hamano spokesperson Takanori Kobayashi said his company is delighted to see Japan’s first female prime minister carrying the bag. Within days, inquiries and orders for the bag surged, and all eight colors have sold out. The bag, which is carefully made of high quality leather, cannot be mass-produced, and those who ordered it now have to wait until August, Kobayashi says. Another popular item is a sparkly light-pink pen Takaichi uses to take notes; it’s Mitsubishi Pencil Co.’s Jetstream 4&1. The pen, the “Sanae Takaichi model,” is often out of stock at stores and internet shopping sites. Those who have found one often proudly post photos with a message: “Matching Sanae.” Style icon, but no feminist The attention Takaichi is receiving is usually reserved for pop stars, athletes and influencers in Japan who fans have access to only through television or the internet. The prime minister’s fans show their loyalty by buying the same bag and pen she uses, just as fans of star athletes like Shohei Ohtani buy replicas of his uniform to cheer on the Dodgers, experts say. Takaichi has won admiration as a new type of role model for women who have not usually rooted for prime ministers in the past, says Namiko Kubo-Kawai, a psychology professor at Nagoya Shukutoku University. In Japan, many female role models typically were supported for their femininity, but Takaichi is unique as a high-powered politician. Her short haircut and no-frills workwear also stand out from conventional female models. She may not inspire many feminists, however. Takaichi is a staunch conservative who champions Japan’s traditional gender and paternalistic values. She has supported keeping the succession of Japan’s monarchy male only. She also opposes changing a 19th-century law that would allow married couples the option of keeping separate surnames. Sill, as the first female prime minister, “she fits perfectly as a stylish role model and has won admiration from many women who have been looking for one even though they probably have never thought of rooting for a prime minister,” Kubo-Kawai said. “Female role models are becoming more diverse.”",
        "image": "/images/sanae_takaichi_prime_minister.webp",
        "slug": "japan-takaichi-style-work-mantra",
        "date": "04, December 2025",
          "author":{
            "name":"Marcus Bennett",
            "role":"Political Correspondent",
            "bio":"Marcus covers U.S. politics and policy with sharp, accessible reporting. He breaks down political developments so readers understand what they mean in real life.",
            "image":"/images/marcus-bennett.webp",
            "email":"marcusbennett@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584651071329",
            "instagram":"https://www.instagram.com/marcusbennett2025/",
            "substack":"https://substack.com/@marcusbennett2",
            "medium":"https://medium.com/@marcusbennett_21499"
        }
    },
    {
        "category": "world",
        "title": "Hong Kong high-rise fire death toll rises to 159 as authorities arrest 6 over failed fire alarms ",
        "shortdescription": "A devastating high-rise fire in Hong Kong’s Wang Fuk Court killed 159 people. Authorities arrested six individuals for allegedly disabling fire alarms — a failure blamed for the huge loss of life",
        "description": "The death toll of Hong Kong’s high-rise apartment blaze rose to 159 on Wednesday, as authorities arrested six people on suspicion of deactivating some fire alarms during maintenance work at the housing complex. The youngest person who died in the fire was a 1-year-old, police said. The oldest was 97. Police said they have completed a search for bodies inside all seven of the eight high-rise residential towers ravaged in the fire that first broke out a week ago and took more than 40 hours to be extinguished. About 30 people were still reported missing. “We have not finished our work yet,” Commissioner of Police Joe Chow told reporters, adding that officials found suspected human bones in different apartments and would attempt DNA testing to identify them. Officials will also continue to search through piles of fallen bamboo scaffolding to check if any remains or bodies were buried there, he said. The deadly blaze broke out at Wang Fuk Court, in the northern suburban district of Tai Po, which was undergoing a monthslong renovation project with buildings covered by bamboo scaffolding and green netting.The city’s anti-corruption body and police said Tuesday that they had arrested 15 people, including directors at construction companies, as authorities probe corruption and negligence in relation to the renovation work. Police said Wednesday that six others, from a fire service installation contractor, were arrested. They were believed to have deactivated some fire alarms at the housing complex during the renovation works, according to police, and were suspected of making false statements to the fire services department. Residents at Wang Fuk Court and officials have previously said that some fire alarms in the buildings failed to sound when the blaze broke out, though it was not immediately clear how widespread that problem was within the complex. Authorities also pointed to substandard plastic nylon netting covering scaffoldings erected outside the towers at Wang Fuk Court, and foam boards installed on windows, for contributing to the fire’s rapid spread to seven of the eight buildings at the complex. On Wednesday, government officials ordered the removal of all external scaffolding nets from up to hundreds of buildings across the city that are undergoing major renovation or maintenance work. The materials will need to be tested before they are allowed to be installed again. The removal was triggered by initial findings at two housing complexes in the territory where fire safety inspection reports for scaffolding nets were suspected to have been falsified, said Chris Tang, Hong Kong’s Secretary for Security. Police are investigating the companies that they believe could have provided the test reports, including the Binzhou Inspection and Testing Center in ChinaThe initial cause of the fire was still under investigation.Nineteen bodies among the 159 were still unidentified, police said. Ten migrants who worked as domestic helpers at the housing complex, including nine from Indonesia and one from the Philippines, as well as one firefighter, were among those killed.",
        "image": "/images/hong_kong_wang_fuk_court_fire_2025.webp",
        "slug": "hong-kong-high-rise-fire-death-toll-159",
        "date": "04, December 2025",
          "author":{
            "name":"Marcus Bennett",
            "role":"Political Correspondent",
            "bio":"Marcus covers U.S. politics and policy with sharp, accessible reporting. He breaks down political developments so readers understand what they mean in real life.",
            "image":"/images/marcus-bennett.webp",
            "email":"marcusbennett@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584651071329",
            "instagram":"https://www.instagram.com/marcusbennett2025/",
            "substack":"https://substack.com/@marcusbennett2",
            "medium":"https://medium.com/@marcusbennett_21499"
        }
    },
    {
        "category": "world",
        "title": "Yemen’s Houthis release mariners held since July ship attack",
        "shortdescription": "The Houthis in Yemen freed a group of mariners who had been detained since a ship attack in July — ending months of captivity for those sailors.",
        "description": "Yemen’s Houthi rebels on Wednesday released 11 mariners held since a July attack on the ship Eternity C in the Red Sea, an assault that killed four on board and sank the vessel. The Iranian-backed Houthis, who have been targeting ships during the Israel-Hamas war, said via their al-Masirah satellite news channel that Oman had taken custody of the mariners, who were flying to the sultanate. Oman later said it received the 11 mariners — who are from India and the Philippines — “in preparation for their return to their home countries.” However, the Houthis later released images of only 10 mariners. It wasn’t clear why the 11th releasee wasn’t shown. A Royal Oman Air Force jet landed earlier Wednesday in Sanaa, the Yemeni capital held for over a decade by the rebels, according to flight-tracking data analyzed by The Associated Press. Following the Houthi announcement, the plane was tracked leaving Yemeni airspace. Oman later published images of the men being greeted on arrival in Muscat, the sultanate’s capital, by Filipino and Indian diplomats. The Philippines said Tuesday it expected nine Filipino mariners held by the Houthis since the attack to be released. The Foreign Ministry in Manila described the mariners as being “held hostage by the Houthis” since the attack, something the U.S. government also had said earlier. The Houthis offered no immediate breakdown on the nationalities of those released. It had described their forces as rescuing the men after they abandoned the crippled ship following the attack. It contended the men spent “five months spent as guests, not detainees.” The Houthis have targeted more than 100 ships with missiles and drones in their campaign, sinking four vessels. The attacks have killed at least nine mariners, after a crew member aboard one vessel targeted, the Minervagracht, died of his wounds in October. The Houthis have held mariners for months in the past, and it wasn’t immediately clear why they released the mariners now. The Houthis stopped their attacks during a brief, earlier ceasefire in the war in Gaza. They later became the target of a weekslong campaign of airstrikes ordered by U.S. President Donald Trump before he declared a ceasefire had been reached with the rebels. The current ceasefire in the war has again seen the Houthis hold their fire. Meanwhile, the future of talks between the United States and Iran over Tehran’s battered nuclear program is in question after Israel launched a 12-day war against the Islamic Republic in June that saw the U.S. bomb three Iranian atomic sites.",
        "image": "/images/yemen_houthi_mariners_release_2025.webp",
        "slug": "yemen-houthis-release-mariners-held-since-july",
        "date": "04, December 2025",
          "author":{
            "name":"Marcus Bennett",
            "role":"Political Correspondent",
            "bio":"Marcus covers U.S. politics and policy with sharp, accessible reporting. He breaks down political developments so readers understand what they mean in real life.",
            "image":"/images/marcus-bennett.webp",
            "email":"marcusbennett@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584651071329",
            "instagram":"https://www.instagram.com/marcusbennett2025/",
            "substack":"https://substack.com/@marcusbennett2",
            "medium":"https://medium.com/@marcusbennett_21499"
        }
    },
    {
        "category": "world",
        "title": "What to know about Malaysia Airlines Flight 370 as the search resumes",
        "shortdescription": "Malaysia Airlines Flight 370 vanished in 2014 with 239 aboard — sparking one of aviation’s biggest mysteries. As efforts to resume the search unfold, investigators hope new data or technology could finally uncover what happened to the missing aircraft.",
        "description": "More than a decade ago, Malaysia Airlines Flight 370 vanished without a trace, sparking one of aviation’s most baffling mysteries. Despite years of multinational searches, investigators still do not know exactly what happened to the plane or its 239 passengers and crew. On Wednesday, Malaysia’s government said American marine robotics company Ocean Infinity would resume a seabed hunt for the missing plane on Dec. 30, reigniting hopes that the plane might finally be found. A massive search in the southern Indian Ocean, where the jet is believed to have gone down, turned up almost nothing. Apart from a few small fragments that washed ashore, no bodies or large wreckage have ever been recovered. Here’s what we know about the deadly aviation tragedy.‘Good night, Malaysian Three Seven Zero’ The Boeing 777 disappeared from air-traffic radar 39 minutes after departing Kuala Lumpur for Beijing on March 8, 2014. The pilot’s last radio call to Kuala Lumpur — “Good night, Malaysian Three Seven Zero”— was the final communication before the plane crossed into Vietnamese airspace and failed to check in with controllers there. Minutes later, the plane’s transponder, which broadcasts its location, shut down. Military radar showed the jet turn back over the Andaman Sea, and satellite data suggested it continued flying for hours, possibly until fuel exhaustion, before crashing into a remote section of the southern Indian Ocean.Theories about what happened range from hijacking to cabin depressurization or power failure. There was no distress call, ransom demand, evidence of technical failure or severe weather. Malaysian investigators in 2018 cleared the passengers and crew but did not rule out “unlawful interference.” Authorities have said someone deliberately severed communications and diverted the plane. Passengers came from many countries. MH370 carried 227 passengers, including five young children, and 12 crew members. Most passengers were Chinese, but there were also citizens from the United States, Indonesia, France, Russia and elsewhere. Among those aboard were two young Iranians traveling on stolen passports, a group of Chinese calligraphy artists, 20 employees of U.S. tech firm Freescale Semiconductor, a stunt double for actor Jet Li and several families with young children. Many families lost multiple members. Largest underwater search in history Search operations began in the South China Sea between Malaysia and Vietnam, then expanded to the Andaman Sea and the southern Indian Ocean. Australia, Malaysia and China coordinated the largest underwater search in history, covering roughly 120,000 square kilometers (46,000 square miles) of seabed off western Australia. Aircraft, vessels equipped with sonar and robotic submarines scoured the ocean for signs of the plane. Signals thought to be from the plane’s black box turned out to be from other sources, and no wreckage was found. The first confirmed debris was a flaperon discovered on Réunion Island in July 2015, with additional fragments later found along the east coast of Africa. The search was suspended in January 2017.In 2018, U.S. marine robotics company Ocean Infinity resumed the hunt under a “no find, no fee” agreement, focusing on areas identified through debris drift studies, but it ended without success. The challenge of locating remains. One reason why such an extensive search failed to turn up clues is that no one knows exactly where to look. The Indian Ocean is the world’s third largest, and the search was conducted in a difficult area, where searchers encountered bad weather and average depths of around 4 kilometers (2.5 miles). It’s not common for planes to disappear in the deep sea, but when they do remains can be very hard to locate. Over the past 50 years, dozens of planes have vanished, according to the Aviation Safety Network. U.S. company resumes search malaysia’s government gave the green light in March for another “no-find, no-fee” contract with Ocean Infinity to resume the seabed search operation at a new 15,000-square-kilometer (5,800-square-mile) site in the ocean. Ocean Infinity will be paid $70 million only if wreckage is discovered. However, the search was suspended in April due to bad weather. The government said Wednesday that Ocean Infinity will resume search intermittently from Dec. 30 for a total of 55 days, in targeted areas believed to have the highest likelihood of finding the missing aircraft. It is unclear if the company has new evidence of the plane’s location. It has said it would utilize new technology and has worked with many experts to analyze data and narrow the search area to the most likely site.",
        "image": "/images/malaysia_airlines_mh370_illustration.webp  ",
        "slug": "what-to-know-about-mh370",
        "date": "04, December 2025",
          "author":{
            "name":"Jenna Whitmore",
            "role":"Entertainment Writer",
            "bio":"Jenna covers entertainment, culture, and trending stories, bringing fresh perspective and concise reporting that highlights the people and moments shaping today’s entertainment landscape.",
            "image":"/images/jenna-whitmore.webp",
            "email":"jennawhitmore@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584976316567",
            "instagram":"https://www.instagram.com/jennawhitmore2025/",
            "substack":"https://substack.com/@jennawhitmore",
            "medium":"https://medium.com/@jennawhitmore"
        }
    },
    {
        "category": "world",
        "title": "Macron arrives in China for talks with Xi on trade ties and Russia’s war in Ukraine",
        "shortdescription": "Emmanuel Macron has arrived in China to meet with Xi Jinping — the talks will focus on strengthening trade ties and discussing the war in Ukraine, highlighting Europe’s balancing act between economic interests and global security.",
        "description": "Emmanuel Macron arrived in China on Wednesday for a three-day state visit focusing on trade and diplomatic talks as the French president seeks to enlist Beijing in pressuring Russia toward a ceasefire with Ukraine. Macron will advocate for an agenda of cooperation in economic and trade matters aimed at achieving a balance that ensures “sustainable, solid growth that benefits everyone,” his office said. France is aiming to attract more investment from Chinese companies and facilitate market access for French exports. During the visit, officials from both nations are expected to sign several agreements in the energy, food industry, and aviation sectors. Macron is committed to defend “fair and reciprocal market access,” his office said. He and his wife Brigitte wore open overcoats against the winter chill as they stepped off a plane after nightfall at an airport in Beijing and walked down a red-carpeted jetway. They were greeted by Chinese Foreign Minister Wang Yi, who spoke with Macron before the French leader and his wife departed in a limousine. They are expected to visit the 18th-century Qianlong Garden complex in the Forbidden City, the former palace of China’s emperors, on Wednesday evening. The garden, which dates from the Qing dynasty, recently reopened to the public after a major renovation France will host the Group of Seven summit in 2026 involving the world’s most advanced economies, while China will chair the 21-member Asia-Pacific Economic Cooperation (APEC) forum, which includes the United States, South Korea, Japan, Australia, and Russia. The 27-nation bloc runs a massive trade deficit with China — over 300 billion euros ($348 billion) last year. China alone represents 46% of France’s total trade deficit. France and the European Union have described China as a partner, competitor and systemic rival. Recent years have been marked by multiple trade disputes across a range of industries after the EU undertook a probe into Chinese electric vehicles subsidies. China responded with investigations into imports of European brandy, pork and dairy products. In July, Macron welcomed exemptions for most cognac producers as a positive step. France is China’s first supplier of wine and spirits. Macron’s talks with President Xi Jinping will also address Russia’s war in Ukraine, particularly following a meeting Monday in Paris with Ukrainian President Volodymyr Zelenskyy to discuss potential terms for a ceasefire. “What we want is that China can convince and influence Russia to move toward a ceasefire as quickly as possible and consolidate that ceasefire through negotiations which, in our view, should lead to solid security guarantees for Ukraine,” a French top diplomatic official said. Paris expects Beijing to “refrain from providing Russia with any means whatsoever to continue the war,” the official said, speaking anonymously in line with the French presidency’s customary practices. China’s Foreign Ministry spokesperson Mao Ning said last week that Beijing believes in “dialogue and negotiation” to resolve the Ukraine war and supports “all efforts” leading to peace. Since the beginning of the Ukraine conflict, China “has played a constructive role in promoting a political resolution of the crisis,” she said. On Thursday, Macron will meet with Xi at the Great Hall of the People. Both leaders will then participate in a Franco-Chinese business forum. In the afternoon, Macron’s agenda includes talks with Zhao Leji, chairman of the National People’s Congress, and Chinese Premier Li Qiang. The French presidential couple will then travel to Chengdu in China’s Sichuan province. On Friday, Macron and Xi will have talks in Dujiangyan, on the site of one of the world’s oldest irrigation system. Macron will later meet with students from the Sichuan University. Chengdu is also home to the Conservation and Research Center for the Giant Panda, where Yuan Meng, the first giant panda born in France that was named by first lady Brigitte Macron, is now staying. France last month sent back to China a couple of star giant pandas who lived in the country for 13 years and gave birth to three cubs.",
        "image": "/images/macron_china_arrival_2025.webp",
        "slug": "macron-china-visit-xi-trade-ukraine-talks",
        "date": "03, December 2025",
          "author":{
            "name":"Jenna Whitmore",
            "role":"Entertainment Writer",
            "bio":"Jenna covers entertainment, culture, and trending stories, bringing fresh perspective and concise reporting that highlights the people and moments shaping today’s entertainment landscape.",
            "image":"/images/jenna-whitmore.webp",
            "email":"jennawhitmore@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584976316567",
            "instagram":"https://www.instagram.com/jennawhitmore2025/",
            "substack":"https://substack.com/@jennawhitmore",
            "medium":"https://medium.com/@jennawhitmore"
        }
    },
    {
        "category": "world",
        "title": "Rescuers race in search for survivors after last week’s floods in Indonesia, Sri Lanka and Thailand",
        "shortdescription": "Rescuers in Indonesia, Sri Lanka, and Thailand are scrambling to find survivors after devastating floods struck last week — with many areas submerged and communities cut off. Aid workers and emergency teams are racing against time to save lives and provide relief.    ",
        "description": "Rescue teams raced Wednesday to reach communities isolated by last week’s catastrophic floods and landslides in Indonesia, Sri ",
        "image": "/images/southeast_asia_flood_rescue_efforts_202.webp",
        "slug": "rescuers-race-to-find-survivors-after-southeast-asia-floods",
        "date": "03, December 2025",
          "author":{
            "name":"Jenna Whitmore",
            "role":"Entertainment Writer",
            "bio":"Jenna covers entertainment, culture, and trending stories, bringing fresh perspective and concise reporting that highlights the people and moments shaping today’s entertainment landscape.",
            "image":"/images/jenna-whitmore.webp",
            "email":"jennawhitmore@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584976316567",
            "instagram":"https://www.instagram.com/jennawhitmore2025/",
            "substack":"https://substack.com/@jennawhitmore",
            "medium":"https://medium.com/@jennawhitmore"
        }
    },
    {
        "category": "world",
        "title": "Putin’s visit highlights Indian imports of discounted Russian oil in the face of US sanctions",
        "shortdescription": "Vladimir Putin’s visit underscores how India continues to import discounted Russian oil despite US sanctions — a deal that boosts energy supply for India while drawing global scrutiny.    ",
        "description": "Russian President Vladimir Putin will be in India this week for a summit aimed at deepening economic, defense and energy ties, a visit that will also test New Delhi’s efforts to balance relations with Moscow and Washington as the war in Ukraine grinds on. Putin is scheduled to arrive on the state visit Thursday and hold talks with Indian Prime Minister Narendra Modi on Friday. They are expected to review progress on bilateral ties, discuss issues of mutual interest and sign interdepartmental and business agreements, both governments said. India has continued to buy discounted Russian oil, despite warnings from Washington that this is partly keeping Moscow’s revenues afloat to fund the Ukraine war. U.S. President Donald Trump has imposed additional 25% tariffs on Indian imports, raising the total duties to 50%, in retaliation. India has defended its imports as essential for meeting the growing energy needs of its 1.4 billion people. Putin last visited India in 2021. Modi was in Moscow last year, and the two leaders briefly met in September in China during a Shanghai Cooperation Organization summit. The pivotal diplomatic moment The India-Russia summit comes as the United States renews its push for a Ukraine peace plan and seeks broader cooperation from key partners. Putin met U.S. presidential envoy Steve Witkoff and Trump’s son-in-law Jared Kushner in the Kremlin Tuesday to discuss the proposals, which critics have described as too heavily tilted toward Moscow. Yuri Ushakov, one of Putin’s senior advisers, told journalists after the meeting that talks had been “productive” but said that much work still remained. Modi has avoided condemning Russia for the fighting in Ukraine while emphasizing the need for a peaceful settlement. Sreeram Sundar Chaulia, an international affairs expert at the Jindal School of International Affairs near New Delhi, said India has avoided taking on an overt mediating role because it could complicate its ties with both Russia and the U.S. “But behind-the-scenes diplomacy by Modi is feasible, and has happened already to some extent,” Chaulia said. Modi could try to nudge Putin “to accommodate some Ukrainian and European concerns to bring about a cessation of hostilities,” he added. Economic cooperation key focus of Putin’s visit India and Russia will look at bolstering their bilateral relationship and are expected to deliver a package of documents centered around economic cooperation, trade facilitation, maritime, healthcare and media exchanges, according to Indian officials involved in the summit’s preparation. They spoke on condition of anonymity as the details aren’t public. India is keen to increase exports of pharmaceuticals, agriculture and textiles to Russia and is seeking the removal of non-tariff barriers. New Delhi is also seeking long-term supplies of fertilizers from Moscow. Another key area where the two countries are working to finalize an agreement is the safe and regulated migration of Indian skilled workers to Russia. U.S. pressure on India to shun Russian oil The U.S. has pressed India to halt purchases of discounted Russian oil, accusing New Delhi of helping fund Moscow’s war effort. In August, Trump imposed a 50% tariff on Indian imports to increase pressure over the issue. India rejected the charge, saying it follows international sanctions and prioritizes its national interest and energy security. But its position could become more complicated after new U.S. sanctions on Russian oil giants Rosneft and Lukoil. Indian officials said the country will avoid buying oil from sanctioned producers, while keeping options open with companies not targeted by the restrictions. “India will certainly underscore that there is no Indian desire to cut off energy supplies from Russia completely,” said Harsh Pant, vice president of foreign policy at the Observer Research Foundation, a New Delhi-based think tank. Defense cooperation at the core India is expected to push Russia for faster delivery of two further S-400 surface-to-air missile systems, after receiving three under a 2018 deal worth about $5.4 billion. The delay has been tied to supply chain disruptions linked to the war in Ukraine. Indian authorities are also likely to explore the possibility of acquiring additional S-400 units or an upgraded variant, though no contract or announcement is expected. Indian defense planners say the S-400 proved effective during a brief military standoff with Pakistan in May. “The meeting will focus on broader elements of institutional cooperation on defense between our two sides and will try to ensure that delivery delays are ended. Potentially, S-400 additional is not ruled out, but don’t expect any announcement during the visit,” India’s Defense Secretary Rajesh Kumar Singh said at a security conference in New Delhi last week. Talks are also expected on upgrading India’s Russian-made Su-30MKI fighter jets and accelerating deliveries of critical military hardware, as well as improving coordination on joint exercises and disaster relief. Despite India diversifying its procurement of military hardware over the last few years, Russia continues to be its biggest supplier. Moscow is keen on selling its stealth fighter jet Su-57 to India, but New Delhi has kept its options open to other foreign suppliers as well.",
        "image": "/images/putin_india_visit_oil_trade_2025.webp",
        "slug": "putin-visit-spotlights-india-russian-oil-imports",
        "date": "03, December 2025",
         "author":{
            "name":"Claire Addison",
            "role":"Senior Investigative Reporter",
            "bio":"Claire uncovers in-depth stories with a focus on accuracy, accountability, and clear reporting. She specializes in investigations that help readers understand the truth behind complex issues.",
            "image":"/images/claire-addison.webp",
            "email":"claireaddison@fiscalfusion.org",
            "twitter":"https://x.com/claire_add1703",
            "facebook":"https://www.facebook.com/profile.php?id=61584652001298",
            "instagram":"https://www.instagram.com/claireaddison2025/",
            "substack":"https://substack.com/@claireaddison1",
            "medium":"https://medium.com/@claireaddison_68794"

        }
    },
    {
        "category": "world",
        "title": "Resistance forces in Myanmar detain a candidate in this month’s election, state media report",
        "shortdescription": "Reports say that resistance forces in Myanmar have detained a candidate set to contest in this month’s election — a move that could further complicate the already fraught electoral environment.",
        "description": "An election candidate in the strife-torn nation of Myanmar has been detained by a resistance group opposed to army rule, state media reported Wednesday, the first known such action before the polls scheduled for later this month. The detention of Wai Lin Htet, 37, a candidate of the Shan and Nationalities Democratic Party, highlights ongoing tensions in Myanmar, where local resistance groups clash with the military government as it tries to hold the Dec. 28 election. The Magway region has been one of the strongholds of armed resistance since the army seized power from the elected government of Aung San Suu Kyi in February 2021. After peaceful demonstrations were put down with lethal force, many opponents of military rule took up arms, forming the People’s Defense Force, which is now engaged in combat in many areas of the country. Critics have denounced the election plan as a sham to normalize the military takeover, and several opposition organizations, including armed resistance groups, have said they will try to derail them. Jeremy Laurence, a spokesperson for the U.N.’s human rights office, warned last Friday that the ballot would be conducted in an environment “rife with threats and violence” and actively suppressed political participation. A report in the state-run Myanma Alinn newspaper said that Wai Lin Htet was detained at 3 p.m. on Saturday by three members of a local resistance group who arrived on two motorbikes, while he was at home with his family in Pakokku Township, in central Myanmar’s Magway Region. It identified the three as members of the People’s Defense Force, whose many local and regional forces make up the armed wing of the pro-democracy movement battling the army. The unit responsible for his detention wasn’t further identified, and there were no public statements about the action. The report said that authorities were seeking the arrest of the three under a section of a new electoral law that carries a maximum penalty of seven years in prison for detaining a parliamentary candidate and preventing him from conducting election activities. According to reports from local media, including the online news site Myanmar Now, nearly 100 people, including film directors, have been arrested under the election law since it was enacted in July, and some of them have received sentences of up to 49 years in prison. Sai Ai Pao, chairman of the Shan and Nationalities Democratic Party — also known as the White Tiger Party, and one of six parties contesting the polls nationwide — refused to comment to The Associated Pres about the incident because of concerns about the candidate’s safety.The Shan and Nationalities Democratic Party, once a small ethnic party based in Shan and Kachin states in previous elections, is now competing nationwide with more than 580 candidates, making it the fifth-largest of the six parties competing nationwide. It’s not considered explicitly pro- or anti-military, but its participation in the election gives the impression it is allied with the army.",
        "image": "/images/myanmar_election_candidate_detained_2025.webp",
        "slug": "myanmar-resistance-detains-election-candidate",
        "date": "03, December 2025",
         "author":{
            "name":"Claire Addison",
            "role":"Senior Investigative Reporter",
            "bio":"Claire uncovers in-depth stories with a focus on accuracy, accountability, and clear reporting. She specializes in investigations that help readers understand the truth behind complex issues.",
            "image":"/images/claire-addison.webp",
            "email":"claireaddison@fiscalfusion.org",
            "twitter":"https://x.com/claire_add1703",
            "facebook":"https://www.facebook.com/profile.php?id=61584652001298",
            "instagram":"https://www.instagram.com/claireaddison2025/",
            "substack":"https://substack.com/@claireaddison1",
            "medium":"https://medium.com/@claireaddison_68794"

        }
    },
    {
        "category": "world",
        "title": "India rolls back order to preinstall cybersecurity app on smartphones",
        "shortdescription": "India has withdrawn its plan that would have required smartphone makers to preinstall a government-specified cybersecurity app — relieving manufacturers and users of mandatory software installation.",
        "description": "India’s telecoms ministry on Wednesday rolled back its order for smartphone manufacturers to preinstall a government-run cybersecurity app on new devices. The Ministry of Communications on Monday asked smartphone makers to install the government’s “Sanchar Saathi” app within 90 days and to prevent users from disabling it. It also required manufacturers to push the app onto older models through a software update. Monday’s directive led to widespread criticism and concerns of violation of data privacy and user consent in one of the largest handset markets in the world. That order also clashed with policies of companies like U.S.-based Apple, which prohibits preinstalling third-party apps on its devices, including those developed by governments. The ministry said in a statement Wednesday that 600,000 new users had registered to download the app in the last day. While noting its increased acceptance, it said the government “has decided not to make the preinstallation mandatory for mobile manufacturers.” “The app is secure and purely meant to help citizens from bad actors in the cyberworld. There is no other function other than protecting the users in the app and they can remove the app whenever they want,” the statement said. On Tuesday, India’s telecom minister, Jyotiraditya M. Scindia, had called the app voluntary after privacy advocates said it could erode user privacy and consent. The “Sanchar Saathi” app, which was released in January, was designed to let users block and track lost or stolen phones and to identify and shut down fraudulent mobile connections. Since its launch, it has drawn at least 14 million downloads, according to government data.",
        "image": "/images/india_smartphone_market.webp",
        "slug": "india-drops-smartphone-cybersecurity-preinstall-order",
        "date": "03, December 2025",
         "author":{
            "name":"Claire Addison",
            "role":"Senior Investigative Reporter",
            "bio":"Claire uncovers in-depth stories with a focus on accuracy, accountability, and clear reporting. She specializes in investigations that help readers understand the truth behind complex issues.",
            "image":"/images/claire-addison.webp",
            "email":"claireaddison@fiscalfusion.org",
            "twitter":"https://x.com/claire_add1703",
            "facebook":"https://www.facebook.com/profile.php?id=61584652001298",
            "instagram":"https://www.instagram.com/claireaddison2025/",
            "substack":"https://substack.com/@claireaddison1",
            "medium":"https://medium.com/@claireaddison_68794"

        }
    },
    {
        "category": "world",
        "title": "Putin calls talks with US on ending the Ukraine war ‘useful’ but also ‘difficult work’",
        "shortdescription": "Vladimir Putin said recent talks with the United States on ending the war in Ukraine were “useful,” but admitted they remain “difficult work,” underscoring deep divisions even amid diplomatic engagement.",
        "description": "Russian President Vladimir Putin said his five-hour talks with U.S. envoys on ending the war in Ukraine were “necessary” and “useful” but also “difficult work,” with some of the proposals unacceptable to the Kremlin. Putin spoke to the India Today TV channel ahead of his visit to New Delhi on Thursday, and while the full interview is yet to be broadcast, Russian state news agencies Tass and RIA Novosti quoted some of Putin’s remarks. The Russian leader’s comments come as U.S. President Donald Trump’s special envoy Steve Witkoff and son-in-law Jared Kushner are set to meet with Ukraine’s lead negotiator, Rustem Umerov, on Thursday in Miami for further talks, according to a senior Trump administration official who was not authorized to comment publicly and spoke on the condition of anonymity. The high-stakes talks are part of Trump’s renewed push to end the nearly four-year war. The peace effort has recently gathered steam, even though reconciling Russia’s and Ukraine’s “red lines” still appears to be an uphill battle. Trump said Wednesday that Witkoff and Kushner came away from their marathon session with Putin in the Kremlin confident that he wants to find an end to the war. “Their impression was very strongly that he’d like to make a deal,” Trump said. Tass quoted Putin as saying in the interview that at the talks in the Kremlin, the sides “had to go through each point” of the U.S. peace proposal, “which is why it took so long.” “This was a necessary conversation, a very concrete one,” the Russian president said. There were provisions that Moscow said it was ready to discuss, while others “we can’t agree to,” Putin said. “There were these provisions, we discussed them, it’s difficult work,” he added. Tass reported that Putin was asked whether the 28-point peace plan drafted by the U.S. is still relevant, to which the Russian president replied that those provisions were indeed discussed. “They just divided these 28, I think 27, points into four packages,” Putin was quoted as saying. “And they proposed that we discuss these four packages. But essentially, they are the same (provisions).” It is unclear whether Putin meant that the Kremlin talks covered the version of the plan before it was amended following U.S.-Ukraine talks in Geneva last weekend. His aide Yuri Ushakov said earlier this week that several documents were being discussed at the talks. “At first there was one version, then this version was revised, and instead of one document, a few more appeared,” Ushakov said. Putin refused to go into details as to what Russia could agree to and what it finds unacceptable. None of the officials involved in the negotiations has offered details of the talks. “I think it is premature. Because it could simply disrupt the working regime” of the peace effort, Tass quoted Putin as saying. The Russian leader added that Washington is engaged in “shuttle diplomacy.” “They spoke to the Europeans, then came to us, then they have another meeting with the Ukrainians and the Europeans,” he said. Russian barrages of civilian areas of Ukraine continued overnight into Thursday. A ballistic missile struck Kryvyi Rih on Wednesday night, injuring six people, including a 3-year-old girl, according to city administration head Oleksandr Vilkul. He said the strike damaged over 40 residential buildings, a school and domestic gas pipes in the city, which is Ukrainian President Volodymyr Zelenskyy’s home town. A 6-year-old girl died in Kherson, a southern port city, after Russian artillery shelling injured her the previous day. “Doctors fought until the very end to save her life, but her injuries were too severe,” regional military administration chief Oleksandr Prokudin wrote on Telegram. Russia also struck Odesa with drones, injuring six people, while civilian and energy infrastructure was damaged, said the head of the regional military administration, Oleh Kiper. Overall, Russia fired two ballistic missiles and 138 drones of various types at Ukraine overnight, officials said.",
        "image": "/images/putin_russia_us_meeting_2025.webp",
        "slug": "putin-calls-us-ukraine-talks-useful-but-difficult",
        "date": "04, December 2025",
         "author":{
            "name":"Claire Addison",
            "role":"Senior Investigative Reporter",
            "bio":"Claire uncovers in-depth stories with a focus on accuracy, accountability, and clear reporting. She specializes in investigations that help readers understand the truth behind complex issues.",
            "image":"/images/claire-addison.webp",
            "email":"claireaddison@fiscalfusion.org",
            "twitter":"https://x.com/claire_add1703",
            "facebook":"https://www.facebook.com/profile.php?id=61584652001298",
            "instagram":"https://www.instagram.com/claireaddison2025/",
            "substack":"https://substack.com/@claireaddison1",
            "medium":"https://medium.com/@claireaddison_68794"

        }
    },
    {
        "category": "world",
        "title": "UK and Norway will mount joint naval patrols to protect undersea cables and hunt Russian submarines",
        "shortdescription": "The United Kingdom and Norway have announced they will carry out joint naval patrols aimed at safeguarding undersea internet and communications cables — and hunting Russian submarines — to strengthen security of critical infrastructure.",
        "description": "Britain and Norway will mount joint naval patrols to protect undersea cables from Russia, the U.K. said Thursday, as Prime Minister Keir Starmer and Norwegian counterpart Jonas Gahr Støre held talks on defense. The U.K. government says a combined fleet of at least 13 warships will “hunt Russian submarines and protect critical infrastructure in the North Atlantic.” It follows a 10 billion pound ($13.4 billion) deal struck in August for Norway to buy at least five British-made frigates. Those Norwegian vessels and eight British ships will operate jointly in the seas along NATO’s northern flank. As part of the agreement, formally signed Thursday in London by the two countries’ defense ministers, the U.K. has agreed to use Norwegian missiles for the Royal Navy’s surface fleet. Starmer and Støre were scheduled to hold talks at the U.K. prime minister’s residence at 10 Downing St. before visiting British and Norwegian personnel at RAF Lossiemouth in Scotland, where they will meet aircraft crews that have been tracking Russian vessels. Britain says Russian naval activity around U.K. waters has increased by 30% in the past two years.",
        "image": "/images/uk_norway_navy_submarine_patrol_2025.webp",
        "slug": "uk-norway-joint-naval-patrols-undersea-cables",
        "date": "04, December 2025",
          "author":{
            "name":"Jenna Whitmore",
            "role":"Entertainment Writer",
            "bio":"Jenna covers entertainment, culture, and trending stories, bringing fresh perspective and concise reporting that highlights the people and moments shaping today’s entertainment landscape.",
            "image":"/images/jenna-whitmore.webp",
            "email":"jennawhitmore@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584976316567",
            "instagram":"https://www.instagram.com/jennawhitmore2025/",
            "substack":"https://substack.com/@jennawhitmore",
            "medium":"https://medium.com/@jennawhitmore"
        }
    },
    {
        "category": "world",
        "title": "China’s Xi and France’s Macron pledge cooperation on global crises and trade",
        "shortdescription": "China’s Xi Jinping and France’s Emmanuel Macron pledged to boost cooperation on global crises and trade, signalling stronger China-Europe ties amid global instability.",
        "description": "BEIJING  — China and France pledged deeper cooperation on global issues like the war in Ukraine and trade, as France prepares to take on the presidency of the Group of Seven next year. French President Emmanuel Macron met with China’s Xi Jinping on Thursday morning as part of a three-day state visit focusing on trade and diplomacy. France seeks help to end Ukraine war The French leader is seeking to involve Beijing in pressuring Russia toward a ceasefire with Ukraine after a recent burst of diplomacy around a U.S.-led peace plan. “We are facing the risk of the disintegration of the international order that brought peace to the world for decades, and in this context, the dialogue between China and France is even more essential than ever,” Macron said Thursday. “I hope that China will join our call, our efforts to achieve, as soon as possible, at the very least a ceasefire in the form of a moratorium on strikes targeting critical infrastructure,” he said. Xi did not say respond to France’s call, but said that “China supports all efforts that work towards peace” and called for a peace deal that all parties will accept. China has provided strong diplomatic support to Russia since its invasion of Ukraine and has also extended an economic lifeline through increased trade. Xi also announced that China will provide $100 million to help Gaza’s ongoing humanitarian crisis and to support the territory’s recovery and reconstruction. Xi called for building greater political trust with France by showing each other support while demonstrating each side’s “independence.” “No matter how the external environment changes, both sides as major powers should always demonstrate independence and strategic vision, show mutual understanding and mutual support for each other on core matters and major critical issues,” he said. “China and France should demonstrate their sense of responsibility, raise high the banner of multilateralism ... and firmly stand on the right side of history,” he added. Both are eager for more trad Trade was another major focus of Thursday’s agenda. Xi said during the joint appearance that both sides had agreed to work towards greater economic cooperation in areas of aerospace, aeronautics, nuclear energy, as well as new areas such as green industries and AI. They signed 12 agreements, including ones calling for cooperation on a new round of panda conservation efforts and exchanges in higher education and research. The European Union bloc runs a massive trade deficit with China: over 300 billion euros ($348 billion) last year. China alone represents 46% of France’s total trade deficit. France and the European Union have described China as simultaneously a partner, a competitor and a systemic rival. Recent years have been marked by trade disputes across a range of industries after the EU undertook a probe into Chinese electric vehicles subsidies and China responded with investigations into imports of European brandy, pork and dairy products. But France was able to get an exemption for most cognac producers in July. China, facing its own economic slump, is also signaling it wants more business. “China’s open door will only open wider,” Xi said, saying that the country plans to “expand market access, and opening up areas” of investment “and guide the cross-border, orderly, and rational layout of industrial and supply chains.” Xi also called for both sides to continue to promote mutually beneficial cooperation between China and the EU. Some argue bilateral deals could undermine EU Experts have said they expect Beijing to use this visit to strengthen its individual ties with one of Europe’s most important economies, at the expense of the greater EU bloc. “China seeks to drive a wedge into this EU approach by making deals bilaterally with individual EU members,” said Lyle Morris, a senior fellow on Foreign Policy and National Security as the Asia Society. Macron and his wife Brigitte Macron touched down in Beijing Wednesday evening. On Thursday morning, Macron was greeted by a military band and groups of children waving flags at Beijing’s Great Hall of the People. The two leaders attended the closing of a Franco-Chinese business forum Thursday. Macron’s agenda also includes meetings with Zhao Leji, chairman of the National People’s Congress, and Chinese Premier Li Qiang. The French presidential couple will then travel to Chengdu in China’s Sichuan province. Chengdu is also home to the Conservation and Research Center for the Giant Panda, where Yuan Meng, who was the first giant panda born in France and was named by first lady Brigitte Macron, is now staying. France last month sent back to China a couple of star giant pandas who lived in the country for 13 years and gave birth to three cubs.",
        "image": "/images/xi_macron_china_france_2025.webp",
        "slug": "xi-macron-pledge-cooperation-on-global-crises-trade",
        "date": "04, December 2025",
          "author":{
            "name":"Evan Carlisle",
            "role":"U.S. News Reporter",
            "bio":"Evan reports on major U.S. news stories with a focus on clarity, relevance, and timely updates that help readers stay informed about what’s happening across the country.",
            "image":"/images/evan-carlisle.webp",
            "email":"evancarlisle@fiscalfusion.org",
            "twitter":"https://x.com/EvanCarlis90819",
            "facebook":"https://www.facebook.com/profile.php?id=61584747486041",
            "instagram":"https://www.instagram.com/evancarlisle92/",
            "substack":"https://substack.com/@evancarlisle",
            "medium":"https://medium.com/@evancarlisle_85958"
        }
    },
    {
        "category": "world",
        "title": "Eurovision chiefs face thorny question of whether Israel should take part in the 2026 song contest",
        "shortdescription": "Eurovision organisers are grappling with whether Israel should be allowed to compete in the 2026 Eurovision Song Contest — a decision that could test the competition’s rules amid political tensions and public pressure.",
        "description": "Organizers of the Eurovision Song Contest, the feel-good pop music gala that draws more than 100 million viewers every year, are meeting Thursday to tackle a bitter and divisive issue: Whether Israel should be allowed to participate in the 2026 competition. The European Broadcasting Union, a group of public broadcasters from 56 countries that runs the competition, is holding a general assembly, with some countries calling for Israel to be excluded over alleged interference in contest voting and its conduct of the war against the militant Hamas group in Gaza. Experts predict delegates won’t reach a united position on the issue at EBU headquarters in Geneva and it’s not clear whether a vote will be called. That would mean broadcasters may have to decide, on their own or as a breakaway group, whether to take part as individual countries. “Eurovision is becoming a bit of a fractured event,” said Paul Jordan, an expert on the contest known as Dr. Eurovision. “The slogan is ‘United by Music’ unfortunately it’s disunited through politics.” “It’s become quite a messy and toxic situation,” he added. Divided over politic The contest, whose 70th edition is scheduled for Vienna in May, pits acts from dozens of nations against one another for the continent’s musical crown. It strives to put pop before politics, but has repeatedly been embroiled in world events. Russia was expelled in 2022 after its full-scale invasion of Ukraine. The war in Gaza has been its biggest challenge, with pro-Palestinian protesters demonstrating against Israel outside the last two Eurovision contests in Basel, Switzerland, in May and Malmo, Sweden, in 2024. The war in Gaza has also exposed rifts in the European broadcasting world. Austria, which is set to host after Viennese singer JJ won in May with “Wasted Love,” supports Israel’s participation. Germany, too, is said to back Israel. Iceland, Ireland, the Netherlands, Slovenia and Spain are among the countries that have threatened to sit out the contest if Israel is allowed to take part. Opponents of Israel’s participation criticize the conduct of the war in Gaza, which has left more than 70,000 people dead, according to the territory’s Health Ministry, which operates under the Hamas-run government and whose detailed records are viewed as generally reliable by the international community. Israel’s government has repeatedly defended its campaign as a response to the Oct. 7, 2023, attack by Hamas-led militants that started the war. The militants killed some 1,200 people — mostly civilians — in the attack and took 251 hostage. Voting process is complex. Israel also has faced allegations of interference in the voting process in Eurovision. It’s not clear whether a decrease in violence in Gaza, where a U.S.-brokered ceasefire is holding, or EBU plans to change voting processes to guard against political interference will be enough to placate some broadcasters who are on the fence over the issue. EBU said officials at Thursday’s meeting will be asked to consider that package of new measures, including reducing the number of votes per payment method, and a return of “professional juries” to the semifinals. A vote on participation will only take place if member broadcasters decide those steps are not sufficient to protect the “neutrality and impartiality” of the contest, the broadcasting union said in an email on Wednesday. Members have until mid-December to confirm their participation next year, and a final list will be announced by Christmas, it said. Different scenarios are possible. Eurovision expert Dean Vuletic said a boycott by any EU member country would be significant because they are “not dictatorships” and are meant, like Israel, to share values of democracy, human rights and diversity. “It would be the biggest boycott of Eurovision ever. There have been boycotts in the past, but they have been usually bilateral,” said Vuletic, author of “Postwar Europe and the Eurovision Song Contest.” The least likely scenario, he said, would be for Israel to decide unilaterally sit out: The country’s national broadcaster, Kan, has made no such announcement. The fallout of a boycott could have implications for viewership and money at a time when many broadcasters are under financial pressure from government funding cuts and the advent of social media that has steered away eyeballs. The countries threatening to walk away include some big names in the Eurovision world. Spain is part of the “Big Five” of large-market countries that contribute the most to the contest. Ireland has won seven times, a record it shares with Sweden, while Iceland has the highest-percentage viewing audience of any country, according to Vuletic. The controversy over Israel’s 2026 participation threatens to overshadow the return next year of three countries — Bulgaria, Moldova and Romania — after periods of absence due to financial and artistic reasons. “There are no winners here. Regardless of what happens — whether Israel is in or out, whether countries stay or go — it’s not what Eurovision should be. It’s meant to be joyous and about bringing people together despite our politics,” Jordan said. “Unfortunately it’s become, I think, a bit of a political football.”",
        "image": "/images/eurovision_logo_microphone_stage.webp",
        "slug": "eurovision-debate-over-israel-2026-participation",
        "date": "04, December 2025",
          "author":{
            "name":"Evan Carlisle",
            "role":"U.S. News Reporter",
            "bio":"Evan reports on major U.S. news stories with a focus on clarity, relevance, and timely updates that help readers stay informed about what’s happening across the country.",
            "image":"/images/evan-carlisle.webp",
            "email":"evancarlisle@fiscalfusion.org",
            "twitter":"https://x.com/EvanCarlis90819",
            "facebook":"https://www.facebook.com/profile.php?id=61584747486041",
            "instagram":"https://www.instagram.com/evancarlisle92/",
            "substack":"https://substack.com/@evancarlisle",
            "medium":"https://medium.com/@evancarlisle_85958"
        }
    },
    {
        "category": "world",
        "title": "Canada joins EU defense fund as the country pivots away from the US",
        "shortdescription": "Canada has joined the European Union’s defense fund, signaling a strategic pivot in its military and security partnerships away from sole reliance on the United States.",
        "description": "Canada has joined a major European Union defense fund, Prime Minister Mark Carney’s office said Monday, as the country looks to diversify its military spending away from the United States. The plan allows Canadian defense companies access to a 150 billion euro ($170 billion) EU loan program, known as Security Action for Europe, or SAFE. That would allow Canadians firms to secure cheap, EU-backed loans to procure military equipment. “Canada’s participation in SAFE will fill key capability gaps, expand markets for Canadian suppliers, and attract European defense investment into Canada,” Carney said in a statement. Canada is the first non-EU country to gain access. Carney has said he intends to diversify Canada’s procurement and enhance the country’s relationship with the EU. He has previously said that no more will over 70 cents of every dollar of Canadian military capital spending go to the U.S. U.S. President Donald Trump’s actions — including launching a trade war and suggesting Canada become the 51st U.S. state — infuriated Canadians and created the political environment for Carney to win the job of prime minister after promising to confront Trump’s increased aggression. Carney’s government continues to review the purchase of U.S. F-35 fighter jets to explore other options. Carney has said the potential for having more production in Canada is a factor. A proposal by Sweden’s Saab promised that assembly and maintenance of the Saab Gripen fighter jet would take place in Canada. Canada has said it will meet NATO’s military spending guideline by early next year. Talks on the U.K. joining the SAFE fund ended without agreement last week. Negotiations foundered over money, with Europe demanding more for Britain’s participation than the U.K. was willing to pay.",
        "image": "/images/canada_eu_defense_fund_2025.webp",
        "slug": "canada-joins-eu-defense-fund-shifts-away-from-us",
        "date": "02, December 2025",
          "author":{
            "name":"Evan Carlisle",
            "role":"U.S. News Reporter",
            "bio":"Evan reports on major U.S. news stories with a focus on clarity, relevance, and timely updates that help readers stay informed about what’s happening across the country.",
            "image":"/images/evan-carlisle.webp",
            "email":"evancarlisle@fiscalfusion.org",
            "twitter":"https://x.com/EvanCarlis90819",
            "facebook":"https://www.facebook.com/profile.php?id=61584747486041",
            "instagram":"https://www.instagram.com/evancarlisle92/",
            "substack":"https://substack.com/@evancarlisle",
            "medium":"https://medium.com/@evancarlisle_85958"
        }
    },
    {
        "category": "world",
        "title": "Norway donates a Christmas tree to London every year. Here’s how the tradition began",
        "shortdescription": "Norway donates a giant Christmas tree to London each year — a tradition that began after World War II to thank the UK for its support and symbolize friendship between the two nations.",
        "description": "London’s Christmas tree in Trafalgar Square will be lit up Thursday as part of a British tradition with roots in the Norwegian forest. The tree symbolizes the friendship between London and Oslo in an annual ceremony that highlights the history of the countries’ alliance. The bond between the two countries was forged during World War II. When Nazi Germany invaded Norway in 1940, King Haakon VII and his government-in-exile fled to London. Much of Norway’s resistance work grew out of Britain. The BBC, and its Norwegian counterpart NRK, broadcast the news in Norwegian from London. The reports were a vital lifeline for Norwegians, who listened in secret because of the Nazi radio ban. As a token of its thanks, the Oslo city government established the Christmas tree gift in 1947, two years after the war ended. The tree is always a Norwegian spruce, or Picea abies, grown naturally in the Oslo forest. A few are usually selected as possibilities five to 10 years ahead of time and receive extra care leading up to the final selection. Tree nicknames Nicknamed “Ever Oslo,” this year’s tree is some 20 meters (22 yards) tall and around 60 years old. It beat out two other trees, dubbed “Nordic Star” and “Fjord Fir,” for the honor. The felling ceremony occurred Nov. 21. After the tree was ceremoniously cut Nov. 21, it was loaded into a special cradle and driven about 180 kilometers (112 miles) to a port, where it was rinsed to remove salt accumulated from the roads. From there, it traveled roughly 26 hours aboard a ship — stored below deck to protect it from saltwater — to Immingham, about 239 kilometers (149 miles) north of Trafalgar Square in London. It continued on by truck to the British capital. A replacement tree will be planted in the forest outside Oslo. Lighting ceremony Billed on social media as “Britain’s national tree-sure,” the lighting ceremony signals the start of London’s countdown to Christmas and is traditionally held on the first Thursday in December. Strings of lights hang vertically, following the Norwegian tradition. The tree will remain in the square until Jan. 5, also known as the Twelfth Night of Christmas. It will then be taken down to be chipped and composted for mulch.",
        "image": "/images/norway_london_christmas_tree_2025.webp",
        "slug": "norway-christmas-tree-london-tradition",
        "date": "04, December 2025",
          "author":{
            "name":"Sophie Langford",
            "role":"Business & Finance Correspondent",
            "bio":"Sophie covers business trends and financial developments, offering clear insights that help FiscalFusion readers understand market shifts and economic changes.",
            "image":"/images/sophie-langford.webp",
            "email":"sophielangford@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584953787187",
            "instagram":"https://www.instagram.com/sophielangford9/",
            "substack":"https://substack.com/@sophielangford1",
            "medium":"https://medium.com/@sophielangford_44287"
        }
    },
    {
        "category": "world",
        "title": "The EU lays out a plan to fund Ukraine using frozen Russian assets but Belgium says it’s too risky",
        "shortdescription": "The European Union proposed funding Ukraine with frozen Russian assets, but Belgium warned the plan carries significant legal and financial risks, highlighting divisions within the bloc.",
        "description": "The European Union on Wednesday revealed details of its plan to use billions of euros in frozen Russian assets to fund Ukraine’s needs over the next two years, but Belgium rejected the scheme and insisted that it poses major financial and legal risks. European Commission President Ursula von der Leyen said that the EU would cover two-thirds of Ukraine’s financial and military needs for 2026 and 2027, which the International Monetary Fund puts at 137 billion euros ($160 billion), by providing 90 billion euros ($105 billion). She said that other international partners would be called on to cover the remaining third. “Today we are sending a very strong message to the Ukrainian people. We are with them for the long haul,” said von der Leyen while rolling out the proposal which would use Russian money as collateral to fund Ukraine’s economy and war effort through a “reparations loan.” Von der Leyen said that using the frozen assets would strengthen the Ukrainian position at peace negotiations with Russia and the U.S. but it would also send a message to Moscow that “the prolongation of the war on their side comes with a high cost for them.” She said that she had informed the Trump administration about the proposal. Funding Ukraine EU leaders have committed to fund Ukraine over the next two years, whatever the method. The EU has already poured in over 170 billion euros ($197 billion) since the war started in 2022. Von der Leyen said that if the loan plan didn’t pass muster, the bloc could borrow the money on international markets in a scheme underpinned by its long-term budget. The problem here, though, is that it would require the approval of all 27 member countries, and Hungary has consistently blocked aid to Ukraine. The biggest pot of ready funds available is through frozen Russian assets. Most of the money is held in Belgium – around 194 billion euros as of June – and outside the EU in Japan, with around $50 billion, and the U.S., U.K. and Canada with lesser amounts. A total of 210 billion euros worth ($245 billion) are held in Europe. To address Belgian concerns, the commission’s complex proposal includes safeguards to protect EU nations from “possible retaliation from Russia,” a prohibition of any release of the frozen assets, and a way to borrow money as the EU to “underpin a loan to Ukraine.” Too risky for Belgium But Belgian Foreign Minister Maxime Prévot said that his country considers “the option of the reparations loan the worst of all, as it is risky. It has never been done before.” Russia has described the scheme as “theft.” Haltingly reading prepared remarks to reporters at NATO headquarters in Brussels, Prévot urged the EU to borrow the money for Ukraine on international markets. “It is a well-known, a robust and a well-established option with predictable parameters,” he said. “The reparation loans scheme entails consequential economic, financial and legal risks,” he said, adding that the commission’s proposals do not address Belgium’s concerns. “It is not acceptable to use the money and leave us alone facing the risks.” Belgium fears that the Brussels-based financial clearing house holding the frozen assets, Euroclear, could take legal action if Russia challenges any use of the funds or if the move harms its image and business interests. Prévot said Belgium feels that its concerns are not being heard by its EU partners. “We are not seeking to antagonize our partners or Ukraine. We are simply seeking to avoid potential disastrous consequences for a member state that is being asked to show solidarity without being offered the same solidarity in return,” he said. EU partners say they’re listening. In essence, the 90 billion euros would not be seized from Russia as such, as Kyiv would refund it once Moscow pays significant reparations for the massive destruction its war has caused. Should Moscow refuse, the assets would remain frozen. “We have listened very carefully to Belgium’s concerns, and we have taken almost all of them into account in our proposal,” Von der Leyen said. “We will share the burden in a fair way, as it is the European way.” Other EU partners insist that they too understand Belgium’s worries. “We take Belgium’s concerns seriously,” German Foreign Minister Johann Wadephul told reporters. “They are justified, but the issue can be resolved. It can be resolved if we are prepared to take responsibility together.” His Dutch counterpart David van Weel underlined that “these funds are really, really important. We need to support the Ukrainian economy, otherwise they will have a very tough time next year.” “We understand the Belgian concerns, and we are willing to at least make sure that they are not alone in this,” he said. Several EU countries have already agreed to provide financial guarantees should things go wrong. Belgium has been earning some tax income on the assets, and the interest raised is also being used to fund a loan program for Ukraine organized by the Group of Seven major world powers. The European Central Bank is worried that the plan for an EU reparation loan could undermine confidence in the euro single currency on international markets. EU leaders are due to discuss the scheme and Ukraine’s economic and military needs at a summit in Brussels on Dec. 18.",
        "image": "/images/eu_ukraine_funding_plan_2025.webp",
        "slug": "eu-plan-fund-ukraine-frozen-russian-assets",
        "date": "04, December 2025",
          "author":{
            "name":"Sophie Langford",
            "role":"Business & Finance Correspondent",
            "bio":"Sophie covers business trends and financial developments, offering clear insights that help FiscalFusion readers understand market shifts and economic changes.",
            "image":"/images/sophie-langford.webp",
            "email":"sophielangford@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584953787187",
            "instagram":"https://www.instagram.com/sophielangford9/",
            "substack":"https://substack.com/@sophielangford1",
            "medium":"https://medium.com/@sophielangford_44287"
        }
    },
    {
        "category": "world",
        "title": "Former EU foreign policy chief arrested in latest scandal to hit the bloc",
        "shortdescription": "A former EU foreign policy chief has been arrested amid a growing scandal, marking the latest controversy to shake the European Union’s leadership and credibility.",
        "description": "The European Union’s former foreign policy chief faces corruption accusations alongside two other people arrested this week as part of a fraud investigation, prosecutors said Wednesday, in the latest scandal to hit the 27-nation bloc. The arrest of Federica Mogherini, who led the EU foreign service from 2014 to 2019, risked tarnishing the EU’s international image just as it seeks to assert influence in negotiations aimed at ending the war in Ukraine. The EU has been urging Ukraine to tackle rampant corruption. Authorities in Belgium made the arrests Tuesday after raiding the offices of the EU diplomatic service in Brussels and a college in Bruges. Mogherini now serves as the rector of the College of Europe, a prestigious institute of European studies. The European Public Prosecutor’s Office said in a statement that Mogherini, a senior staff member of the college and a senior official from the European Commission were detained at its request and questioned by the Belgian Federal Judicial Police. “The accusations concern procurement fraud and corruption, conflict of interest and violation of professional secrecy,” the prosecutor’s office said. The three were not considered flight risks and were released, the office said. As the bloc’s top diplomat, Mogherini was responsible for supervising the Iran nuclear talks, leading efforts to improve long-strained relations between Serbia and Kosovo, and a host of other foreign policy and security issues. Police searched the properties of the suspects, several buildings of the college and the headquarters of the European External Action Service, or EEAS, the EU’s equivalent of a foreign office, which sits at the center of the bloc’s institutions in Brussels, the prosecutors said. No outside actor, or country, has been named so far in the investigation. Mogherini said in a statement that she “clarified” her position with investigators on Tuesday. “I have full confidence in the justice system, and I trust that the correctness of the College’s actions will be ascertained,” she said. Mogherini’s lawyer, Mariapaola Cherchi, told The Associated Press that her client was “transparent, clear and serene” during her 10-hour questioning. She said she was confident Mogherini would be cleared “on the basis of such a clear interrogation, without any tension on either side.” The college said it will cooperate with the investigation and that it “remains committed to the highest standards of integrity, fairness, and compliance — both in academic and administrative matters.” The prosecutor’s office, an independent public organization of the EU, said it had “strong suspicions” of fraud in the awarding of a tender to run a 2021-22 training program at the EU Diplomatic Academy for junior diplomats. The former vice president of the European Commission, Josep Borrell, ran the EEAS. The sums involved are relatively small. In establishing the EU Diplomatic Academy, the EU allocated 1.7 million euros ($1.98 million) to cover spending on the training program from July 2024 to June 2025. The corruption case targeting Mogherini is the latest to hit European institutions. Revelations of a cash-for-influence scheme dubbed Qatargate, involving high-profile center-left EU lawmakers, assistants, lobbyists and their relatives, emerged in 2022. Qatari and Moroccan officials were alleged to have paid bribes to influence decision-making. Both countries deny involvement. No one has been convicted or is in pretrial detention, and prospects for a trial are unclear. In March this year, several people were arrested in a probe linked to the Chinese company Huawei, which is suspected of bribing EU lawmakers. Last year, the aide of prominent far-right EU lawmaker Maximilian Krah was arrested in a separate case. German prosecutors alleged the aide was a Chinese agent. Krah, who has since switched to the federal legislature of his native Germany, denied knowledge of the suspicions against his former employee.",
        "image": "/images/eu_former_foreign_policy_arrest_2025.webp",
        "slug": "former-eu-foreign-policy-chief-arrested",
        "date": "03, December 2025",
          "author":{
            "name":"Sophie Langford",
            "role":"Business & Finance Correspondent",
            "bio":"Sophie covers business trends and financial developments, offering clear insights that help FiscalFusion readers understand market shifts and economic changes.",
            "image":"/images/sophie-langford.webp",
            "email":"sophielangford@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584953787187",
            "instagram":"https://www.instagram.com/sophielangford9/",
            "substack":"https://substack.com/@sophielangford1",
            "medium":"https://medium.com/@sophielangford_44287"
        }
    },
    {
        "category": "world",
        "title": "EU updates asylum guidance for Syrians a year after Assad’s fall",
        "shortdescription": "The European Union has updated its asylum guidance for Syrians, aiming to streamline protections and policies a year after the fall of Assad’s regime.",
        "description": "The European Union on Wednesday issued updated guidance for asylum applications by Syrian nationals that reflects new conditions in Syria a year after the fall of the Bashar Assad. The changes may influence the result of asylum requests of some 110,000 Syrians who were still awaiting an asylum decision at the end of September. The European Union Agency for Asylum said opponents of Assad and military service evaders “are no longer at risk of persecution.” But the agency said other groups may be considered at risk in the post-Assad Syria, including people affiliated with the former government and members of the Alawites, Christians, and Druze ethnic-religious groups. While decisions on asylum applications are made at a national level, the agency’s guidance is used to inform the 27 EU member states, as well as Norway and Switzerland. The goal is to create greater coherence between the 29 nations granting international protection. The number of Syrians requesting asylum dropped significantly from 16,000 in October 2024, before the fall of Assad, to 3,500 in September 2025. Still, Syrians had the most number of cases awaiting a decision at first instance. Syria’s conflict that began in March 2011 killed nearly half a million people and displaced half the country’s pre-war population of 23 million. More than 5 million Syrians fled the country as refugees. While most sought refuge in neighboring countries like Turkey, many also went to Europe, contributing to the continent’s refugee crisis in 2015. Between 2012 and June 2025, EU member states plus Norway and Switzerland granted refugee status to around 704,900 applicants from Syria in first instance decisions, according to the European asylum agency. The EUAA said the situation in Syria is “considered improved but volatile” since Assad’s fall in December 2024, and that “indiscriminate violence continues to take place” in certain parts of Syria. Many Syrians had high hopes after Assad was brought down in an offensive by insurgent groups in early December. However, sectarian killings against members of Assad’s Alawite minority sect in Syria’s coastal region and against the Druze minority in the southern province of Sweida earlier this year has claimed hundreds of lives. Still, the agency said it now considers Damascus, the capital, to be safe. The agency also cited two other groups living in Syria who should remain eligible for refugee status: LGBTQ+ people and Palestinians in Syria who no longer receive United Nations assistance or protection. Since the fall of Assad in December, more than one million people have returned to Syria and nearly 2 million internally people have returned to their regions, according to the United Nations High Commissioner for Refugees.",
        "image": "/images/eu_syria_asylum_guidance_2025.webp",
        "slug": "eu-updates-asylum-guidance-syrians",
        "date": "04, December 2025",
         "author":{
            "name":"Travis Monroe",
            "role":"Sports Reporter",
            "bio":"Travis brings fast, engaging coverage of sports highlights, athlete updates, and major events, delivering sharp commentary and essential game-focused reporting for FiscalFusion.",
            "image":"/images/travis-monroe.webp",
            "email":"travismonroe@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584803823704",
            "instagram":"https://www.instagram.com/travismonroe2025/",
            "substack":"https://substack.com/@travismonroe1",
            "medium":"https://medium.com/@travismonroe_60532"
        }
    },
    {
        "category": "world",
        "title": "NATO chief dismisses concerns about US commitment to the alliance ahead of Ukraine meeting",
        "shortdescription": "NATO’s secretary‑general downplayed doubts about the United States’ commitment to the alliance ahead of talks on Ukraine, emphasizing continued transatlantic support.",
        "description": "NATO Secretary-General Mark Rutte brushed off fresh concern Tuesday about the United States’ commitment to the military organization on the eve of a meeting of allied foreign ministers focused on Russia’s war against Ukraine. U.S. Secretary of State Marco Rubio was expected to miss Wednesday’s meeting, which will unfold during high-stakes negotiations in Moscow and in Europe about Ukraine’s future. His rare absence at the American-led alliance comes after President Donald Trump’s 28-point proposal to end the almost four-year war dismayed European allies and Canada last month. At a pivotal moment in NATO’s history, European allies see Russia’s invasion as an existential threat, and senior officials have warned that Russian President Vladimir Putin might launch another attack on Europe in three to five years should he prevail in Ukraine. At the same time, the U.S. insists that its allies must take care of security in their own backyard, and doubts about America’s NATO leadership and the alliance’s unity undermine the organization’s ability to deter an adversary such as Putin. Speaking to reporters ahead of the meeting, Rutte underlined that Rubio has a busy schedule. “He’s working extremely hard to take care not only of the situation of Ukraine, but of course many other issues which are on his plate,” Rutte said. “So I totally accept him not being able to be here tomorrow, and I would not read anything in it.” A senior State Department official, speaking on condition of anonymity to discuss the internal administration reasoning for the absence, said Rubio has already attended dozens of meetings with NATO allies, “and it would be completely impractical to expect him at every meeting.” Deputy Secretary of State Christopher Landau will attend instead and press the allies to deliver on their commitment to invest 5% of gross domestic product on defense. The administration’s draft plan to end the war suggested that NATO would not expand further — a longtime Russian demand — and that Ukraine would not be admitted, breaking with a yearslong promise to Kyiv that it has a place at the organization’s table. The plan also stated that a dialogue would be held between Russia and NATO, mediated by the U.S., to resolve all security issues and create business opportunities. It was unclear how NATO’s most influential member might serve as an impartial mediator. Rutte downplayed contentious parts of Trump’s original plan for ending the war, saying that it has been heavily reworked to address European concerns. “You need to start somewhere. You need to have proposals on the table,” he said. He added: “When it comes to the NATO elements of a deal to end the war against Ukraine, that will be dealt with separately. And that obviously will include NATO.” Despite the proposal to rule out Ukrainian membership, the former Dutch prime minister insisted that the country remains on an “irreversible path” to join the world’s biggest security organization, as NATO leaders pledged in Washington in 2024. But he underlined that it’s politically impossible for Ukraine to become a member, which would require the unanimous agreement of all 32 allies. The Trump administration has ruled that out, and Hungary and Slovakia are also opposed. “Right now, as you know, there is no consensus on Ukraine joining NATO,” Rutte said. At NATO’s last summit in The Hague, Trump reassured European partners when he affirmed the U.S. commitment to Article 5 — the collective security guarantee that says an attack on any ally should be considered an attack on all of them. He described the other NATO leaders as a “nice group of people” and said that “almost every one of them said ‘Thank God for the United States.’” But several of his remarks since then seem to place the United States outside the organization it has long led. “We’re selling a lot of weapons to NATO, and that’s going, I guess, to Ukraine for the most part,” Trump said at a White House meeting with Finnish President Alexander Stubb in October. “That’s up to them, but they’re buying weapons from the U.S.” Concerns are also high about a further U.S. troop drawdown in Europe. Romania announced in October that the United States would reduce its military presence in the country by up to 3,000 troops as it focuses on security threats in Asia and elsewhere. The administration is expected to announce its troop movement plans in early 2026.",
        "image": "/images/nato_us_meeting_2025.webp",
        "slug": "nato-chief-dismisses-us-commitment-concerns",
        "date": "02, December 2025",
         "author":{
            "name":"Travis Monroe",
            "role":"Sports Reporter",
            "bio":"Travis brings fast, engaging coverage of sports highlights, athlete updates, and major events, delivering sharp commentary and essential game-focused reporting for FiscalFusion.",
            "image":"/images/travis-monroe.webp",
            "email":"travismonroe@fiscalfusion.org",
            "twitter":"",
            "facebook":"https://www.facebook.com/profile.php?id=61584803823704",
            "instagram":"https://www.instagram.com/travismonroe2025/",
            "substack":"https://substack.com/@travismonroe1",
            "medium":"https://medium.com/@travismonroe_60532"
        }
    }
]